[
  {
    "id": "ccbe9963-08bd-4efb-b111-c2d480bea96c",
    "name": "Green Pak Choi Stir fry (Chinese Cabbage) with Soya Sauce",
    "description": "This recipe for Green Pak Choi with Soya Sauce is a simple and flavorful side dish that pairs well with a variety of main dishes. The pak choi is stir-fried with garlic and soya sauce, creating a delicious and nutritious addition to your meal. Serve it hot as a tasty accompaniment to your favorite entrees.",
    "ingredients": [
      "1 lb Green pak choi",
      "1 tb Oil",
      "1 tb Soya sauce",
      "2 Cloves sliced garlic"
    ],
    "instructions": [
      "Wash pak choi and drain well",
      " Heat oil and add the garlic then the pak choi",
      " Stir constantly until the pak choi changes colour",
      " Add the soya sauce to taste",
      " Serve hot"
    ],
    "type": "Side Dish",
    "cuisine": "chinese",
    "servings": "1 servings",
    "imageUrl": "ccbe9963-08bd-4efb-b111-c2d480bea96c.jpeg"
  },
  {
    "id": "7e025b8a-dfeb-4bec-ba76-58659c3cba2d",
    "name": "Hot and Sour Chinese Soup",
    "description": "Hot and Sour Chinese Soup is a traditional Chinese dish known for its bold flavors of sourness and spiciness. This soup is a perfect balance of tangy lemon juice, savory soy sauce, and aromatic mushrooms, creating a delightful and comforting meal, typically enjoyed during lunch.",
    "ingredients": [
      "Hot & Sour Chinese Soup",
      "3 c Chicken broth",
      "1 tb Soy sauce, reduced-",
      "Sodium",
      "4 Chinese mushrooms,",
      "Dried, soaked for 15",
      "Minutes in boiling",
      "Water, stems removed",
      "No. 219 Yields 2 Servings",
      "1 Cake soybean curd (tofu),",
      "Cut into 2-inch strips",
      "1/4 Wide",
      "1/4 ts White pepper",
      "2 tb Lemon juice",
      "2 tb Cornstarch, mixed with",
      "3 tb Water, cold"
    ],
    "instructions": [
      "and caps cut into fine 1 egg, lightly beaten strips 2 tsps Oriental sesame oil, 1/2 cup bamboo shoots, cut in- or to 2-inch strips, 1/4- 1/4 tsp hot chili oil inch wide scallions, finely 1/4 lb pork, raw, lean, cut "
    ],
    "type": "Lunch",
    "cuisine": "chinese",
    "servings": "1 Servings",
    "imageUrl": "7e025b8a-dfeb-4bec-ba76-58659c3cba2d.jpeg"
  },
  {
    "id": "de7db836-f5d0-4e01-9f7d-58e686156b28",
    "name": "Chicken with Chinese Mushrooms",
    "description": "This Chicken with Chinese Mushrooms recipe is a flavorful and savory dish that combines marinated chicken with a variety of vegetables and Chinese seasonings. It is a hearty and satisfying meal that is perfect for dinner, offering a balance of protein, vegetables, and rich flavors from the soy sauce, sesame oil, and Chinese spices.",
    "ingredients": [
      "1 c Soy sauce; or more to taste",
      "1 ts Chopped fresh ginger",
      "1/2 ts Baking soda",
      "1 tb Sesame oil",
      "Salt & pepper to taste",
      "2 Boneless chicken breasts; diced 1-inch pieces",
      "2 tb Cooking oil",
      "1 c Onion;coarsely diced",
      "1/2 c Bamboo shoots",
      "1/2 c Water chestnuts",
      "1 c Diced Chinese cabbage",
      "1 c Coarsely chopped broccoli",
      "1 c Bean sprouts",
      "3 lg Chinese Black mushrooms; diced",
      "1 pn (large) sugar",
      "1 pn (large) five-spice powder",
      "1 Splash oyster sauce",
      "1 Splash soy sauce",
      "1 c Chicken broth",
      "2 tb Cornstarch",
      "1/4 c Cold water"
    ],
    "instructions": [
      "Combine 1 cup soy sauce, the ginger, baking soda, sesame oil, & a pinch each of salt & pep- per to make a marinade",
      " Marinate the chicken for 2 hours, drain, & set aside",
      " Preheat a wok over high heat w/ 2 tbs",
      " cooking oil",
      " Add onion & lightly stir-fry",
      " Stir in chicken & then the remaining vegetables",
      " Add sugar, five-spice powder, oyster sauce, & a splash of soy sauce",
      " Add Chicken Broth & bring to boil",
      " Mix corn- starch w/ water to make smooth paste",
      " Slowly pour into Chicken Broth, stirring constantly until stock thickens & becomes clear",
      " Serve",
      " Note: Chinese black mushrooms are available fresh in some larger markets",
      " Otherwise, you can buy them dried",
      " With these, soak to recon- stitute,remove stems, & dice buttons",
      " ORIENT EXPRESS KETCHUM; SUN VALLEY BEVERAGE: TSINGTAO BEER"
    ],
    "type": "Dinner",
    "cuisine": "chinese",
    "servings": "4 Servings",
    "imageUrl": "de7db836-f5d0-4e01-9f7d-58e686156b28.jpeg"
  },
  {
    "id": "4f98e5ce-7715-4315-8727-97a492318b1b",
    "name": "Chicken with Chinese Vegetables",
    "description": "A savory and flavorful dish combining tender chicken with a mix of Chinese vegetables, seasoned with soy sauce and chicken broth. This meal is perfect for dinner and pairs well with cooked rice or chow mein noodles.",
    "ingredients": [
      "1 tb Vegetable oil",
      "4 Skinnless; boneless chicken breasts, cut in bite-sized pieces",
      "1 Onion; chopped",
      "4 Stalks celery; chopped",
      "2 Cloves garlic; minced",
      "1 cn (4.5 oz) mushrooms; stems and pieces",
      "1 cn (28-oz) chop suey vegetables",
      "1/4 c Soy sauce",
      "1 cn Chicken broth",
      "Cooked rice or chow mein noodles"
    ],
    "instructions": [
      "Brown chicken in vegetable oil",
      " Add onions, celery and garlic, cook until browned",
      " Drain chop suey vegetables, add to chicken mixture",
      " Drain and add mushrooms",
      " Add soy sauce and chicken broth",
      " Cover, reduce heat, and simmer for about 30 minutes",
      " Serve over cooked rice or chow mein noodles"
    ],
    "type": "Main",
    "cuisine": "chinese",
    "servings": "1 Servings",
    "imageUrl": "4f98e5ce-7715-4315-8727-97a492318b1b.jpeg"
  },
  {
    "id": "c4373d3c-0566-4ee5-bc53-908d397a9eac",
    "name": "Chinese Barbecue Sauce - Char Sui",
    "description": "Chinese Barbecue Sauce, also known as Char Sui, is a flavorful and savory sauce that is perfect for marinating meats like pork or chicken. The combination of sherry, soy sauce, garlic, plum sauce, black bean paste, hoisin sauce, and Chinese 5-spice creates a complex and delicious flavor profile. This sauce is commonly used in Chinese cuisine to make char siu dishes, which are typically served as a main course for dinner.",
    "ingredients": [
      "1/2 c Sherry",
      "4 Cloves garlic",
      "6 tb Soy sauce",
      "2 ts Plum sauce",
      "2 tb Black bean paste",
      "6 tb Hoisin sauce",
      "2 ts Salt",
      "1 1/2 ts Chinese 5-spice",
      "1/2 c Sugar"
    ],
    "instructions": [
      "Mix together well",
      " Heat in double boiler - add cornstarch for thickening"
    ],
    "type": "Dinner",
    "cuisine": "chinese",
    "servings": "13 Servings",
    "imageUrl": "c4373d3c-0566-4ee5-bc53-908d397a9eac.jpeg"
  },
  {
    "id": "0deb5ea9-9769-446d-a208-ef80eec1550b",
    "name": "Chinese Beef Jerky",
    "description": "Chinese Beef Jerky is a savory and flavorful snack made from thinly sliced beef marinated in a blend of soy sauce, sherry, garlic, ginger, red pepper, and sesame oil. The meat is dried to perfection, resulting in a delicious and chewy jerky that is perfect for snacking on the go or enjoying as a tasty treat.",
    "ingredients": [
      "3 lb Flank steak or London Broil",
      "1/2 c Light Soya Sauce",
      "4 1/2 c Dry Sherry",
      "6 Garlic cloves, minced",
      "1 1/2 tb Ginger, fresh, minced",
      "1 1/2 tb Red pepper, crushed",
      "1 1/2 tb Sesame oil",
      "1 ds Pepper"
    ],
    "instructions": [
      "Cut meat in half, lengthwise and slice diagonally crosswise into paper thin strips 1 1/2\" to 2\" wide and 4\" long",
      " Transfer to a shallow pan",
      " Combine marinade ingredients and rub thoroughly into meat",
      " Arrange meat on racks and let dry at cool room temperature overnight (do not refrigerate)",
      " Preheat oven to 250 degrees",
      " Line two large baking sheets with foil and set wire racks on top of each baking sheet",
      " Arrange meat on racks in single layer",
      " Bake 30 minutes",
      " Reduce heat to 175 degrees and continue to dry meat another 40 minutes",
      " Meat should be lightly brown, but not burnt",
      " Let meat contrinue to dry on racks at cool room temperature overnight before packing into jars",
      " Dried meat can be brushed lightly with sesame oil for additional flavor and shine"
    ],
    "type": "Snack",
    "cuisine": "chinese",
    "servings": "36 Pieces",
    "imageUrl": "0deb5ea9-9769-446d-a208-ef80eec1550b.jpeg"
  },
  {
    "id": "216e618b-db6b-461e-82f6-e3dc4c8ed814",
    "name": "Chinese Chicken Pasta",
    "description": "Chinese Chicken Pasta is a flavorful and satisfying dish that combines tender chicken, earthy shiitake mushrooms, and nutritious spinach in a savory Asian-inspired sauce. This hearty pasta dish is perfect for a comforting dinner that is both delicious and easy to prepare.",
    "ingredients": [
      "1 tb Vegetable oil",
      "1/2 lb Shiitake mushrooms, stems removed and caps sliced",
      "1 tb Finely chopped fresh ginger",
      "1/2 ts Minced garlic",
      "1 c Chicken broth",
      "2 tb Soy sauce",
      "1 1/2 ts Asian sesame oil",
      "1/4 ts Freshly ground pepper",
      "2 c Diced cooked chicken",
      "1/4 c Sliced green onions",
      "1 bn Spinach (10 oz.), washed and chopped",
      "1 lb Spaghetti, cooked according to package directions"
    ],
    "instructions": [
      "Heat vegetable oil in large skillet over medium-high heat",
      " Add mushrooms; cook 5 minutes",
      " Add ginger and garlic; cook 1 minute more",
      " Add chicken broth, soy sauce, sesame oil and pepper; bring to boil and cook 1 minute",
      " Add cooked chicken, green onions and spinach",
      " Toss with hot pasta",
      " PER SERVING Calories 435 Total Fat 9 g Saturated Fat 2 g Cholesterol 42 mg Sodium 644 mg Carbohydrates 62 g Protein 27 g"
    ],
    "type": "Dinner",
    "cuisine": "chinese",
    "servings": "6 Servings",
    "imageUrl": "216e618b-db6b-461e-82f6-e3dc4c8ed814.jpeg"
  },
  {
    "id": "b13c9c58-0f2f-4ff0-bc3d-9d4e4100bf8c",
    "name": "Chinese Egg Rolls",
    "description": "Chinese Egg Rolls are a popular appetizer featuring a delicious filling of shrimp, pork, vegetables, and seasonings wrapped in a crispy egg roll skin. They are deep-fried to a golden brown, creating a crunchy exterior that contrasts perfectly with the savory and flavorful interior. These egg rolls are a classic favorite in Chinese cuisine and are enjoyed as a delightful starter before a main meal.",
    "ingredients": [
      "1 pk Egg roll skins",
      "1/2 Head cabbage, shredded",
      "1/2 Head lettuce, shredded",
      "1 c Water chestnuts",
      "1 Small onion, chopped",
      "1/2 lb Bean sprouts",
      "1/2 c Celery, chopped",
      "1 c Bell pepper, chopped",
      "1/4 c Oil",
      "1/2 lb Shrimp, cooked",
      "1/2 lb Pork cubes, cooked",
      "1 Egg yolk, beaten"
    ],
    "instructions": [
      "Steam cabbage, lettuce, onion, celery and bell pepper until soft but not mushy",
      " In a deep skillet, stir-fry the shrimp and pork in oil for three minutes",
      " Add water chestnuts and cook for 5 minutes",
      " Add cabbage mixture and stir, then add bean sprouts and cook until soft",
      " Place a small amount of this mixture onto egg roll skin",
      " Fold envelope-style (corners together) and seal with a slight amount of egg yolk",
      ", Deep fry until brown or fry in 1/2-inch of oil until brown on each side"
    ],
    "type": "Appetizer",
    "cuisine": "chinese",
    "servings": "1 Servings",
    "imageUrl": "b13c9c58-0f2f-4ff0-bc3d-9d4e4100bf8c.jpeg"
  },
  {
    "id": "f6255d87-79cf-4ef5-bedf-5fd6cf3aaf70",
    "name": "Chinese Egg Rolls: Skins [Large Qty]",
    "description": "Chinese Egg Rolls with homemade skins made from bread flour, eggs, salt, and water. The dough is rolled out and filled with a savory mixture before frying until crispy and golden brown. A popular Chinese appetizer or snack enjoyed for its crispy exterior and flavorful filling.",
    "ingredients": [
      "2 lb Bread flour",
      "4 Eggs, beaten",
      "1 1/2 ts Salt",
      "1 lb Water, cold"
    ],
    "instructions": [
      "Sift the flour and salt together, place in the bowl of the mixing machine",
      " Add the eggs and water, using the paddle, mix at slow speed until the dough is firm and smooth",
      " Turn out the dough onto a floured board and let rest for 10 minutes, keep covered with a damp cloth",
      " Using a rolling pin roll out the dough to a thickness of approximately 1/8 inch",
      " Cut into 6 inch squares",
      " Place 1 to 1 1/2 oz of filling on each 6 inch square of dough, fold in the two sides, so the filling cannot flow out, roll the filled dough tightly, dampen the end with water to secure",
      " Fry the rolls in deep fat at 350F-180C u ntil golden brown; drain",
      " "
    ],
    "type": "Appetizer",
    "cuisine": "chinese",
    "servings": "24 Egg-rolls",
    "imageUrl": "f6255d87-79cf-4ef5-bedf-5fd6cf3aaf70.jpeg"
  },
  {
    "id": "a492d921-1279-42bb-8a2a-52d4e1c4013e",
    "name": "Chinese Leeks Sweet And Sour",
    "description": "Chinese Leeks Sweet And Sour is a savory and flavorful dish that combines the unique taste of Chinese leeks with a sweet and tangy sauce. The leeks are sautéed to perfection in butter and then simmered in a delicious mixture of dark brown sugar, red wine vinegar, and chicken broth. This dish is perfect for a satisfying dinner that will impress your taste buds with its rich and dynamic flavors.",
    "ingredients": [
      "1 lb Chinese leeks",
      "6 tb Butter or margarine",
      "2 tb Dark brown sugar",
      "4 tb Red wine vinegar",
      "1/2 c Chicken broth",
      "Salt and pepper to taste"
    ],
    "instructions": [
      "Prepare 1 lb Chinese leeks by trimming tops and roots",
      " In a wok or frying pan, saute leeks in 6 tbs butter or margarine over low heat for 20 minutes or until soft",
      " Stir occasionally",
      " Add final ingredients and bring to a boil",
      " Reduce to simmer, stirring occasionally for 12-15 minutes or until liquid is absorbed",
      " Salt and peer to taste"
    ],
    "type": "Dinner",
    "cuisine": "chinese",
    "servings": "1 Servings",
    "imageUrl": "a492d921-1279-42bb-8a2a-52d4e1c4013e.jpeg"
  },
  {
    "id": "847df47a-a675-40db-b51f-49d83248f719",
    "name": "Fresh Mozzarella, Italian Sausage and Roasted Pepper Calzon",
    "description": "A delicious and hearty calzone filled with fresh mozzarella, Italian sausage, roasted peppers, and flavorful ingredients, baked to golden perfection. This meal is perfect for a satisfying dinner option.",
    "ingredients": [
      "1 Ball of basic pizza dough (enough dough for 1 pizza)",
      "1 tb Olive oil",
      "Salt and white pepper",
      "1/2 c Thick pesto",
      "1/2 c Roasted garlic",
      "1 c Diced Italian sausage, cooked",
      "1 Red pepper, roasted, peeled, seeded and julienned",
      "2 tb Chiffonade of basil",
      "4 sl (1/2-inch) fresh Mozzarella cheese",
      "1 Egg, beaten",
      "1 c Spicy tomato sauce, hot",
      "2 tb Grated Parmigiano-Reggiano cheese",
      "1 tb Chopped chives",
      "1 tb Brunoise red peppers"
    ],
    "instructions": [
      "Preheat the oven to 500 degrees",
      " Place the dough out onto a floured surface",
      " Roll the dough out to form a 12-inch circle",
      " Spread the pesto over one half of the dough",
      " Layer the garlic, sausage, peppe rs, and basil, alternately over the pesto",
      " Lay the Mozzarella cheese over the basil",
      " Fold the other side of the dough over the filling and pinch the edges to seal the calzone",
      " Make three slashes acro ss the top of the calzone",
      " Place the calzone on a parchment-lined baking sheet",
      " Brush the calzone with the egg wash",
      " Bake for 20 to 25 minutes or until golden",
      " Spoon the sauce in the center of the pl ate",
      " Slice the calzone in half and place in the center of the sauce",
      " Garnish with the grated cheese, chives and brunoise peppers"
    ],
    "type": "Dinner",
    "cuisine": "Italian",
    "servings": "2 Servings",
    "imageUrl": "847df47a-a675-40db-b51f-49d83248f719.jpeg"
  },
  {
    "id": "b3e7c693-270b-4ccb-b0d0-846d4e7c3841",
    "name": "Grandma Demaio's Italian Stew",
    "description": "Grandma DeMaio's Italian Stew is a hearty and flavorful stew made with Italian sausage (or hot dogs), tomatoes, green pepper, zucchini, potatoes, Maui onion, garlic, and a blend of herbs and spices. This stew is a comforting and nostalgic dish that simmers slowly to develop rich flavors. It is a perfect meal for a cozy family dinner, especially during the colder months.",
    "ingredients": [
      "1 lb Italian sausage; or hot dogs",
      "4 lg Tomatoes; peeled and sliced*",
      "1 lg Green pepper; sliced",
      "2 Zucchini; sliced",
      "2 lg Potatoes; sliced",
      "1 lg Maui onion; sliced",
      "3 Cloves garlic; pressed",
      "2 ts Sweet basil",
      "1 ts Oregano",
      "1 ts Parsley",
      "1 ts Salt",
      "1/2 ts Pepper"
    ],
    "instructions": [
      "* or 2-14oz cans This is a very easy recipe",
      " Simply brown the sausage, add all the veggies and cook for about an hour over a low flame",
      " The stew should simmer, but never reach a hard boil",
      " When Grandma didn't have sausage, she often used hot dogs, which we just loved! My husband's grandmother used to make this stew during the harvest season",
      " She and Grandpa lived on a small farm and all the veggies and herbs were grown on the farm",
      " Grandma also made her own Italian sausage",
      " Although I find this rendition a fair imitation, nothing can compare with Grandma's Stew (can't even remember the correct name for it)",
      " Grandma DeMaio's stew was lovingly preparred on top of a wood burning stove! How we all loved it! Per serving: 329 Calories (kcal); 24g Total Fat; (65% calories from fat); 13g Protein; 16g Carbohydrate; 58mg Cholesterol; 921mg Sodium Food Exchanges: 1/2 Grain(Starch); 1 1/2 Lean Meat; 1 1/2 Vegetable; 0 Fruit; 4 Fat; 0 Other Carbohydrates"
    ],
    "type": "Dinner",
    "cuisine": "Italian",
    "servings": "6 servings",
    "imageUrl": "b3e7c693-270b-4ccb-b0d0-846d4e7c3841.jpeg"
  },
  {
    "id": "583b0cad-99a9-4388-bdd0-45b532513e18",
    "name": "Microwave Chicken Breasts Italian",
    "description": "A quick and flavorful recipe for microwave Italian chicken breasts that are juicy and packed with savory flavors. This dish is perfect for a simple and delicious dinner option.",
    "ingredients": [
      "2 tb Olive oil",
      "1 md Onion",
      "1/2 Green pepper; chopped",
      "1/2 ts Oregano",
      "Salt and pepper; to taste",
      "Cayenne pepper; to taste",
      "1/2 Tes capers; drained",
      "1 pn Sugar",
      "1 1/2 ts Balsamic vinegar",
      "4 Chicken breasts without skin"
    ],
    "instructions": [
      "1",
      " Heat 1 1/2 tablespoons oil in a skillet with onion and pepper",
      " Cook until softened, about 5 minutes",
      " Add oregano, salt, black and cayenne peppers, capers and sugar",
      " Cook as additional 2 minutes",
      " 2",
      " Transfer contents of skillet to a food processor and puree",
      " Add remaining oil and balsamic",
      " Taste and correct seasoning",
      " (Recipe can be done ahead to this point) 3",
      " Place chicken breasts in a microwave-oven proof dish or pie plate large enough to hold them in a single layer",
      " Pour sauce over the chicken, cover the casserole loosely with waxed paper and cook on high power for 4 minutes",
      " Turn the chicken, recover and cook an additional 4 minutes or until the chicken is cooked through but still juicy",
      " Partially rotate the dish after 2, 4 and 6 minutes",
      " Set aside for 2 minutes",
      " 4",
      " Spoon 1 or 2 chicken breasts and sauce onto heated plates",
      " Serve with rice or steamed potatoes",
      " NOTES : My MC II shows 28",
      "4 CFF"
    ],
    "type": "Dinner",
    "cuisine": "Italian",
    "servings": "4 servings",
    "imageUrl": "583b0cad-99a9-4388-bdd0-45b532513e18.jpeg"
  },
  {
    "id": "e7f945d4-c16c-4858-b6b8-316b94307337",
    "name": "Chicken with Italian Herbs and Vegetables",
    "description": "A flavorful and healthy dinner recipe featuring boneless, skinless chicken breasts seasoned with Italian herbs like oregano and basil, grilled with a medley of white mushrooms, red and green bell peppers, onions, and garlic. Serve this delicious dish for a satisfying meal that serves 6.",
    "ingredients": [
      "6 Chicken breasts; boneless and skinless",
      "1/2 c White mushrooms; sliced 1/8\" thick",
      "1/2 c Red bell pepper sliced 1/8 \"",
      "1/2 c Green bell pepper sliced 1/8\"",
      "1/2 c Onion; sliced 1/8\"",
      "1 Clove fresh garlic; finely chopped",
      "1 ts Oregano; dried",
      "1 ts Basil; dried",
      "1 ts Salt",
      "1/2 ts Black pepper",
      "Canola oil as needed"
    ],
    "instructions": [
      "Flatten the chicken breasts between 2 sheets of plastic wrap with a mallet or heavy, flat-bottomed saucepan or skillet",
      " Breasts should be a uniform thickness of about 1/2\"",
      " Rub the oregano, basil, salt and black pepper into the meat and then brush lightly with canola oil",
      " Brush both sides of the Grilling Machine with oil and allow to pre-heat about 5 minutes",
      " Mix all the vegetables together",
      " Place veggies on the Grilling Machine, spread them out, and cover with the chicken",
      " Grill for 7-8 minutes",
      " Serves 6"
    ],
    "type": "Dinner",
    "cuisine": "Italian",
    "servings": "1 Servings",
    "imageUrl": "e7f945d4-c16c-4858-b6b8-316b94307337.jpeg"
  },
  {
    "id": "7e241285-15f4-4730-ac7d-459334ed5f39",
    "name": "Chicago Italian Beef Sandwiches",
    "description": "Chicago Italian Beef Sandwiches are a classic Chicago-style dish featuring thinly sliced roast beef simmered in flavorful herbs and spices. The beef is served on Italian bread with grilled green peppers or giardiniera relish, creating a hearty and satisfying meal perfect for dinner.",
    "ingredients": [
      "2 lb Beef roast, leftover,",
      "Pre-roasted",
      "Roasting pan drippings",
      "2 tb Fresh oregano, finely",
      "Chopped",
      "OR 2 teaspoon dried",
      "Oregano, crushed",
      "1 tb Fresh sweet basil,",
      "Finely chopped",
      "OR 1 teaspoon dried",
      "Basil, crushed",
      "1 ts Whole black peppercorns",
      "1/2 ts Red pepper, ground (1/2",
      "To 1)",
      "1 tb Fresh parsley, minced",
      "Salt, to taste",
      "3 cl Garlic, minced",
      "1 Fresh green pepper seeded",
      "And",
      "sl Into 1/4 inch strips"
    ],
    "instructions": [
      "Thinly slice cooked, roast beef and place in a Dutch oven (or put it back into the same pan in which the beef was roasted)",
      " Add enough water to cover",
      " Add remaining ingredients and bring to simmer",
      " After the beef has cooked for awhile, taste and adjust seasonings",
      " Cook about 1 hour",
      " Serve beef only on Italian bread with grilled green peppers and / or giardinera relish",
      " As you serve dip the sandwich in your gravy"
    ],
    "type": "Dinner",
    "cuisine": "Italian",
    "servings": "8 Servings",
    "imageUrl": "7e241285-15f4-4730-ac7d-459334ed5f39.jpeg"
  },
  {
    "id": "14f8fed4-9fdc-4efd-b81c-81368fb2dc40",
    "name": "Vlf Italian Potato Salad",
    "description": "A refreshing and flavorful salad made with new red potatoes, red onion, black olives, cucumber, tomato, and a zesty fat-free Italian dressing. This salad is perfect for a light lunch or as a side dish for a summertime barbecue. The combination of fresh ingredients and tangy dressing makes it a delicious and healthy choice.",
    "ingredients": [
      "1 lb New red potatoes",
      "1/4 c Water",
      "1 sm Red onion, thinly sliced",
      "x Several sliced ripe black",
      "Olives (optional)",
      "1 sm Cucumber, chopped",
      "1 Tomato, chopped",
      "1/2 c Fat free Italian dressing",
      "2 tb Snipped fresh parsley"
    ],
    "instructions": [
      "1",
      " Scrub potatoes; cut crosswise into 1/4 in",
      " slices",
      " Place in 1 1/2 qt",
      " microwave safe casserole",
      " Add water",
      " Cover with lid",
      " Microwave on high for 9-10 min",
      " or until potatoes are tender; stirring once",
      " Drain and cool",
      " 2",
      " Add onions, olives, cucumber, tomato, dressing and parsley",
      " Mix lightly to coat evenly",
      " Refrigerate until chilled",
      " Stir before serving"
    ],
    "type": "Lunch",
    "cuisine": "Italian",
    "servings": "1 Servings",
    "imageUrl": "14f8fed4-9fdc-4efd-b81c-81368fb2dc40.jpeg"
  },
  {
    "id": "7068338f-4795-42ca-9a8e-7d835fc4f64a",
    "name": "Halibut Italiano",
    "description": "A flavorful and cheesy dish featuring halibut fillets baked with spaghetti sauce, mushrooms, olives, and cheese. This Halibut Italiano recipe is a delicious and satisfying dinner option.",
    "ingredients": [
      "1 1/2 lb Halibut fillets cut into 4 servings",
      "2 c Prepared spaghetti sauce",
      "1/2 c Sliced mushrooms",
      "1/4 c Sliced olives",
      "1/2 c Mozzarella or cheddar cheese",
      "Olive oil"
    ],
    "instructions": [
      "Place fish in oiled baking pan",
      " Top with mushrooms and olives",
      " Pour spaghetti sauce over the top and bake for 10 minutes at 400o",
      " Remove from oven and sprinkle with cheese",
      " Bake 10 more minutes or until fish flakes easily with a fork",
      " Serve with chopped parsley over the top and a lemon wedge on the side"
    ],
    "type": "Dinner",
    "cuisine": "Italian",
    "servings": "1 Servings",
    "imageUrl": "7068338f-4795-42ca-9a8e-7d835fc4f64a.jpeg"
  },
  {
    "id": "857ce942-fb13-4a37-a41b-51cd3cf0871d",
    "name": "Giardiniera #5 - Italian",
    "description": "Giardiniera is an Italian pickled vegetable medley that includes a variety of vegetables like cauliflower, broccoli, carrots, onions, garlic, and green olives, along with fresh chiles. This pickled mix is tangy, crunchy, and full of flavor, making it a perfect condiment to accompany sandwiches, salads, or antipasto platters.",
    "ingredients": [
      "Fresh chiles of choice",
      "1/2 Part water",
      "1/2 Part vinegar",
      "1 ts Non-idodized salt per pint of liquid",
      "Cauliflower; in flowerets",
      "Broccoli; in flowerets",
      "Carrots; cut in coins",
      "Use baby carrots",
      "Pearl onions",
      "Garlic cloves; whole",
      "Green olives"
    ],
    "instructions": [
      "\"This basic recipe can be used for pickling chiles either alone or with a combination of other vegetables",
      " Choose the mixture of vegetables desired, the amount and type of chiles, and arrange them attractively in a jar before covering with the pickling solution",
      "\" Wash the chiles and with a toothpick poke several holes near the stem before packing in the jars",
      " Combine the water, vinegar, and salt in a pan and boil for a minute",
      " Pour the hot mixture over the vegetables leaving 1/4 inch head space and cover",
      " Allow the chiles and vegetables to pickle for 2 to 3 weeks before serving"
    ],
    "type": "Condiment",
    "cuisine": "Italian",
    "servings": "1 Servings",
    "imageUrl": "857ce942-fb13-4a37-a41b-51cd3cf0871d.jpeg"
  },
  {
    "id": "cebe6de8-5af9-4f0f-901b-4c7f2799b8e8",
    "name": "Crockpot Fondue Italiano",
    "description": "Crockpot Fondue Italiano is a delicious and hearty Italian meal perfect for dinner. It features a rich and flavorful combination of ground beef, cheeses, tomato sauce, and a hint of red wine, all cooked to perfection in a crock-pot. Serve this fondue with chunks of Italian bread for a cozy and satisfying meal.",
    "ingredients": [
      "1 lb Lean ground beef",
      "8 oz Mozzarella cheese",
      "1 Envelope spaghetti sauce mix",
      "2 15 oz cans tomato sauce",
      "2 tb Cornstarch",
      "1 lb Sharp cheddar cheese",
      "1/2 c Dry red wine"
    ],
    "instructions": [
      "In a skillet or crock-pot with a browning unit, cook beef until crumbly; pour off excess fat",
      " In the crock- pot, combine beef with dry spaghetti sauce mix, tomato sauce, cheddar and mozzarella cheeses",
      " Cover and cook on low for 2 hours",
      " Dissolve cornstarch in the wine",
      " Turn control to high",
      " Add dissolved cornstarch",
      " Heat on high for 10 to 15 minutes",
      " Dip chunks of Italian bread into the fondue while > keeping the mixture hot in the crock-pot",
      " Makes 6 to 8 serv"
    ],
    "type": "Dinner",
    "cuisine": "Italian",
    "servings": "1 Servings",
    "imageUrl": "cebe6de8-5af9-4f0f-901b-4c7f2799b8e8.jpeg"
  },
  {
    "id": "4c76e986-1f99-417b-814a-a134b63a4713",
    "name": "Crockpot Italian Beef #1",
    "description": "Crockpot Italian Beef is a flavorful and tender dish made with a rump roast seasoned with Italian dressing mix, au jus gravy packet, Italian seasoning, and pepperocini peppers. Slow-cooked to perfection, this dish is savory and perfect for a hearty dinner.",
    "ingredients": [
      "1 Rump roast; 3-5 lbs",
      "1 pk Good Seasons Italian dressing mix",
      "1 c Water",
      "1 pk Au jus gravy packet",
      "2 ts Italian seasoning",
      "6 Pepperocini peppers"
    ],
    "instructions": [
      "NOTES : can also be made with 4 lb chuck roast, 1 pkg dressing mix and 1/2 cup water",
      " MASTERCOOK RECIPES LIST SERVER"
    ],
    "type": "Dinner",
    "cuisine": "Italian",
    "servings": "8 Servings",
    "imageUrl": "4c76e986-1f99-417b-814a-a134b63a4713.jpeg"
  },
  {
    "id": "afbc263c-413e-4199-98ff-58625d9b6f44",
    "name": "Greek Couscous",
    "description": "Greek Couscous is a fresh and flavorful salad featuring couscous, plum tomatoes, cucumber, feta cheese, olives, red onion, and chickpeas, all tossed in a zesty lemon and olive oil dressing. This Mediterranean-inspired dish is perfect for a light and satisfying lunch option.",
    "ingredients": [
      "1 1/2 c Water",
      "1 c Couscous",
      "1/2 ts Dried Oregano",
      "1 1/2 c Plum Tomatoes; Diced",
      "1 c Cucumber; Peeled And Diced",
      "1/3 c Crumbled Feta Cheese",
      "1/4 c Ripe Olives; Halved",
      "3 tb Diced Red Onion",
      "15 1/2 oz Chickpeas; Canned, Drained",
      "1/4 c Water",
      "3 tb Lemon Juice",
      "1 1/2 tb Extra-Virgin Olive Oil",
      "1/4 ts Salt",
      "1/4 ts Coarsely Ground Pepper"
    ],
    "instructions": [
      "Bring 1 1/2 cups water to a boil in a medium saucepan; stir in couscous and oregano",
      " Remove from heat; cover and let stand 5 minutes",
      " Fluff with a fork",
      " Combine couscous, tomatoes, and next 5 ingredients (tomatoes through chickpeas) in a bowl; set aside",
      " Combine 1/4 cup water and remaining ingredients; stir well with a whisk",
      " Pour dressing over couscous mixture, tossing gently to coat"
    ],
    "type": "Lunch",
    "cuisine": "Greek",
    "servings": "4 servings",
    "imageUrl": "afbc263c-413e-4199-98ff-58625d9b6f44.jpeg"
  },
  {
    "id": "e3989189-aaa7-4bfb-8c7f-aea93fc54f2d",
    "name": "Greek Duck with Olives",
    "description": "This Greek Duck with Olives recipe is a savory and hearty dish that features tender duck pieces simmered in a flavorful Greek Tomato Sauce with green olives. The dish is rich in taste, with a hint of dry red wine adding depth to the flavors. The caramelized onions and seasonings like salt and freshly-ground black pepper enhance the overall taste profile. This meal is perfect for a special dinner occasion, offering a taste of Greece with each bite.",
    "ingredients": [
      "4 lb Duck; cut into 6 pieces",
      "3 tb Olive oil",
      "1 Yellow onion; peeled and sliced",
      "2 c Greek Tomato Sauce; see * Note",
      "1/2 c Dry red wine",
      "1 c Green olives",
      "Salt; to taste",
      "Freshly-ground black pepper; to taste"
    ],
    "instructions": [
      "* Note: See the \"Greek Tomato Sauce\" recipe which is included in this collection",
      " Heat a 6-quart stove-top casserole and add the oil",
      " Brown the duck pieces and remove from the pan",
      " Saute the onion and then add all ingredients to the pot",
      " Cover and bring to a simmer",
      " You may need a bit of water",
      " Simmer until tender, about 1 1/2 hours",
      " Watch that it does not dry out, in which case you must add a bit more water",
      " This recipe serves 6",
      " Comments: This dish is a smash",
      " I tasted it for the first time in a fine restaurant on the outskirts of Athens and the recipe is simple to duplicate",
      " You will have no problem with this one"
    ],
    "type": "Dinner",
    "cuisine": "Greek",
    "servings": "6 servings",
    "imageUrl": "e3989189-aaa7-4bfb-8c7f-aea93fc54f2d.jpeg"
  },
  {
    "id": "b950c020-5263-4164-9d16-56e2fd3d7254",
    "name": "Greek Easter Braided Bread",
    "description": "Greek Easter Braided Bread is a traditional sweet bread enjoyed during the Easter season in Greece. It is a festive and symbolic bread that is braided and adorned with red-dyed eggs, making it a perfect treat for Easter celebrations. The bread is sweet, aromatic, and rich in flavors from ingredients like orange zest, lemon zest, and mahlepi. Enjoy it as a delightful dessert to complement your Easter festivities.",
    "ingredients": [
      "2 pk Active dry yeast -; (1/4 oz ea)",
      "2 c Warm milk",
      "9 c All-purpose flour; plus more",
      "1 1/2 c Sugar",
      "2 ts Mahlepi; see * Note",
      "1 Stick unsalted butter; melted, cooled",
      "Butter for bowl and baking sheet",
      "6 lg Eggs",
      "1 tb Orange zest; grated",
      "1 tb Lemon zest; grated",
      "1/2 ts Salt",
      "4 Hard-boiled eggs; dyed red",
      "1 tb Sesame seeds"
    ],
    "instructions": [
      "* Note: A fruity spice available at Greek food stores",
      " In a large bowl, dissolve yeast in milk",
      " Stir in 1 cup flour and 1/2 cup sugar",
      " Cover bowl with plastic wrap, and set aside for 1 hour",
      " Meanwhile, steep mahlepi in 1/2 cup simmering water",
      " Let stand for 5 minutes",
      " Strain, and discard mahlepi",
      " Let cool",
      " Add mahlepi infusion, butter, and five eggs to yeast mixture, and combine thoroughly",
      " Add orange and lemon zest",
      " Sift in flour, sugar, and salt; stir with a wooden spoon until dough is formed",
      " Knead dough in bowl until smooth, about 10 minutes",
      " Form dough into a ball, and transfer to a lightly buttered bowl",
      " Cover, and let rise for 2 hours",
      " Punch dough down, and transfer to a lightly floured surface",
      " Divide dough into six equal pieces",
      " Roll each piece of dough into a rope, about 15-inches long",
      " Tightly braid three ropes together, beginning in the middle",
      " Repeat with remaining three ropes",
      " Tuck a red egg into the first and last plait, using a small piece of dough coiled around each egg to hold in place, if necessary",
      " Place each loaf on a buttered baking sheet, cover loosely with plastic wrap, and set aside to rise for 1 hour",
      " Heat oven to 350 degrees",
      " Beat remaining egg with 1 tablespoon water",
      " Brush bread with egg wash, and sprinkle with sesame seeds",
      " Transfer to oven, and bake until golden, 50 to 60 minutes",
      " Makes 2 large loaves"
    ],
    "type": "Dessert",
    "cuisine": "Greek",
    "servings": "1 servings",
    "imageUrl": "b950c020-5263-4164-9d16-56e2fd3d7254.jpeg"
  },
  {
    "id": "69ac2628-511c-4a33-8612-096a5f3da0f7",
    "name": "Greek Fetta Dressing",
    "description": "A refreshing and tangy Greek Fetta Dressing that is perfect for salads or as a dip.",
    "ingredients": [
      "80 g Mild fetta cheese",
      "3 tb Plain yoghurt",
      "1 Lemon; juice of",
      "1 ts Fresh chopped mint",
      "1 tb Fresh chopped marjoram",
      "1 ts Fresh chopped oregano",
      "1 Clove garlic; minced",
      "Cracked black pepper"
    ],
    "instructions": [
      "Process the fetta, yoghurt and lemon until smooth then fold in the herbs, garlic and pepper",
      " Thin with a little extra lemon juice or water if desired",
      " Per serving: 16 Calories (kcal); trace Total Fat; (4% calories from fat); 1g Protein; 7g Carbohydrate; 0mg Cholesterol; 2mg Sodium Food Exchanges: 0 Grain(Starch); 0 Lean Meat; 0 Vegetable; 1/2 Fruit; 0 Fat; 0 Other Carbohydrates"
    ],
    "type": "Dressing",
    "cuisine": "Greek",
    "servings": "1 servings",
    "imageUrl": "69ac2628-511c-4a33-8612-096a5f3da0f7.jpeg"
  },
  {
    "id": "dfdaf751-5bea-4abb-8110-6f58ba875bdf",
    "name": "Greek Grainberry Salad",
    "description": "Greek Grainberry Salad is a refreshing and nutritious salad made with spelt berries, red onion, cucumber, red pepper, fresh herbs, and a tangy dressing of olive oil and lemon juice. It can be served as a satisfying lunch option that is light yet filling, perfect for a healthy midday meal. The optional addition of feta cheese adds a creamy and savory element to the salad.",
    "ingredients": [
      "1 c Spelt berries",
      "4 c Water",
      "1/2 c Thinly sliced red onion",
      "1/2 c Julienned seedless cucumber",
      "1/2 c Julienned red pepper",
      "2 tb Minced fresh dill",
      "1 tb Minced fresh mint",
      "1/4 c Extra virgin olive oil",
      "3 tb Fresh lemon juice",
      "1 Garlic clove; minced",
      "1/2 c Crumbled feta cheese; (optional)",
      "Salt and white pepper"
    ],
    "instructions": [
      "6 servings 1",
      " In a medium saucepan, combine spelt berries and water",
      " Bring to a boil, then reduce heat and simmer for 1 hour, or until just render",
      " Drain well and chill",
      " 2",
      " In a large bowl, combine chilled spelt, onion, cucumber, red pepper, dill, mint, olive oil, lemon juice, and garlic",
      " Fold in feta cheese, if desired",
      " Season to taste with salt and pepper, and refrigerate until served",
      " LACT0/VEGAN PER SERVING: 190 CAL (43% from fat) 5g PROT",
      " 9g FAT",
      " 23g CARB",
      " 62mg SOD",
      " 0mg CHOL, 5g FIBER"
    ],
    "type": "Lunch",
    "cuisine": "Greek",
    "servings": "6 servings",
    "imageUrl": "dfdaf751-5bea-4abb-8110-6f58ba875bdf.jpeg"
  },
  {
    "id": "3aaea157-e7c5-4f8f-8293-7a19ec806323",
    "name": "Greek Island Salad",
    "description": "This Greek Island Salad is a refreshing and flavorful dish featuring ripe Queensland tomatoes, Spanish onion, Fetta cheese, Kalamata olives, and a zesty dressing of extra virgin olive oil and fresh lemon juice. It is garnished with parsley and seasoned with salt and black pepper. This salad is perfect for a light lunch or as a side dish for dinner. Serve it with pita bread, Turkish bread, or warm crusty Italian bread for a satisfying meal.",
    "ingredients": [
      "4 Firmly ripe Queensland tomatoes; (the tomatoes must be ripe)",
      "1 Spanish onion; peeled and finely sliced",
      "250 g Fetta cheese; cut into small dice",
      "250 g Kalamata olives",
      "2 tb Extra virgin olive oil",
      "Juice 1 fresh lemon",
      "Few sprigs flat-leaf parsley",
      "Salt and freshly milled black pepper"
    ],
    "instructions": [
      "Chop tomatoes into chunks then put into a salad bowl with sliced onion and fetta cheese",
      " Add olives and then drizzle with olive oil and fresh lemon juice",
      " Scatter over roughly chopped parsley leaves and then season with a little salt and a generous quantity of freshly milled black pepper",
      " Serve with pita bread, Turkish bread or with warm crusty Italian bread",
      " Serves 4 19 Fat; 0 Other Carbohydrates"
    ],
    "type": "Salad",
    "cuisine": "Greek",
    "servings": "1 servings",
    "imageUrl": "3aaea157-e7c5-4f8f-8293-7a19ec806323.jpeg"
  },
  {
    "id": "ac501b12-1673-40ee-a0ae-d6d1ca092874",
    "name": "Greek Lamb And Potato Kabobs",
    "description": "Delicious Greek lamb and potato kabobs seasoned with oregano, served with a refreshing tomato and cucumber mixture, warm pita bread, and a wedge of lemon. A flavorful and satisfying meal perfect for dinner.",
    "ingredients": [
      "1 lb Cubed; (1-inch) lamb loin",
      "Olive oil",
      "Salt",
      "Freshly ground black pepper",
      "2 tb Finely chopped fresh oregano leaves",
      "8 Wooden; (soaked in water) or metal skewers",
      "1/2 lb Idaho potatoes; peeled and cubed 1/2-inch thick, blanched",
      "1 md Onion; chopped into 1/2-inch pieces",
      "1 c Chopped tomatoes; seeded",
      "1 c Chopped cucumbers; peeled and seeded",
      "1/2 ts Chopped garlic",
      "1 tb Finely chopped fresh parsley leaves",
      "Drizzle of extra-virgin olive oil",
      "12 Kalamata olives; pitted and halved",
      "8 Rounds fresh pita bread; warm and quartered",
      "4 Wedges fresh lemon"
    ],
    "instructions": [
      "Preheat the grill",
      " Season the lamb with olive oil, salt, pepper and oregano",
      " Alternating with the lamb, potatoes and onions, place on each skewer",
      " In a mixing bowl, combine the tomatoes, cucumbers, garlic, parsley and olives",
      " Season with a drizzle of the extra virgin olive oil, salt and pepper",
      " Mix well and set aside",
      " Place the lamb on the grill and cook for 3 to 4 minutes on each side for medium rare",
      " Remove from the grill and cool for a couple of minutes",
      " To serve, place the kabobs on a large platter",
      " Spoon the tomato mixture over the kabobs",
      " Serve with the warm pita bread and a wedge of lemon",
      " Yield: 4 servings Per serving: 396 Calories (kcal); 13g Total Fat; (28% calories from fat); 8g Protein; 65g Carbohydrate; 0mg Cholesterol; 751mg Sodium Food Exchanges: 2 1/2 Grain(Starch); 0 Lean Meat; 4 Vegetable; 0 Fruit; 2 1/2 Fat; 0 Other Carbohydrates"
    ],
    "type": "Dinner",
    "cuisine": "Greek",
    "servings": "1 servings",
    "imageUrl": "ac501b12-1673-40ee-a0ae-d6d1ca092874.jpeg"
  },
  {
    "id": "b42aec69-6994-4426-9f42-c804464a0466",
    "name": "Greek Lamb Salad in Tortilla Bowls",
    "description": "This Greek-inspired meal features a flavorful combination of lean ground lamb, fresh vegetables, and a zesty yogurt dressing, all served in crispy tortilla bowls. It's a satisfying and delicious lunch option.",
    "ingredients": [
      "4 Tortillas",
      "1 tb Olive oil",
      "1 lb Lean ground lamb",
      "1 ts Cumin",
      "1/2 c Plain yogurt",
      "1 ts Minced garlic",
      "3 tb Lime juice",
      "3 tb Chopped cilantro",
      "8 Cherry tomatoes - quartered",
      "1 c Diced cucumber",
      "1 Head romaine lettuce - shredded"
    ],
    "instructions": [
      "Directions: To make the tortilla bowls, form aluminum foil molds and place them open side down on a baking sheet",
      " Spray each tortilla with cooking spray and place over the mold",
      " Bake at 425 degrees for 8-10 minutes until golden",
      " To make the salad, heat the olive oil in a large skillet",
      " Add the lamb and cumin and cook until crumbly and no longer pink",
      " Drain and set aside",
      " Combine the yogurt, garlic, lime juice, cilantro, tomatoes, and cucumber in a mixing bowl",
      " Fill each tortilla bowl with a small handful of shredded romaine",
      " Top with the cooked lamb and a spoonful of dressing"
    ],
    "type": "Lunch",
    "cuisine": "Greek",
    "servings": "1 servings",
    "imageUrl": "b42aec69-6994-4426-9f42-c804464a0466.jpeg"
  },
  {
    "id": "0377e3f8-bced-4ffa-81b3-c1d110e9f994",
    "name": "Greek Lemon-Rice Soup",
    "description": "A delicious and comforting Greek Lemon-Rice Soup that is perfect for a light and flavorful lunch option. This soup is infused with the tangy flavors of lemon juice and fresh parsley, creating a refreshing and satisfying meal.",
    "ingredients": [
      "3 1/2 c Fat-free vegetable broth",
      "1/4 c Long-grain rice",
      "2 lg Cloves garlic; minced",
      "1/4 c Fresh or frozen; lemon juice, thawed, (up to 1/3)",
      "1 Egg; slightly beaten",
      "2 tb Finely chopped parsely",
      "Salt and white pepper; to taste"
    ],
    "instructions": [
      "Heat broth in medium saucepan; stir in rice and garlic",
      " Reduce heat and simmer, covered, until rice is tender, about 25 minutes",
      " Reduce heat to low",
      " Mix lemon juice and egg; slowly stir mixture into soup",
      " Stir in parsley; season to taste with salt and white pepper",
      " Pour soup into bowls",
      " Per 1 cup serving \u003d 106 calories, 2 gm fat, 53 mg cholesterol, 31 mg sodium, 14 gm carbohydrate, 3 gm protein Exchanges: 1 bread"
    ],
    "type": "Lunch",
    "cuisine": "Greek",
    "servings": "4 Servings",
    "imageUrl": "0377e3f8-bced-4ffa-81b3-c1d110e9f994.jpeg"
  },
  {
    "id": "b7bc415e-ac51-45b8-9e6f-c09920a05094",
    "name": "Greek Lentil Soup <t>",
    "description": "This Greek Lentil Soup is a hearty and nutritious dish that is perfect for a comforting dinner. Made with lentils, fresh vegetables, and a blend of aromatic spices, this soup is flavorful and satisfying. The addition of green beans adds a delightful crunch, making it a wholesome and delicious meal option.",
    "ingredients": [
      "2 lg Onions; chopped",
      "2 tb Olive oil",
      "3 Cloves garlic; minced",
      "1/2 ts Turmeric",
      "1/2 ts Ground coriander",
      "4 c Chopped fresh tomatoes; or 2, (16-ounce) cans",
      "1 lb Lentils; or 2 cups red or brown, rinsed",
      "8 c Vegetable stock",
      "1/2 lb Green beans; ends trimmed cut into 1-inch pieces",
      "2 tb Chopped fresh oregano; or2 teaspoons dried",
      "Salt and pepper",
      "Light brown sugar; optional"
    ],
    "instructions": [
      "Faki Soupa (Lentil Soup): Typical of simple, one-pot Greek dishes, this can be made with cooked white beans, too",
      " Tested by Pat and Bob 2/99",
      " We added 2 teaspoons of brown sugar to off-set the salty-flatness of bouillon",
      " Hearty bean and tomato soup with the crunch of fresh green beans",
      " In a large heavy pot, saute onions in oil over medium heat until translucent, about 5 minutes",
      " Stir in garlic, turmeric, and coriander, and cook for 30 seconds",
      " Add tomatoes, lentils, and stock, and bring to boil",
      " Reduce heat and simmer, partially covered, until lentils are tender, about 40 minutes",
      " Add green beans and oregano, and continue cooking until beans are tender, about ten minutes",
      " Season to taste with salt and pepper",
      " If the soup tastes salty and gritty, add a small amount of brown sugar",
      " Simmer until mellow",
      " PER SERVING (1+1/4 cup): 241 CAL (18% from fat), 10",
      "7g PROT, 4",
      "8g FAT, 38g CARB, 114mg SOD, 0mg CHOL, 6",
      "3g FIBER"
    ],
    "type": "Dinner",
    "cuisine": "Greek",
    "servings": "8 servings",
    "imageUrl": "b7bc415e-ac51-45b8-9e6f-c09920a05094.jpeg"
  },
  {
    "id": "df854434-6a68-4295-bb9a-653a7099a210",
    "name": "Electronic Gourmet's French Dressing",
    "description": "This French Dressing recipe is a classic and versatile dressing that can be used to elevate any salad. It has a balanced combination of vinegar, olive oil, salt, and pepper, with options to customize with variations like garlic or sweet additions. This dressing is easy to make and can be stored for a few days to enhance the flavors. It's perfect for adding a flavorful touch to salads for any meal.",
    "ingredients": [
      "1/4 c Red or White Wine Vinegar",
      "1/4 ts Salt",
      "1/8 ts White Pepper",
      "3/4 c Olive Oil"
    ],
    "instructions": [
      "In a bowl mix vinegar, salt and pepper with a fork",
      " Add oil and mix vigerously until well blended and slightly thickened",
      " Variations: Garlic French Dressing: Drop 1 peeled, bruised clove of garlic into dressing and let stand 2-3 days at room temperature",
      " Remove garlic before using dressing",
      " Sweet French Dressing: Prepare as directed",
      " Then mix in 1/4 c each of orange juice and honey or super fine sugar",
      " Use to dress fruit salads",
      " Hints: For a creamier dressing, beat over ice for 1 to 2 minutes"
    ],
    "type": "Salad Dressing",
    "cuisine": "French",
    "servings": "1 Cup",
    "imageUrl": "df854434-6a68-4295-bb9a-653a7099a210.jpeg"
  },
  {
    "id": "f21f334c-5b42-4632-a324-baf93d9f3c33",
    "name": "Electronic Gourmet's French Onion Soup",
    "description": "This French Onion Soup recipe is a classic and hearty dinner option. It features caramelized onions in a flavorful broth, topped with toasted bread and melted Swiss cheese. The rich flavors and comforting warmth make it a perfect choice for a cozy evening meal.",
    "ingredients": [
      "1 1/2 lb Yellow Onions, thinly sliced",
      "(about 5 cups)",
      "3 tb Butter",
      "1 tb Oil",
      "1 ts Salt",
      "1/4 ts Sugar",
      "3 tb Flour",
      "8 c Boiling Brown Stock",
      "1/2 c Dry White Wine or Vermouth",
      "3 tb Cognac",
      "Rounds of Hard Toasted Bread",
      "2 c Swiss Cheese, grated"
    ],
    "instructions": [
      "1) Cook the onions slowly with the butter and oil in a covered saucepan for 15 minutes",
      " 2) Uncover, raise the heat to moderate and stir in the salt and sugar",
      " Cook for 30 to 40 minutes stirring frequently until the onions have turned and even, deep golden brown",
      " 3) Sprinkle in the flour and stir 3 minutes",
      " 4) Off heat, blend in the boiling liquid",
      " Note that instead of brown stock you may use canned beef bouillon (same quantity)",
      " Or, and equal part of boiling water plus stock or bouillon",
      " 5) Add the wine and season to taste",
      " Simmer partially covered for 30 to 40 minutes or more, skimming occasionally",
      " Correct Seasoning",
      " 6) Set aside uncovered until ready to serve, then reheat to simmer",
      " 7) Just before serving, stir in the cognac",
      " Pour into french onion soup bowls over the rounds of bread",
      " Cover with cheese",
      " Bake at 350 F until cheese melts"
    ],
    "type": "Dinner",
    "cuisine": "French",
    "servings": "6 Servings",
    "imageUrl": "f21f334c-5b42-4632-a324-baf93d9f3c33.jpeg"
  },
  {
    "id": "808ff5a8-9c88-4083-9fde-76cb5a6a36a5",
    "name": "Ella's French Toast with Orange and Triple Sec",
    "description": "French toast with a citrusy twist, enhanced by the flavors of orange and Triple Sec. This dish is a delightful combination of sweet and tangy, perfect for a leisurely breakfast or brunch.",
    "ingredients": [
      "Stephen Ceideburg",
      "3 Eggs",
      "1/2 c Heavy cream",
      "Grated zest and juice of 1 orange",
      "1 tb Triple Sec",
      "1/4 ts Vanilla",
      "1/4 ts Grated nutmeg",
      "8 Thick slices of day old white bread",
      "4 tb Sweet butter",
      "Fruit preserves or maple syrup (optional)"
    ],
    "instructions": [
      "Beat eggs in a large bowl with the cream, orange zest and juice, Triple Sec, vanilla and nutmeg",
      " Soak bread slices in the batter for 15 minutes",
      " Melt the butter in 1 or 2 large saute pans, or on a griddle",
      " Regulate the heat so butter doesn't burn",
      " Saute bread slowly in the bitter",
      " The heat should not be too high, or the bread won't cook through",
      " Saute on both sides until golden brown",
      " Serve with fruit preserves or maple syrup, if desired",
      " PER SERVING: 475 calories, 11 g protein, 44 g carbohydrate, 29 g fat (16 g saturated), 177 mg cholesterol, 484 mg sodium, 1 g fiber"
    ],
    "type": "Breakfast",
    "cuisine": "French",
    "servings": "4 Servings",
    "imageUrl": "808ff5a8-9c88-4083-9fde-76cb5a6a36a5.jpeg"
  },
  {
    "id": "f47dd109-a726-4dd9-bcac-4552515f1bf7",
    "name": "English Muffin French Toa",
    "description": "English Muffin French Toast is a delicious and indulgent breakfast dish made by dipping English muffins in a sweet batter and grilling them until golden brown. It is a perfect combination of crispy on the outside and soft on the inside, served warm and topped with your favorite syrup or fruits.",
    "ingredients": [
      "2 1/4 qt WATER",
      "126 EGGS SHELL",
      "8 oz MILK; DRY NON-FAT L HEAT",
      "12 1/2 lb BREAD ENG MFFN 12OZ #95",
      "1 1/2 lb SUGAR; GRANULATED 10 LB"
    ],
    "instructions": [
      "TEMPERATURE: 375 F",
      " GRIDDLE 1",
      " PLACE WATER IN MIXER BOWL",
      " 2",
      " COMBINE MILK AND SUGAR; BLEND WELL",
      " ADD TO WATER; STIR UNTIL DISSOLVED",
      " 3",
      " ADD EGGS TO INGREDIENTS IN MIXER BOWL; WHIP UNTIL WELL BLENDED",
      " 4",
      " CUT MUFFINS IN HALF; DIP SPLIT MUFFINS IN BATTER 30 SECONDS",
      " 5",
      " GRILL ON CUT SIDE ABOUT 3 MINUTES; TURN; GRILL ON CRUST SIDE ABOUT 1 1/2 MINUTES",
      " 5",
      " SERVE IMMEDIATELY",
      " NOTE: 1",
      " DEHYDRATED EGG MIX MAY BE USED",
      " OMIT STEPS 1 THRU 3",
      " COMBINE 3 LB 12 OZ (3-NO",
      "3 CYL CN) CANNED DEHYDRATED EGG MIX AND 8 OZ (1 CP) GRANULATED SUGAR IN MIXING BOWL",
      " ADD 2 QT LUKEWARM WATER TO EGG MIXTURE; MIX UNTIL A SMOOTH PASTE IS FORMED",
      " ADD 3 QT LUKEWARM WATER",
      " WHIP UNTIL WELL BLENDED",
      " REFRIGERATE UNTIL READY TO USE",
      " FOLLOW STEPS 4 THRU 6",
      " SERVING SIZE: 2 HALVES"
    ],
    "type": "Breakfast",
    "cuisine": "French",
    "servings": "100 Servings",
    "imageUrl": "f47dd109-a726-4dd9-bcac-4552515f1bf7.jpeg"
  },
  {
    "id": "f96d3e78-62a9-4a67-8a57-6ead963d6608",
    "name": "Horseradish French Dressing",
    "description": "Horseradish French Dressing is a zesty and flavorful dressing that adds a kick to any salad. It combines the tanginess of ketchup and vinegar with the heat of horseradish and the sweetness of sugar, creating a versatile dressing that can elevate the flavors of various salads.",
    "ingredients": [
      "1 c Ketchup",
      "1/2 c White vinegar",
      "1/2 c Vegetable oil",
      "1/4 c Sugar",
      "2 ts Salt (up to)",
      "3 tb Horseradish",
      "1 Clove garlic; crushed"
    ],
    "instructions": [
      "In a blender jar, combine all ingredients: blen until well mixed",
      " Keep refrigerated",
      " (This is great on any salad and it's easy and fast)",
      " Makes about 2 cups",
      " MEAL-MASTER RECIPES LIST SERVER"
    ],
    "type": "Dressing",
    "cuisine": "French",
    "servings": "8 Servings",
    "imageUrl": "f96d3e78-62a9-4a67-8a57-6ead963d6608.jpeg"
  },
  {
    "id": "c3838bdf-6cfa-45d2-878c-20db9473ce76",
    "name": "Berry French Toast with Fois Gras",
    "description": "Berry French Toast with Fois Gras is a decadent and luxurious breakfast dish that combines the richness of fois gras with the sweetness of mixed berries and the comforting flavors of French toast. This dish is perfect for a special morning treat or a brunch gathering.",
    "ingredients": [
      "1 c Whole milk",
      "1 Egg",
      "1 ts Grated lemon zest",
      "1 ts Grated orange zest",
      "4 Three-inch slices of brioche",
      "2 tb Butter",
      "4 Two-ounce slices of fois gras",
      "1/2 c Raspberries",
      "1/2 c Blueberries",
      "1/2 c Blackberries",
      "1 c Raspberry coulis",
      "2 tb Balsamic vinegar",
      "Freshly-ground black pepper; to taste",
      "1 c Caramel sauce; in squeeze bottle",
      "Powdered sugar"
    ],
    "instructions": [
      "In a mixing bowl, whisk the milk, eggs and zest together",
      " Soak the bread in the milk-egg mixture",
      " In a saute pan, melt the butter",
      " When the butter is hot, pan-fry the bread for 2 minutes on each side or until golden brown",
      " Remove from the pan",
      " In a hot saute pan, sear the fois for 30 seconds on each side",
      " Remove from the pan and saute the berries in the fat",
      " Add the coulis, vinegar, and pepper",
      " Place the sauce in the center of the plate",
      " Pile the French toast in the center of the sauce",
      " Top with the fois gras",
      " Garnish with caramel sauce and powdered sugar",
      " This recipe yields 4 servings"
    ],
    "type": "Breakfast",
    "cuisine": "French",
    "servings": "4 servings",
    "imageUrl": "c3838bdf-6cfa-45d2-878c-20db9473ce76.jpeg"
  },
  {
    "id": "e4104688-40cb-42fc-aa42-a220f3a84585",
    "name": "Challah French Toast",
    "description": "A delicious and indulgent breakfast dish made with challah bread dipped in a rich egg and cream mixture, seasoned with cinnamon and salt, and fried to golden perfection. Serve this Challah French Toast with your favorite toppings like jam, maple syrup, honey, or enjoy it plain for a satisfying morning meal.",
    "ingredients": [
      "MICHAEL HATALA (RJHP21A)",
      "6 Eggs",
      "1/2 c Heavy cream, half-and-half or milk",
      "1 ts Cinnamon",
      "1/4 ts Salt",
      "4 tb To 6 T clarified butter",
      "8 sl Challah, cut 1-inch thick"
    ],
    "instructions": [
      "Beat the eggs together with cream, half-and-half, or milk",
      " Beat in cinnamon and salt",
      " Melt the butter in a large frying pan",
      " Dip the challah slices, one at a time, into the egg mixture, making sure that each slice is well coated",
      " The challah should absorb a little of the egg mixture but not enough to get soggy",
      " Fry each battered challah slice for 2-3 minutes on each side until they are golden brown",
      " Don't fry too fast or the inside will be wet and gooey",
      " Serve with your favorite jam, maple syrup, honey, cinnamon, sugar, or plain",
      " NOTE: Heavy cream really is the best liquid to use in this recipe"
    ],
    "type": "Breakfast",
    "cuisine": "French",
    "servings": "4 Servings",
    "imageUrl": "e4104688-40cb-42fc-aa42-a220f3a84585.jpeg"
  },
  {
    "id": "6f2f2db2-9d46-46d2-b836-a9a0ecb74526",
    "name": "Pissaladiere - (French Onion-Anchovy Tart)",
    "description": "Pissaladiere is a traditional French onion-anchovy tart that combines sweet caramelized onions, savory anchovies, and flavorful herbs on a crispy puff pastry base. It is a versatile dish that can be enjoyed as an appetizer, a light lunch, or a flavorful snack.",
    "ingredients": [
      "1 lb Prepared puff pastry dough; thawed if needed",
      "2 lb Onions; sliced",
      "3 tb Olive oil",
      "1 tb Minced garlic",
      "2 tb Chopped basil",
      "1/3 c Grated Parmesan cheese",
      "2 md Firm ripe tomatoes; sliced 1/8\" thick,",
      "And seeded",
      "1 cn Anchovies - (2 oz); or to taste",
      "20 Pitted Nicoise olives",
      "Chopped fresh mixed herbs",
      "(such as basil; thyme and rosemary)"
    ],
    "instructions": [
      "Preheat oven to 450 degrees",
      " Roll out pastry to a 12- by 16-inch rectangle, 1/8-inch thick and transfer to a baking sheet",
      " Brush edges of pastry with water and fold over to form a border 1-inch wide",
      " Score border with tines of a fork and thoroughly prick center",
      " Meanwhile, in a skillet cook onions over low heat in 2 tablespoons olive oil until golden and softened",
      " Stir in garlic and basil",
      " Transfer to a bowl to cool",
      " Sprinkle bottom of tart with 2 tablespoons Parmesan cheese and spread onion mixture over",
      " Sprinkle onions with 2 more tablespoons cheese",
      " Top with tomato slices and brush them with olive oil",
      " Decorate tart with anchovies and olives",
      " Bake for 30 to 35 minutes, or until pastry is golden and crisp",
      " Sprinkle warm tart with 2 more tablespoons cheese and chopped herbs",
      " Serve slightly warm or at room temperature",
      " This recipe yields ?? servings"
    ],
    "type": "Appetizer, Lunch, Snack",
    "cuisine": "French",
    "servings": "1 servings",
    "imageUrl": "6f2f2db2-9d46-46d2-b836-a9a0ecb74526.jpeg"
  },
  {
    "id": "1cff7354-3925-4675-9163-3031d3567f56",
    "name": "Oven French Fries",
    "description": "Crispy and golden oven French fries made from scratch using fresh potatoes, tossed in oil, and baked to perfection. These fries are a healthier alternative to traditional deep-fried fries and make for a delicious snack or side dish.",
    "ingredients": [
      "4 lg Potatoes",
      "2 tb Peanut or safflower oil"
    ],
    "instructions": [
      "Scrub potatoes and cut into long strips, about 1/2-inch wide",
      " Drop into ice water, cover and chill 1 to 2 hours",
      " Remove strips from water and dry thoroughly",
      " Place strips and oil in a deep bowl and toss until all potatoes have a light coating of oil",
      " Preheat oven to 475",
      " Spread fries in a single layer in a shallow baking pan",
      " Place in oven for 30 to 35 minutes",
      " Stir fries occasionally to brown on all sides"
    ],
    "type": "Snack",
    "cuisine": "French",
    "servings": "8 Servings",
    "imageUrl": "1cff7354-3925-4675-9163-3031d3567f56.jpeg"
  },
  {
    "id": "bc98b1c1-6325-4e1f-a8b9-b83f0ed077e8",
    "name": "English / Indian Ingredients , Part 1",
    "description": "This recipe includes a variety of English and Indian ingredients commonly used in cooking. The ingredients range from spices like ginger, cardamom, and cumin to fruits like mango and pomegranate. The combination of these ingredients suggests that this recipe is likely for a side dish that can complement a main course in a meal.",
    "ingredients": [
      "1 Information:"
    ],
    "instructions": [
      "A Achar Pickle Adrak Ginger Ajwain or Ajowain Lovage Aloo Potato Am Mango Am chur Mango Powder Anardana Pomegranate Aniseed Saunf Areca Betel Nut Asafoetida Hing Aserio Aniseed Ata or Atta Chupatti flour",
      " Fine wholemeal B Badian Aniseed Stars (Star Anise) Badam Almond Bay Leaves Tej Patia Besan Chickpea flour Bindi Okra Black Salt Kala namak Brinjal Aubergine C Cardamon, black or brown Elaichi Cardamom, green or white Elaichi Cashew nuts Kaju Cassia bark Cassia bark Chawal Rice Chillis Chillis Chor magaz Melon seeds Cinnamon Dalchini Cloves Lavang Coriander Dhania Cummin or Cumin Jeera or Zeera Curry leaves, Neem or Kariphulia Cus cus Poppy seed D Dahi Yoghurt Doroo Celery F Fennel Sonf or Soonf Fenugreek Methi This is the first half of a message posted in FidoNet International Cooking Echo by Bob Wilson, Nantwich, UK"
    ],
    "type": "Side Dish",
    "cuisine": "Indian",
    "servings": "1 Servings",
    "imageUrl": "bc98b1c1-6325-4e1f-a8b9-b83f0ed077e8.jpeg"
  },
  {
    "id": "14f7d58a-9ba8-4490-add0-06ca6970d906",
    "name": "English / Indian Ingredients , Part 2",
    "description": "This recipe includes a variety of English and Indian ingredients that are commonly used in traditional dishes. The combination of spices and flavors creates a rich and aromatic curry dish that can be enjoyed as a hearty main course meal.",
    "ingredients": [
      "1 Information:"
    ],
    "instructions": [
      "G Gajar Carrot Garam Masala Garam Masala, add it to curry Garlic Lasan Goor or Gur Palm sugar Gram flour (Besan) Chickpea flour H Haldi Turmeric I Imli Tamarind J Jaifal or Taifal Nutmeg Javatri Mace K Kabli chana Chickpea Kalongi Similar to wild onion seeds M Makke Cornflour N Nga-Pi Shrimp paste Nigella Wild Onion Seed P Panch Phoran Five seed mixture Paprika Paprika Pepper Mirch Podina Mint leaves or powder R Rai Mustard seed Rajma Red Kidney beans Rosewater Ruh gulab S Saffron Kesar or Zafron Salt Namak Sarson Ka Sag Mustard leaves Seenl Allspice Sesame Seeds Til Sonf Fennel seed Sont or Sonth Dry ginger Supari Supari, Mixture of colored seeds for chewing after a meal T Taipal or Jaiphal Nutmeg Tej Patia Leaf of cassia bark tree Tusci Basil V Vark or Varak Edible silver or gold foil This is the second half of a message posted in FidoNet International Cooking Echo by Bob Wilson, Nantwich, UK"
    ],
    "type": "Main Course",
    "cuisine": "Indian",
    "servings": "1 Servings",
    "imageUrl": "14f7d58a-9ba8-4490-add0-06ca6970d906.jpeg"
  },
  {
    "id": "6a0854d2-9e03-400d-8d5d-f20842ed83bf",
    "name": "Mee Goreng (Fried Noodles Indian-Style)",
    "description": "Mee Goreng is a flavorful and spicy fried noodle dish prepared Indian-style. It combines a variety of ingredients like noodles, prawns or chicken, vegetables, and spices to create a delicious and satisfying meal.",
    "ingredients": [
      "5 oz Oil noodles or spaghetti",
      "2 tb Oil",
      "4 oz Peeled prawns or skinless boned chicken; diced meat",
      "1 sm Onion; chopped",
      "4 oz Cabbage; sliced",
      "1 sm Tomato; sliced",
      "1 4 inch piece celery; chopped",
      "2 Cloves garlic; crushed",
      "1 Chilli; crushed",
      "1/2 Boiled potato; diced",
      "1 Egg; beaten",
      "1 tb Tomato ketchup",
      "2 tb Soy sauce",
      "1/4 ts Salt",
      "1/2 ts Sugar",
      "4 oz Beansprouts",
      "1 Lemon; juice of",
      "2 Sprigs coriander; chopped, up to 3"
    ],
    "instructions": [
      "If using spaghetti, cook it in boiling water until just tender, then drain and toss in a tablespoon of olive oil to stop it sticking together",
      " No need to prepare the oil noodles",
      " Heat the oil in a wok or frying pan and fry the garlic, onion, cabbage, celery, potato and prawns or chicken",
      " Add the noodles and stir fry for 10 minutes more",
      " Make a gap in the centre of the noodles and add the egg",
      " Stir it in to scramble it",
      " Add the chilli, tomato, tomato ketchup, soy sauce, salt and sugar",
      " Stir well",
      " Just before transferring to a plate, add the beansprouts and stir for about 30 seconds",
      " Sprinkle with lemon juice and chopped coriander to serve"
    ],
    "type": "Dinner",
    "cuisine": "Indian",
    "servings": "1 servings",
    "imageUrl": "6a0854d2-9e03-400d-8d5d-f20842ed83bf.jpeg"
  },
  {
    "id": "44ac91ea-7391-4196-8c23-1edcac118cc2",
    "name": "Chapati with Spicy Potato Filling (Indian)",
    "description": "Chapati with Spicy Potato Filling is a traditional Indian dish that consists of a flavorful and spicy potato filling wrapped in a wholemeal flour chapati. It is a versatile meal that can be enjoyed for lunch or dinner, paired with your favorite curry, dhal, or plain yogurt.",
    "ingredients": [
      "1 tb Oil",
      "2 Onions",
      "1 Dessertspoon ground chillies",
      "2 Potatoes, mashed",
      "1 md Carrot, grated",
      "1 ts Salt",
      "1 Stalk spring onion, chopped",
      "1 Sprig coriander leaves",
      "500 g Wholemeal flour (atta)",
      "1 1/2 c Water",
      "1/2 ts Salt",
      "3 tb Ghee"
    ],
    "instructions": [
      "Heat oil and lightly brown onions",
      " Add chillies, mashed potatoes, grated carrot, salt and chopped spring onion and coriander leaves",
      " Mix well",
      " Remove from heat and allow to cool",
      " Put wholemeal flour into a mixing bowl with salt",
      " Mix into a firm ball of dough by adding water a little at a time",
      " Spread 1 tablespoon of ghee on the dough and continue kneading",
      " Repeat with another tablespoon of ghee",
      " Lastly spread the last tablespoon of ghee onto the lump of dough and allow to stand for 30 minutes",
      " Divide into small balls of dough",
      " Flatten dough with the palm of your hands",
      " Dip both sides into a little flour",
      " Place chapati on a wooden board and roll out with a rolling pin",
      " Brush with a little ghee and spread 1 tablespoon of spicy potato filling evenly on surface",
      " Fold into half and then fold again to seal filling",
      " Dip again into flour and roll out again into a thin square of chapati",
      " Place chapati onto a flat pan over medium heat and brown both sides",
      " Brush chapati with ghee on both sides while frying",
      " Serve with your favourite curry, dhal or plain yoghurt"
    ],
    "type": "Lunch",
    "cuisine": "Indian",
    "servings": "16 Chapatis",
    "imageUrl": "44ac91ea-7391-4196-8c23-1edcac118cc2.jpeg"
  },
  {
    "id": "65c36926-159f-44aa-a553-07f46b315526",
    "name": "Chipati (Indian Griddle Fried Flat Bread)",
    "description": "Chipati is a delicious Indian griddle-fried flatbread that is perfect as a snack. Made with whole wheat flour, salt, water, and ghee, Chipati is a versatile and flavorful bread that can be enjoyed on its own or paired with various dips and sauces. The recipe yields 20-24 Chipati, making it ideal for sharing with family and friends or as a quick snack for yourself. Enjoy the crispy and flavorful Chipati as a tasty treat any time of the day!",
    "ingredients": [
      "3 c Whole wheat flour",
      "1 ts Salt",
      "1 c Water",
      "1 tb Ghee",
      "Yield - 20-24 Chipati"
    ],
    "instructions": [
      "Sift flour and salt together in a bowl",
      " Make a well in the center and add ghee and water",
      " Knead 10 minutes to make a pliable dough, form into a ball, cover and allow to rest at least 1 hour, or over night",
      " Divide dough into 20-24 portions",
      " Roll into 6 inch circles and allow to rest 5 minutes",
      " Heat griddle or cast iron fry pan very hot",
      " Place a chipati on the griddle or fry pan, fry for 1 minute",
      " Flip over and fry for 1 minute"
    ],
    "type": "Snack",
    "cuisine": "Indian",
    "servings": "4 Servings",
    "imageUrl": "65c36926-159f-44aa-a553-07f46b315526.jpeg"
  },
  {
    "id": "d549ce61-979c-47a2-ba53-c372a9d347e1",
    "name": "Wakavaki Indian Soup",
    "description": "Wakavaki Indian Soup is a hearty and flavorful dish that combines tender short ribs with a variety of vegetables and beans. This soup is rich in flavor and perfect for a comforting dinner, especially on a chilly evening. Serve it with a tortilla for a complete and satisfying meal.",
    "ingredients": [
      "6 3/4 lb Short ribs",
      "6 Ears corn; (cut into thirds)",
      "4 1/2 lb Cabbage",
      "1 1/2 lb Zucchini",
      "2 lb Carrot",
      "2 cn Green beans",
      "2 cn Garbanzo beans; (15 oz. can)",
      "2 tb Salt",
      "3 Cloves garlic"
    ],
    "instructions": [
      "Cook short ribs in 20 cups of water for 1 hour over medium flame",
      " Add carrots, corn and garlic and then cook for 1/2 hour",
      " Next add cabbage and 10 cups of HOT water and continue cooking for 15 minutes",
      " Next add garbanzo beans, green beans, zucchini, 2 tablespoons of salt and then cook 1 additional hour",
      " Serve each bowl with 2 cups of soup and include 1 piece of corn and 2 short ribs in the bowl",
      " Serve the soup with a tortilla",
      " Tucson, Arizona"
    ],
    "type": "Dinner",
    "cuisine": "Indian",
    "servings": "4 Servings",
    "imageUrl": "d549ce61-979c-47a2-ba53-c372a9d347e1.jpeg"
  },
  {
    "id": "1f656bc8-4497-4df6-a2a2-a438fdfb9904",
    "name": "Gujarati Potatoes Indian",
    "description": "This recipe features Gujarati-style potatoes cooked with aromatic spices like turmeric, asafoetida, and garlic, giving it a flavorful and comforting taste. It is a perfect dish for lunch or dinner, offering a satisfying and delicious meal with Indian flavors.",
    "ingredients": [
      "1 lb Potatoes, waxy type",
      "5 tb Olive oil",
      "3 lg Garlic cloves",
      "1/2 ts Ground turmeric",
      "1/8 ts Ground asafoetida",
      "1 ts Salt",
      "1 pn [generous]cayenne pepper or hot powder",
      "1 tb Sesame seed"
    ],
    "instructions": [
      "Sesame seed - I used pre-roasted from a Chinese grocery Gujarat is a part of India on the western coast, right at the Tropic of Cancer, between 20 and 25 deg",
      " N",
      " latitude",
      " This recipe, adapted from Madhur Jaffrey, uses only one \"mystery ingredient,\" asafoetida powder (you should find some if you're going to get into Indian cooking at all",
      ") Jaffrey says use two pounds of medium, very waxy boiling potatoes",
      " I used one pound but left everything else the same and it was perfect for two hungry people",
      " Peel potatoes (optional) and cut into long French-fries 3/8\" (9mm) square",
      " Dunk in a bowl of cold water for 1/2 hour",
      " Peel and sliver garlic",
      " Heat the oil in a 9- or 10-inch skillet over medium",
      " Drain and pat dry the potato fingers",
      " Put potatoes in hot oil and turn occasionally for 8 or 10 minutes to partially cook -- not brown",
      " Remove potatoes with tongs or slotted spoon to a plate with a paper towel on it",
      " From here on you have to move kind of fast: throw the sesame seeds into the skillet, stir once",
      " Add the garlic, and continue to stir",
      " When it just begins to turn brown, quickly add turmeric and asafoetida, and stir once more",
      " After just a couple of seconds put the potatoes back in, with salt and cayenne or hot powder",
      " Reduce heat and cook gently until done",
      " Stir frequently",
      " (I added a tiny bit of water and loosely covered the skillet with a plate during the last few minutes",
      ")"
    ],
    "type": "Lunch or Dinner",
    "cuisine": "Indian",
    "servings": "4 Servings",
    "imageUrl": "1f656bc8-4497-4df6-a2a2-a438fdfb9904.jpeg"
  },
  {
    "id": "0b152212-e27d-4e7f-8fa3-3cb8df16256e",
    "name": "Ghee (Indian Butter Oil)",
    "description": "Ghee, also known as Indian Butter Oil, is a clarified butter that is a staple in Indian cuisine. It is made by simmering butter to remove the milk solids, resulting in a rich and nutty flavor. Ghee is commonly used in cooking and as a condiment to enhance the taste of various dishes.",
    "ingredients": [
      "2 lb Butter, unsalted"
    ],
    "instructions": [
      "Divide butter into 1/4 pound pieces",
      " In heavy 5 qt",
      " saucepan, heat butter over moderate heat, stirring to melt slowly and completely without letting it brown",
      " When completely melted, increase heat and bring the butter to a boil",
      " When the surface is completely covered with white foam, stir the butter gently and reduce heat to the lowest possible point",
      " Simmer uncovered and undisturbed for 45 minutes, or until the milk solids on the bottom of the pan are golden brown and the butter on top is transparent",
      " Slowly pour the ghee through a linen towel or 4 layers of moistened cheesecloth",
      " If the are any solids, no matter how small, strain again to prevent oil from becoming rancid later",
      " The ghee must be perfectly clear",
      " Pour the ghee into a jar or crock, cover tightly and store in refrigerator or at room temperature until ready to use",
      " Ghee will solidify when it is chilled",
      " If may be safely kept at room temperature for 2 or 3 months",
      " NOTES: Although ghee resembles clarified butter, the long low heat cooking imparts a distinctive nutlike flavor that cannot be duplicated"
    ],
    "type": "Condiment",
    "cuisine": "Indian",
    "servings": "3 Cups",
    "imageUrl": "0b152212-e27d-4e7f-8fa3-3cb8df16256e.jpeg"
  },
  {
    "id": "de312b2a-8498-4700-8354-80d3012a218e",
    "name": "Christmas Cake West Indian Style",
    "description": "Christmas Cake West Indian Style is a rich and flavorful fruitcake that is traditionally made for special occasions like weddings or Christmas in the West Indian region. It is infused with a variety of dried fruits soaked in rum and sherry, and spiced with a blend of warm spices like ginger, nutmeg, cinnamon, cloves, and allspice. The cake is moist, dense, and packed with festive flavors, making it a delightful treat to enjoy during the holiday season. Serve this decadent cake with a Hard Rum Sauce for an extra touch of indulgence.",
    "ingredients": [
      "--Fruit Mixture---",
      "1 c Raisins",
      "1 c Currants",
      "1/2 c Candied cherries",
      "1/2 c Candied citrus peel",
      "1 c Mixed dried fruit",
      "1 c Rum",
      "1 c Sweet sherry or port wine --Cake---",
      "1/2 lb Butter; at room temperature",
      "1/2 c Brown sugar",
      "4 Eggs",
      "2 c Flour",
      "1 ts Baking powder",
      "1 ts Ground ginger",
      "1 ts Ground nutmeg",
      "3 ts Ground cinnamon",
      "1/2 ts Ground cloves",
      "1/2 ts Ground allspice",
      "2 1/2 ts Lemon essence",
      "2 1/2 ts Almond essence",
      "1 ts Vanilla essence",
      "1/4 c Brown food coloring; up to 1/2 cup",
      "1/2 c Rum",
      "Additional rum for basting during storage"
    ],
    "instructions": [
      "Fruit Mixture: Mix together all the ingredients and store in a tightly sealed jar for at least 1 month The Cake: Prepare a 10\" deep round cake baking tin or a 13\" x 9\" baking tin by lining it with two layers of waxed paper, greasing between the layers",
      " Preheat the oven to 250 degrees",
      " In a large bowl, cream together the butter and sugar until they are light and fluffy",
      " Add the eggs, one at a time, mixing well after each addition",
      " Sift the flour, baking powder and all the dry spices together",
      " Add the lemon essence, almond essence and vanilla essence to the fruit mixture",
      " By hand, stir tablespoonsful of the flour mixture and the fruit mixture alternately into the butter, sugar and egg mixture",
      " Add the browning gradually, stirring until a deepish brown colour is reached",
      " Turn the cake mixture into the baking tin, smooth the top and bake in the oven for 3-4 hours or until a skewer or wooden toothpick, inserted, comes out clean",
      " This can take an additional hour or two",
      " Remove the cake from the oven, prick it all over with a skewer or toothpick and pour the rum all over it",
      " Remove the cake from the tin when it is cool, wrap it tightly in waxed paper, place it in an airtight container and leave for a month for best flavour",
      " Every week, prick the cake with a skewer and pour on about 1 tablespoon of rum",
      " (Makes one 5 pound cake",
      " ) Serve with Hard Rum Sauce",
      " Full recipe name is Laurel-Ann's Wedding Cake or Christmas Cake West Indian Style"
    ],
    "type": "Dessert",
    "cuisine": "Indian",
    "servings": "1 Servings",
    "imageUrl": "de312b2a-8498-4700-8354-80d3012a218e.jpeg"
  },
  {
    "id": "5a3ff23b-d7aa-4556-8584-86ecd007b666",
    "name": "Sothi (South Indian)",
    "description": "Sothi is a traditional South Indian curry made with a rich coconut milk base and a variety of vegetables. It is a flavorful and creamy dish that is typically served with rice. Sothi is a popular dish in South Indian cuisine, known for its aromatic spices and comforting flavors.",
    "ingredients": [
      "1 c Thick coconut milk",
      "2 1/2 c Thin coconut milk",
      "1 Onion, ground",
      "3 Cloves garlic, ground",
      "2 1/2 Cm ginger, ground",
      "1 Onion, cut into wedges",
      "2 Sprigs curry leaves",
      "1 ts Turmeric powder",
      "1/4 ts Fenugreek",
      "2 ts Salt",
      "2 Potatoes, cut into wedges",
      "150 g Okra, kept whole",
      "150 g French beans, cut into two",
      "4 Cabbage leaves, cut into",
      "Squares",
      "3 Red chillies, coarsely",
      "Sliced",
      "3 Green chillies, coarsely",
      "Sliced",
      "2 Tomatoes, quartered",
      "1 tb Lime juice"
    ],
    "instructions": [
      "Put thin coconut milk in a cooking pot",
      " Add \"A\" and bring to a slow boil",
      " When vegetables are half-cooked, add tomatoes",
      " Simmer till vegetables are soft, stirring occasionally",
      " Add thick coconut milk, gently stirring to prevent curdling",
      " When curry boils again, add lime juice and remove from heat",
      " Serve with rice"
    ],
    "type": "Lunch",
    "cuisine": "Indian",
    "servings": "4 Servings",
    "imageUrl": "5a3ff23b-d7aa-4556-8584-86ecd007b666.jpeg"
  },
  {
    "id": "61aec5d7-e7be-483a-8f75-9b41b35256f2",
    "name": "Enchiladas with Salsa Mexicana",
    "description": "These enchiladas with Salsa Mexicana are a flavorful and light dinner option filled with a variety of vegetables like bell peppers, onions, mushrooms, potatoes, and spinach. The addition of feta cheese provides a tangy flavor and creaminess to the dish. Served with a side of finely shredded romaine lettuce and garnished with cilantro, these enchiladas make for a delicious and nutritious dinner choice.",
    "ingredients": [
      "2 c Salsa; such as Salsa Mexicana, see recipe",
      "Vegetable oil coohing spray",
      "1 Red bell pepper; seeded and thinly sliced",
      "1/2 c Thinly sliced onion",
      "2 c Sliced mushrooms",
      "1 sm All-purpose potato OR 3/4-cup cut potatoes; 1/2\" pieces",
      "2 Garlic cloves; minced",
      "2 c Packed fresh spinach leaves; washed thoroughly and spun dry",
      "2 tb Chopped cilantro; PLUS",
      "6 Sprigs fresh cilantro; for garnish",
      "1/4 ts Red pepper flakes; crushed",
      "1/2 c Crumbled feta cheese; (2-oz)",
      "6 6 in corn tortillas; fresh",
      "8 c Finely shredded romaine lettuce"
    ],
    "instructions": [
      "1",
      " Preheat oven to 350F",
      " Prepare Salsa Mexicana (see recipe) or use a prepared salsa",
      " 2",
      " Lightly spray a 1 2-in",
      " nonstick skillet with vegetable oil cooking spray",
      " Add bell pepper and onion, and cook over medium heat, stirring until softened, about 5 minutes",
      " Add mushrooms, potatoes, garlic and 1/4 cup water and cook, stirring occasionally, until all vegetables are softened, about 10 minutes",
      " Remove the skillet from the heat and stir in spinach, cilantro and red pepper flakes until spinach is wilted",
      " Add feta and stir to blend",
      " 3",
      " Lightly spray an 8-in",
      " square baking pan with vegetable oil",
      " Warm each tortilla in a dry skillet over medium heat, about 1 minute per side",
      " Place 1/3 cup of vegetable mixture in the lower part of each tortilla and roll up",
      " Carefully place enchiladas seam side down in the baking pan, brush lightly with some of the liquid from the salsa, cover with foil and bake for 20 minutes",
      " 4",
      " To serve, divide lettuce among 6 plates",
      " Place enchiladas on top of the lettuce",
      " Top with salsa and garnish with cilantro sprigs",
      " Notes: A nicely spiced entree, these light enchiladas are filled with veggies instead of the typical beef, pork or chicken",
      " A bit of feta cheese is in the wrap for tangy flavor and creaminess",
      " >from Kitpath with a little help from mcbuster 2",
      "0d"
    ],
    "type": "Dinner",
    "cuisine": "Mexican",
    "servings": "6 Servings",
    "imageUrl": "61aec5d7-e7be-483a-8f75-9b41b35256f2.jpeg"
  },
  {
    "id": "013ea3c1-6f7f-4087-be46-5ed258aef1de",
    "name": "Mcdougall Mexican Zucchini",
    "description": "This Mcdougall Mexican Zucchini recipe is a flavorful and nutritious dish made with thinly sliced zucchini, grated carrot, chopped onion, celery, green pepper, and tomatoes. The vegetables are layered in a casserole dish and topped with a delicious sauce made with mild green chili salsa, dried basil, garlic, and mustard. This dish is baked to perfection, creating a satisfying and wholesome meal that can be served with grains such as brown rice or bulgur wheat.",
    "ingredients": [
      "2 md Zucchini; thinly sliced",
      "1 lg Carrot; coarsely grated",
      "1 md Onion; chopped",
      "2 Stalks Celery; chopped",
      "1/2 md Green Pepper; thinly sliced",
      "2 md Tomatoes; sliced",
      "1 c Mild Green Chili Salsa",
      "1/4 ts Dried Basil",
      "1 Clove Garlic; crushed",
      "2 ts Prepared Mustard"
    ],
    "instructions": [
      "Prepare vegetables as directed and layer in a casserole dish, all except for the tomatoes",
      " Combine ingredients for the sauce (salsa, basil, garlic and mustard) and pour over the layered vegetables",
      " Place sliced tomatoes over the top",
      " Cover and bake at 325 degrees for 45 minutes",
      " Remove cover and bake for 15 minutes longer",
      " Helpful Hints: Serve with grains such as brown rice or bulgur wheat"
    ],
    "type": "Dinner",
    "cuisine": "Mexican",
    "servings": "6 servings",
    "imageUrl": "013ea3c1-6f7f-4087-be46-5ed258aef1de.jpeg"
  },
  {
    "id": "28910b89-66fc-4b06-b9f1-db0bd0004fac",
    "name": "Mexican Bananas Foster",
    "description": "Mexican Bananas Foster is a delicious and decadent dessert that combines ripe bananas with a rich and flavorful sauce made from brown sugar, Kahlua, and butter. The bananas are grilled to perfection and served over vanilla ice cream, creating a sweet and indulgent treat that is perfect for special occasions or a delightful ending to a meal.",
    "ingredients": [
      "3/4 c Packed light brown sugar",
      "3/4 c Kahlua or other coffee flavored liquor",
      "12 tb Unsalted butter; cut into tablespoons (1 1/2 sticks)",
      "6 Ripe bananas; peeled and cut into 1/2-inch thick rounds",
      "Ground cinnamon; to taste",
      "Vanilla ice cream"
    ],
    "instructions": [
      "Build a charcoal fire in an outdoor grill and let burn until the coals are covered with white ash",
      " Let the fire burn down to medium-hot (you should be able to hold your hand at grate level for 3 seconds)",
      " In a gas grill, preheat to Medium",
      " Tear off six 12-inch squares of aluminum foil",
      " Fold one foil square in half",
      " On the bottom half, place 2 tablespoons brown sugar, 2 tablespoons Kahlua, 2 tablespoons butter, and 1 banana",
      " Sprinkle with a pinch of cinnamon",
      " Fold the foil over to form a packet, crimping the open edges to seal",
      " Repeat with the remaining ingredients",
      " The packets can be prepared up to 1 hour ahead and kept at room temperature",
      " Grill the packets until the sugar, Kahlua, and butter are boiling, 5 to 7 minutes",
      " Open the packets, pour over bowls of ice cream and serve immediately",
      " Yield: 6 servings"
    ],
    "type": "Dessert",
    "cuisine": "Mexican",
    "servings": "1 servings",
    "imageUrl": "28910b89-66fc-4b06-b9f1-db0bd0004fac.jpeg"
  },
  {
    "id": "a1d8be4c-47b7-4b5b-8724-7fb606bb5fa4",
    "name": "Mexican Beef And Bean-Stuffed Peppers",
    "description": "Mexican Beef and Bean-Stuffed Peppers is a flavorful and nutritious dish that combines extra-lean ground beef, kidney beans, green chilies, and a blend of spices stuffed inside bell peppers. The peppers are baked to tender perfection and topped with shredded cheddar cheese, creating a hearty and satisfying meal.",
    "ingredients": [
      "1 1/2 c Fiber One® Cereal",
      "15 oz Tomato puree",
      "4 md Bell peppers",
      "1/2 lb Extra-lean ground beef",
      "1 md Onion; finely chopped -1/2 cup",
      "8 oz Kidney beans; rinsed and drained",
      "4 oz Chopped green chilies; undrained",
      "2 ts Chili powder",
      "1/2 ts Ground cumin",
      "Shredded reduced-fat cheddar cheese; if desired"
    ],
    "instructions": [
      "1",
      " Heat oven to 350°",
      " Crush cereal",
      "* Mix cereal and tomato puree; let stand 5 minutes",
      " 2",
      " Cut bell peppers lengthwise in half",
      " Remove seeds and membranes",
      " Place peppers, cut sides up, in rectangular baking dish, 13x9x2 inches",
      " 3",
      " Cook beef and onion in 10-inch skillet over medium heat, stirring occasionally, until beef is brown; drain",
      " Stir in cereal mixture and remaining ingredients except cheese",
      " Divide beef mixture evenly among peppers",
      " 4",
      " Cover and bake 40 to 45 minutes or until peppers are tender",
      " Sprinkle each pepper with 1/2 tablespoon cheese; let stand 5 minutes",
      " 8 servings",
      " *Place cereal in plastic bag; crush with rolling pin",
      " Or crush in blender or food processor",
      " Serving Size: 1 Serving",
      " Calories 130 (Calories from fat 35); Fat 4g (Saturated 1 g); Cholesterol 20mg; Sodium 470mg; Carbohydrate 21g (Dietary Fiber 7g); Protein 9g % Dally Value: Vitamin A 26%; Vitamin C 40%; Calcium 4%; Iron 20% Diet Exchanges: 1 starch, 1 lean meat"
    ],
    "type": "Dinner",
    "cuisine": "Mexican",
    "servings": "8 Servings",
    "imageUrl": "a1d8be4c-47b7-4b5b-8724-7fb606bb5fa4.jpeg"
  },
  {
    "id": "0d50b0a6-9452-4e82-b2c9-e68865539720",
    "name": "Mexican Beef Brisket",
    "description": "This Mexican Beef Brisket recipe is a hearty and flavorful dish featuring tender beef brisket cooked in a rich and savory sauce with a blend of spices and vegetables. It is perfect for a satisfying dinner, especially when served with rice or tortillas.",
    "ingredients": [
      "3 1/2 lb Beef brisket",
      "1 tb Coarse salt",
      "2 ts Freshly-ground black pepper",
      "Flour; for dredging",
      "1/2 c Vegetable oil",
      "3 lg Carrots; peeled, and",
      "Cut 2\" lengths",
      "2 md Onions; chopped",
      "10 Garlic cloves; peeled, minced",
      "3 Dried chipotle or morita chiles",
      "2 tb Tomato paste",
      "1 tb Dried oregano",
      "2 qt Chicken stock or water",
      "5 Bay leaves",
      "Salt; to taste",
      "4 Scallions; white and light green parts, thinly sliced",
      "On the diagonal; for garnish"
    ],
    "instructions": [
      "Preheat oven to 325 degrees",
      " Sprinkle the brisket with the coarse salt and pepper",
      " Dredge in flour to coat and shake off any excess",
      " In a large Dutch oven heat oil over high heat",
      " Sear the meat until browned on all sides",
      " Set aside",
      " Reduce heat to moderate and add the carrots and onions",
      " Cook, stirring occasionally, until golden brown, 8 to 10 minutes",
      " Add the garlic and saute 2 minutes longer",
      " Return the meat to the pan along with all remaining ingredients except the salt and garnishes",
      " Bring to a boil, cover the pot and transfer to the oven",
      " Bake for 2 1/2 hours, or until the meat slips off a fork when pierced",
      " Lift out the brisket and place on a cutting board",
      " Cover with a damp towel",
      " Pour the broth with vegetables into a tall container and skim off the layer of fat that rises",
      " Remove and discard the bay leaves and chiles",
      " Pour the broth and vegetables into a blender or a food processor fitted with the metal blade",
      " Puree until smooth, add salt to taste and strain",
      " Reheat the sauce",
      " Slice the brisket against the grain and arrange on a platter",
      " Pour the warm sauce over it, sprinkle with sliced scallions and serve",
      " This recipe yields ?? servings"
    ],
    "type": "Dinner",
    "cuisine": "Mexican",
    "servings": "1 servings",
    "imageUrl": "0d50b0a6-9452-4e82-b2c9-e68865539720.jpeg"
  },
  {
    "id": "7095ab0e-7890-442e-943a-ca0fade3caa1",
    "name": "Mexican Black Bean Burger",
    "description": "A flavorful and protein-packed Mexican Black Bean Burger that is easy to make and perfect for a satisfying lunch. The burger patties are made with black beans, onions, bell peppers, and spices, then cooked to perfection and served on a bun with salsa and guacamole for a delicious meal.",
    "ingredients": [
      "1 16 oz. can black beans - drained",
      "1/4 c Diced yellow onion",
      "1/4 c Diced red bell pepper",
      "1/2 ts Cayenne pepper",
      "1 Egg",
      "1 c Seasoned bread crumbs",
      "2 tb Chopped cilantro",
      "2 tb Olive oil",
      "Salsa and guacamole for garnish"
    ],
    "instructions": [
      "Directions: Place the rinsed and drained black beans, onion, bell pepper, cayenne, egg, bread crumbs, and cilantro into a food processor",
      " Blend well until ingredients are combined",
      " Add more bread crumbs if needed to hold mixture together",
      " Form four patties and refrigerate for one hour to allow them to set",
      " Heat the olive oil in a large skillet",
      " Add the patties and cook approximately 3 minutes on each side, or until cooked through",
      " Serve each patty on a bun with salsa and guacamole"
    ],
    "type": "Lunch",
    "cuisine": "Mexican",
    "servings": "1 servings",
    "imageUrl": "7095ab0e-7890-442e-943a-ca0fade3caa1.jpeg"
  },
  {
    "id": "e9c5c7b8-f111-47d1-941d-027defdab41f",
    "name": "Mexican Black Bean Chili",
    "description": "This Mexican Black Bean Chili is a hearty and flavorful dish packed with black beans, a variety of bell peppers, spices, and a touch of chocolate for richness. It is a perfect meal for a cozy dinner, especially during colder weather. The combination of ingredients creates a comforting and satisfying chili that is sure to be a crowd-pleaser.",
    "ingredients": [
      "1 lb Dried black beans",
      "2 c Chopped onion",
      "1 c Yellow bell pepper; 1/2\" pieces",
      "1 c Red bell pepper; 1/2\" pieces",
      "1 c Green bell pepper; 1/2\" pieces",
      "1 tb Chili powder",
      "2 ts Cumin seeds",
      "2 ts Dried oregano",
      "1 ts Salt",
      "1/2 ts Ground cinnamon",
      "1 15 oz can Italian-style tomatoes; undrained & chopped",
      "1 1/2 oz Semisweet chocolate; coarsely chopped",
      "4 Cloves garlic; minced",
      "2 Jalapeno peppers; seeded & minced",
      "2 Bay leaves",
      "1 c Minced fresh cilantro",
      "1 ts Hot sauce; (to 2 tsp)"
    ],
    "instructions": [
      "Sort and wash beans",
      " Place in a large Dutch oven",
      " Cover with water to 2 inches above beans",
      " Bring to a boil and cook 2 minutes",
      " Remove from heat; cover, and let stand 1 hour",
      " Drain beans",
      " Place beans and next 14 ingredients (beans through bay leaves) in a crockpot",
      " Cover with lid and cook on low heat for 8 hours",
      " Stir in cilantro and hot sauce",
      " NOTES : You can eliminate the quick-cook method for the black beans if you soak them overnight"
    ],
    "type": "Dinner",
    "cuisine": "Mexican",
    "servings": "6 servings",
    "imageUrl": "e9c5c7b8-f111-47d1-941d-027defdab41f.jpeg"
  },
  {
    "id": "c7d3e9a7-ea9a-4429-b49f-832fdf424b83",
    "name": "Mexican Burritos",
    "description": "Mexican Burritos are a delicious and filling lunch option. They consist of a flavorful mixture of cooked mixed beans, colorful peppers, garlic, mushrooms, and tomatoes, all wrapped in a Mexican pancake (tortilla). Topped with salsa sauce, sour cream, and grated cheese, these burritos are a perfect combination of savory ingredients that will satisfy your taste buds.",
    "ingredients": [
      "1 Mexican pancake; (tortilla)",
      "1 c Cooked mixed beans",
      "1 c Mixed colour peppers; sliced",
      "1 Clove garlic; chopped",
      "Coriander",
      "1 Handful leeks; chopped very small",
      "1 Handful mushrooms",
      "1 Spoonful plum tomatoes",
      "1/2 c Salsa sauce",
      "Spoonful sour cream",
      "1 Handful grated cheese"
    ],
    "instructions": [
      "Fry the beans, leeks, peppers and garlic until just soft, adding the mushrooms and tomatoes in the last few minutes",
      " Spoon the mixture into your burrito",
      " Fold over and cover with salsa sauce, the sour cream and the cheese"
    ],
    "type": "Lunch",
    "cuisine": "Mexican",
    "servings": "1 servings",
    "imageUrl": "c7d3e9a7-ea9a-4429-b49f-832fdf424b83.jpeg"
  },
  {
    "id": "8e73b33f-0557-4873-bdec-10dcd4e0f1cc",
    "name": "Mexican Butternut Squash Soup",
    "description": "A flavorful and hearty Mexican Butternut Squash Soup with a blend of butternut squash, vegetables, and spices, finished with a hint of lime juice and cilantro. This soup is warm, comforting, and perfect for a cozy dinner on a chilly evening.",
    "ingredients": [
      "2 ts Olive Oil",
      "2 c Butternut Squash; Peeled And Cubed",
      "2 c Chopped Onion",
      "1 Cu Chopped Red Bell Pepper",
      "1 c Chopped Celery",
      "1/2 c Poblano Peppers; Seeded And Sliced",
      "1 ts Dried Oregano",
      "1 ts Chili Powder",
      "4 c Vegetable Broth",
      "15 1/2 cn Whole Kernel Corn; Frozen, Thawed",
      "1/4 c Fresh Lime Juice"
    ],
    "instructions": [
      "Heat oil in a large Dutch oven over medium-high heat",
      " Add squash and next 6 ingredients (squash through chili powder); sauté 3 minutes",
      " Add broth and hominy; bring to a boil",
      " Reduce heat; simmer 35 minutes or until vegetables are tender",
      " Stir in lime juice and cilantro"
    ],
    "type": "Dinner",
    "cuisine": "Mexican",
    "servings": "4 servings",
    "imageUrl": "8e73b33f-0557-4873-bdec-10dcd4e0f1cc.jpeg"
  },
  {
    "id": "e1d992c6-0e36-4c5c-9bda-cd454da54bb1",
    "name": "Mexican Cheese Melts (Quesadillas)",
    "description": "Mexican Cheese Melts, also known as Quesadillas, are delicious and easy-to-make snacks that consist of flour tortillas filled with melted Monterey Jack-pepper cheese. They are crispy on the outside and gooey on the inside, making them a perfect treat for any time of the day. Serve these cheesy delights with sour cream, salsa, and sliced scallions for an added burst of flavor.",
    "ingredients": [
      "2 1/2 c Shredded Monterey Jack-pepper cheese; (10 ounces)",
      "Ten 10-inch flour tortillas",
      "2 1/2 ts Vegetable oil"
    ],
    "instructions": [
      "Sprinkle 1/2 cup of the cheese over each of 5 tortillas and top with the remaining tortillas, making \"sandwiches",
      "\" In a large skillet, heat 1/2 teaspoon oil over medium heat",
      " Place 1 tortilla sandwich in the skillet at a time and cook for 3 to 4 minutes, or until the cheese is melted, turning halfway through the cooking",
      " Remove to a covered platter and repeat with the remaining sandwiches",
      " Cut each finished quesadilla into 4 wedges and serve",
      " NOTE: I like to serve these with sour cream, salsa, and sliced scallions",
      " And for added cheese flavor, after turning the quesadillas, I brush the top of each one with an additional 1/2 teaspoon vegetable oil then sprinkle with a teaspoon of grated Parmesan cheese",
      " NOTES : 5 melts"
    ],
    "type": "Snack",
    "cuisine": "Mexican",
    "servings": "1 servings",
    "imageUrl": "e1d992c6-0e36-4c5c-9bda-cd454da54bb1.jpeg"
  },
  {
    "id": "1195e815-6ed1-411b-b992-831310cc82bc",
    "name": "Green Thai Curry",
    "description": "Green Thai Curry is a flavorful and aromatic Thai dish made with tender pieces of chicken cooked in a rich and creamy coconut curry sauce. This dish is packed with vibrant flavors from green curry paste, fresh herbs, and spices, creating a delicious and satisfying meal perfect for dinner. Serve this Green Thai Curry with rice for a complete and comforting meal.",
    "ingredients": [
      "1 1/2 kg Roasting chicken; (3lbs)",
      "225 ml Coconut milk; (8fl oz)",
      "3 ts Green curry paste",
      "2 Sprigs tender citrus leaves",
      "1 ts Salt",
      "2 tb Fish sauce",
      "2 tb Finely chopped fresh green chillies; seeds removed",
      "4 tb Finely chopped fresh basil or coriander leaves"
    ],
    "instructions": [
      "Divide the chicken into joints",
      " Heat a cupful of coconut ?cream? (scooped off the top of the milk, after it has been left to stand for a while) in a large heavy saucepan, stirring occasionally, until the cream thickens and oil bubbles around",
      " By this time it should be reduced to a quarter of the original amount",
      " Add the curry paste and fry the rich oily cream for about 5 minutes, stirring constantly",
      " The curry paste will smell cooked, and the oil will seperate from it when it is ready",
      " When this happens add the pieces of chicken and cook over a medium low heat, stirring frequently and turning them, for about 15 minutes",
      " The chicken will change colour and have cooked appearance",
      " Add the remaining coconut milk, citrus leaves, salt and fish sauce and stir while the coconut milk comes to the boil",
      " Then turn the heat down and allow to simmer uncovered for about 35 to 40 minutes, or until the chicken is well cooked and tender and the gravy is rich and oily",
      " Stir in the chopped fresh chillies and heabs, simmer for 5 minutes longer and then turn onto a serving dish",
      " Serve with rice",
      " 1/2 Fat; 1/2 Other Carbohydrates"
    ],
    "type": "Dinner",
    "cuisine": "Thai",
    "servings": "1 servings",
    "imageUrl": "1195e815-6ed1-411b-b992-831310cc82bc.jpeg"
  },
  {
    "id": "71c114e2-2f10-408a-a53a-5df8ee620680",
    "name": "Hot and Sour Shrimp Soup (Thai)",
    "description": "Hot and Sour Shrimp Soup is a traditional Thai soup that is both spicy and tangy, with the flavors of lemongrass, lime, and chili paste. It is a light and refreshing soup that is perfect for a warm day or as a starter for a Thai meal.",
    "ingredients": [
      "1 lb Medium shrimp",
      "2 Sticks fresh lemongrass; OR Dried lemongrass",
      "4 Kaffir lime leaves (fresh or dried) -OR- Finely grated lemon zest",
      "1 1/2 qt Chicken stock",
      "1 tb Fish sauce or salt to taste",
      "3 tb Fresh lime juice or to taste",
      "1 ts Thai chili paste (nam prik pow) OR see NOTE",
      "15 oz Canned straw mushrooms; -OR- Fresh mushrooms",
      "3 Fresh hot green chilies",
      "3 tb Cilantro"
    ],
    "instructions": [
      "NOTE: The following mixture may be substituted for 1 teaspoon Thai chili paste: 1/4 ts cayenne, 1/4 tsp sugar and 1/2 tsp oil Wash, peel, de-vein shrimp",
      " Save shells",
      " Wash shrimp again, drain, pat dry, cover and refrigerate",
      " If using fresh lemongrass, cut each stick into three 2 inch pieces--starting from rounded bottom end",
      " Discard straw-like top",
      " Lightly crush the 6 pieces",
      " In a pan, combine lemongrass, lime leaves, stock, and shrimp shells",
      " Bring to boil",
      " Lower heat and simmer gently for 20 minutes",
      " Strain stock, then add fish sauce, lime juice, and chili paste",
      " Adjust fish sauce and lime juice to taste",
      " *Add more chili paste for more heat",
      " Drain straw mushrooms and add to stock",
      " (If using fresh mushrooms, quarter them and drop in lightly salted boiling water",
      " Boil 1 minute",
      " Drain and add to stock",
      ") **The soup can be prepared to this point several hours ahead of time and stored in the refrigerator",
      "** Prepare garnish shortly before serving",
      " Cut green chilies into fine rounds",
      " Wash and dry cilantro",
      " Just before serving, heat the soup, when it begins to boil, drop in peeled shrimp",
      " Cook on medium heat for 2 minutes or just until shrimp turn opaque",
      " Garnish with chilies and cilantro leaves",
      " Serve hot"
    ],
    "type": "Dinner",
    "cuisine": "Thai",
    "servings": "6 Servings",
    "imageUrl": "71c114e2-2f10-408a-a53a-5df8ee620680.jpeg"
  },
  {
    "id": "db476968-7cb8-44b6-a3fc-f4e7730d75d3",
    "name": "Bhud Thai (Flat Noodles with Prawn, Chicken And Peanuts)",
    "description": "Bhud Thai is a flavorful and aromatic Thai dish featuring flat rice noodles stir-fried with prawns, chicken, peanuts, and a blend of spices and sauces. This dish offers a perfect balance of savory, sweet, and tangy flavors, making it a satisfying and delicious lunch option.",
    "ingredients": [
      "50 g Dry flat rice noodles",
      "4 oz Prawns; peeled and deveined",
      "4 oz Chicken",
      "2 oz Peanuts",
      "2 Cloves garlic",
      "2 tb Tamarind pulp",
      "1 Whole chilli",
      "3 tb Fish sauce",
      "4 Floz stock",
      "1 Egg",
      "2 oz Beansprouts",
      "1 Stalk spring onion",
      "1 tb Sugar",
      "2 tb Oil",
      "1 Inch lemongrass"
    ],
    "instructions": [
      "Soak the noodles in cold water, being careful not to break them",
      " They will take a long time to soften",
      " Soak the tamarind pulp with 1/2 cup water",
      " Slice the chicken into thin pieces",
      " Crush the garlic and the chilli",
      " Bash the lemongrass and grind the peanuts",
      " Heat the oil and fry the garlic",
      " Add the lemongrass, chicken, prawns",
      " chilli and egg and stir well",
      " Add the noodles and continue to stir",
      " Add the fish sauce, tamarind juice, stock, sugar and spring onion",
      " Lastly add the beansprouts, stir quickly and remove",
      " Garnish with peanuts"
    ],
    "type": "Lunch",
    "cuisine": "Thai",
    "servings": "1 servings",
    "imageUrl": "db476968-7cb8-44b6-a3fc-f4e7730d75d3.jpeg"
  },
  {
    "id": "ed023d83-112b-4fc7-9f6d-568c0c05471c",
    "name": "Cha Thai (Iced Tea)",
    "description": "Cha Thai, also known as Thai Iced Tea, is a traditional Thai beverage made with Thai tea, sweetened condensed milk, and half-and-half. It is a refreshing and sweet drink perfect for hot summer days or as a delightful treat anytime. The tea is brewed multiple times to achieve its deep red color and then mixed with ice and dairy for a creamy and indulgent drink.",
    "ingredients": [
      "Stephen Ceideburg",
      "3 tb Thai tea (cha thai)",
      "6 oz Boiling water",
      "Sugar or:",
      "Sweetened Condensed Milk to taste",
      "Milk or:",
      "Half-and-Half"
    ],
    "instructions": [
      "1",
      " Place tea in a coffee filter in a drip cone",
      " Preheat carafe with boiling water; discard water",
      " Pour 6 ounces boiling water per serving into cone and let it drip through",
      " Transfer brew to another container, then pour back through filter",
      " Repeat until tea is deep red in color, a total of 4 to 6 times",
      " 2",
      " Sweeten tea to taste with sugar or condensed milk",
      " Fill tall glasses with ice cubes and add tea to fill glasses halfway",
      " Add milk or half-and-half and stir",
      " Variation: The tea may be brewed in a teapot, but it will still need to be filtered through a paper filter or a very fine nylon strainer",
      " Preheat pot with boiling water and allow to steep 6 to 8 minutes before straining"
    ],
    "type": "Beverage",
    "cuisine": "Thai",
    "servings": "6 Servings",
    "imageUrl": "ed023d83-112b-4fc7-9f6d-568c0c05471c.jpeg"
  },
  {
    "id": "73b52543-0d02-47ca-9cad-2cf6edaefd57",
    "name": "Peter Gordon's Thai Style Salad of Kangaroo",
    "description": "This recipe is a unique and flavorful Thai-style salad featuring kangaroo fillet as the main protein. The dressing is zesty and spicy, complementing the tender kangaroo meat. The addition of fresh herbs, roasted peanuts, and roasted rice adds texture and depth to the salad. It's a refreshing and exotic dish that can be a delightful main course for a special dinner.",
    "ingredients": [
      "6 Limes",
      "2 ts Coconut-palm sugar or demerara sugar",
      "1/2 Red chilli; seeded and finely chopped",
      "1/2 ts Fish sauce",
      "1/2 ts Tamari paste",
      "1 tb Vegetable oil",
      "400 g Kangaroo fillet; trimmed and cut into 6 equal strips",
      "2 ts Rice; dry-roasted in the oven or in a frying pan until golden, finely ground in a pestle and mortar or coffee grinder",
      "4 Shallots; finely sliced",
      "50 g Fresh coriander; chopped",
      "25 g Fresh mint; chopped",
      "85 g Roasted peanuts; coarsely ground"
    ],
    "instructions": [
      "1 For the Dressing: Grate the zest of three limes and squeeze the juice from all six",
      " Mix with the sugar, chilli, fish sauce and tamari until the sugar has dissolved",
      " 2 To cook the Kangaroo: Put the vegetable oil in a frying pan on a high heat and sear the kangaroo strips for 2-3 minutes, taking care not to over-cook",
      " 3 Remove from the pan and rest in a warm place for two minutes",
      " Finally, slice the kangaroo strips thinly and put in a mixing bowl with the dressing, roasted rice, shallots, herbs and peanuts",
      " Mix well and serve on plates",
      " NOTES : This recipe works as well with trimmed lamb or beef fillet"
    ],
    "type": "Dinner",
    "cuisine": "Thai",
    "servings": "6 servings",
    "imageUrl": "73b52543-0d02-47ca-9cad-2cf6edaefd57.jpeg"
  },
  {
    "id": "25bd1a9d-dc69-424a-a6f1-04affd83bc8d",
    "name": "Pad Thai",
    "description": "Pad Thai is a classic Thai stir-fried noodle dish that is savory, sweet, and slightly spicy. It is a flavorful and satisfying meal that combines rice noodles with a delicious sauce, protein (meat or shrimp), and fresh vegetables, topped with ground peanuts and lime slices for an extra burst of flavor. Perfect for a hearty dinner option.",
    "ingredients": [
      "Pad Thai rice noodles",
      "1/2 c Tomato paste",
      "1 c Granulated sugar",
      "Salt to taste",
      "1/2 ts Ground fresh chili paste",
      "1/2 ts Soy sauce",
      "1 c Vinegar",
      "1/2 c Water",
      "4 Fresh eggs",
      "8 oz Salad oil",
      "1 lb Lean meat (pork, chicken, beef) sliced 2 inches long and 1/4 inch thick, or 1 pound shrimp, shelled and deveined",
      "2 lb Bean sprouts",
      "1/2 c Thai turnip leaves or green onions, cut 1 to 2 inches long",
      "Ground peanuts, bean sprouts and lime slices, for garnish"
    ],
    "instructions": [
      "Soak the rice noodles in 10 to 12 cups cold water for 30 minutes to an hour",
      " Drain and cover with a damp towel to retain moisture",
      " In a small pot combine the tomato paste, sugar, salt, chili paste, soy sauce, vinegar and water",
      " Cook over medium heat, stirring, until all ingredients are mixed together",
      " Preheat a wok or skillet over medium heat",
      " Add vegetable oil, meat and eggs and cook until done",
      " Combine rice noodles and sauce mix with eggs and meat in wok or skillet and stir until they are evenly mixed",
      " Continue cooking, stirring frequently to make sure noodles do not get too hard or burned",
      " Add bean sprouts and turnip leaves or green onions and stir to combine",
      " Serve with ground peanuts, fresh bean sprouts and fresh lime slices on the side"
    ],
    "type": "Dinner",
    "cuisine": "Thai",
    "servings": "1 Servings",
    "imageUrl": "25bd1a9d-dc69-424a-a6f1-04affd83bc8d.jpeg"
  },
  {
    "id": "4f05cf44-01d7-4163-82a3-5f766b88acc3",
    "name": "Emily's Spanish Rice",
    "description": "Emily's Spanish Rice is a nostalgic and budget-friendly dish that has been cherished for decades. This hearty meal, made with ground beef, rice, vegetables, and a flavorful blend of spices, is a comforting and satisfying dinner option. It is a simple yet delicious recipe that can evoke fond memories and create new ones with each bite. Serve this Spanish Rice with a side of canned corn and bread for a complete and wholesome meal.",
    "ingredients": [
      "1 tb Olive oil",
      "1/2 lb Hamburger",
      "1 Yellow onion; coarsely chopped",
      "1 Bell pepper; coarsely chopped",
      "1/2 ts Commercial chili powder (I like extra hot)",
      "1 1/2 c Water",
      "1/2 c Tomato sauce",
      "1 tb Butter",
      "1 c Converted rice",
      "2 tb Worcestershire sauce",
      "1/4 ts Tabasco",
      "1/4 ts Whole thyme leaves",
      "Salt & pepper to taste"
    ],
    "instructions": [
      "SERVES 4 AS A MAIN DISH Funny how the memory of a dish can stick with you for decades",
      " When I was a child, my mother had a very limited food budget",
      " It was during World War II and she made this dish often",
      " I liked it, so l thought she was cooking this just to be nice to us",
      " Now I realize that it is a great way to feed 4 people on 1/2 pound of hamburger",
      " I don't make the dish often anymore but I still think about it now and then",
      " This dish will not win any cooking contests but it will tickle your children ",
      " ",
      " ",
      " and perhaps give them some good memories",
      " Heat a 2-quart Dutch oven and add the oil, hamburger, and onions",
      " Saut until the meat browns and falls apart and the onions are clear",
      " Remove excess fat from pan and add the green pepper and chili powder",
      " Saut an additional 5 minutes",
      " Add all remaining ingredients and bring to a boil",
      " Cover the pan and cook over low heat for 25 minutes, or until the rice is tender",
      " Mom used to serve this with canned corn and white bread",
      " I know you can do better than that"
    ],
    "type": "Dinner",
    "cuisine": "Spanish",
    "servings": "4 Servings",
    "imageUrl": "4f05cf44-01d7-4163-82a3-5f766b88acc3.jpeg"
  },
  {
    "id": "ab6f7afc-7ca8-40b3-a2f1-87c9d520fe08",
    "name": "Grandma's Spanish Rice",
    "description": "Grandma's Spanish Rice is a flavorful and comforting dish that combines tender rice with a medley of vegetables and citrusy flavors. This hearty meal is perfect for lunch or dinner, offering a delicious blend of savory and tangy notes that will satisfy your taste buds.",
    "ingredients": [
      "1 lb Uncooked rice",
      "1/4 c Oil",
      "1 ts Salt",
      "1 Lemon; juice of",
      "3 ts Sour orange sauce",
      "1/4 Sliced yellow onion",
      "1/4 Sliced green bell pepper",
      "1/4 Sliced red bell pepper"
    ],
    "instructions": [
      "Directions: Preheat a medium sized pot and fry the rice, onions, red and green peppers with the oil for approximately 30 seconds",
      " Add 3 cups of hot water to the rice mixture, along with the sour orange marinating sauce, salt, and lemon juice",
      " Fold the rice inwards once all of the water has evaporated",
      " Cover the pan with a lid",
      " Turn off heat after 1 minute"
    ],
    "type": "Lunch or Dinner",
    "cuisine": "Spanish",
    "servings": "1 servings",
    "imageUrl": "ab6f7afc-7ca8-40b3-a2f1-87c9d520fe08.jpeg"
  },
  {
    "id": "d00cc736-8333-400f-be50-77667bc17476",
    "name": "Chicken with Spanish Rice",
    "description": "A delicious and wholesome Spanish-inspired meal featuring tender chicken cooked with flavorful Spanish rice, green beans, and pimento. This dish is simmered in a rich broth with tomatoes, saffron, and parsley, creating a vibrant and aromatic flavor profile. Serve this hearty meal with a side of tossed salad for a complete and satisfying dining experience.",
    "ingredients": [
      "1 tb Plus 1 tsp vegetable oil",
      "2 lb Skinless boneless chicken breasts",
      "1/2 ts Paprika",
      "8 oz Uncooked rice",
      "1/2 c Sliced scallions",
      "1 1/2 c Low sodium chicken broth",
      "1 c Canned whole tomatoes; with liquid",
      "2 tb Choppped parsley",
      "1/8 ts Ground saffron or tumeric",
      "1/8 ts Freshly ground black pepper",
      "1 1/2 c Green beans; halved",
      "2 tb Drained chopped pimento"
    ],
    "instructions": [
      "1",
      " In a large nonstick skillet over medium-high heat, warm the oil",
      " Sprinkle both sides of the chicken with the paprika",
      " Add the chicken to the skillet and cook until golden on both sides",
      ", 7 to 8 minutes",
      " Remove the chiekn to a dish and cover loosely to keep warm",
      " 2",
      " Add the rice and the scallions to the skillet",
      " Cook, stirring frequently, until the rice is golden and translucent, 2 to 3 minutes",
      " 3",
      " Stir in the borth, tomatoes with liquid, parsley, saffron, and pepper, crushing the tomatoes with a spoon",
      " Bring the liquid to a boil",
      " Return the chicken (and any juices that have accumulated in the dish) to the skillet",
      " Cover, reduce the heat to low, and simmer for 15 minutes, stirring occasionally",
      " 4",
      " Stir in the green beans and pimento",
      " Cover and cook until the beans are just tender, about 15 minutes",
      " Nutrition Info: Serving size - generous 1 cup Calories: 270, Protein: 29 grams, Fat: 4 grams, Carbos: 26 grams, Cholesterol: 66 mg",
      ", Sodium: 137 mg",
      " Note: I serve this with a large tossed salad with mushrooms, broccoslaw, green pepper and cauliflower accented by a fat free sun dried tomato vinagrette",
      " YUMMY!"
    ],
    "type": "Dinner",
    "cuisine": "Spanish",
    "servings": "8 Servings",
    "imageUrl": "d00cc736-8333-400f-be50-77667bc17476.jpeg"
  },
  {
    "id": "c866caf9-66b4-4d1e-9393-77864e233e66",
    "name": "Halibut Braised in Spanish Pepper Sauce (Light)",
    "description": "This Halibut Braised in Spanish Pepper Sauce is a flavorful and light dish that combines the delicate taste of halibut with a zesty Spanish pepper sauce. The dish is cooked with a medley of vegetables, prosciutto, and spices, creating a savory and aromatic sauce that perfectly complements the tender halibut fillets. It is a satisfying and wholesome dinner option for seafood lovers looking for a delicious and healthy meal.",
    "ingredients": [
      "1 tb Olive oil",
      "1 c Onion, finely chopped",
      "1 Clove garlic, minced",
      "1 sm Red bell pepper, finely chopped",
      "1 sm Green bell pepper, finely chopped",
      "1 sm Carrot, finely chopped",
      "2 sl Prosciutto, finely chopped",
      "1 cn (16-oz) diced tomatoes, undrained",
      "1 Bay leaf",
      "2 tb Red wine vinegar",
      "3/4 ts Paprika",
      "1/4 ts Hot pepper sauce",
      "1/4 ts Salt",
      "Freshly ground black pepper, to taste",
      "1 1/3 lb Halibut fillet, cut in 4 pieces",
      "1 tb Lemon juice"
    ],
    "instructions": [
      "1",
      " In a large (10- to 12-inch) skillet, heat the olive oil over medium heat",
      " Add the onion, garlic, bell peppers and carrot",
      " Cover the pan and cook 10 minutes, stirring occasionally",
      " 2",
      " Stir in the chopped prosciutto, tomatoes, bay leaf, vinegar, paprika, hot pepper sauce, salt and pepper",
      " Simmer, uncovered, 5 minutes",
      " 3",
      " Place the halibut pieces in the pan, spoon some of the sauce over",
      " Cover the pan and cook 12 minutes per inch of thickness, or until the fish tests done",
      " 4",
      " Sprinkle the dish with lemon juice and serve"
    ],
    "type": "Dinner",
    "cuisine": "Spanish",
    "servings": "4 Servings",
    "imageUrl": "c866caf9-66b4-4d1e-9393-77864e233e66.jpeg"
  },
  {
    "id": "7abb973d-27f4-4022-8b54-4651c3049032",
    "name": "Pat's Spanish Omelet",
    "description": "A delicious and hearty Spanish omelet packed with sauteed vegetables, eggs, and flavorful seasonings. Perfect for a satisfying breakfast or brunch option.",
    "ingredients": [
      "2 tb Olive Oil",
      "1 lg Green Pepper; (Chopped)",
      "1 lg Onion; (Chopped)",
      "4 Cloves Garlic; (Minced)",
      "1/2 ts Salt",
      "1/2 ts Black Pepper; (Ground)",
      "1 tb Parsley",
      "1/2 ts Thyme",
      "8 lg Mushrooms; (Sliced)",
      "1 1/2 c Tinned Tomatoes; (Drained)",
      "6 lg Eggs; Beaten",
      "2 sm Jalapeno Peppers; (chopped)",
      "1 tb Romano Cheese",
      "1 pn Basil"
    ],
    "instructions": [
      "Saute Green Pepper, Onion, and Garlic in olive oil until soft",
      " Add Mushrooms, Jalapeno peppers, & Seasonings",
      " Stir Well",
      "",
      " Then add tomatoes, mashing them up a bit so they are not whole, and let simmer for 10 minutes",
      " Sprinkle the Romano Cheese over the mixture and then Add eggs to mixture by pouring over top",
      " Cook over medium heat",
      " Lift edges of omelet to let uncooked egg flow under",
      " When set, fold over and serve at once on warm platter",
      "",
      "",
      " Sometimes I add Cheddar Cheese over the top of this, sometimes I dont",
      "",
      " Preference presides"
    ],
    "type": "Breakfast",
    "cuisine": "Spanish",
    "servings": "1 Servings",
    "imageUrl": "7abb973d-27f4-4022-8b54-4651c3049032.jpeg"
  },
  {
    "id": "62693617-c33a-49ca-a225-9f8bd6013a54",
    "name": "Crockpot Spanish Rice",
    "description": "Crockpot Spanish Rice is a flavorful and hearty dish made with ground beef, onions, green peppers, tomatoes, rice, and a blend of spices. It is a comforting and satisfying meal that is perfect for dinner.",
    "ingredients": [
      "1 1/2 lb Ground beef; browned & drained",
      "1 md Onion; chopped",
      "1 Green pepper; chopped",
      "14 1/2 oz Tomatoes; whole, or",
      "2 lg Tomatoes; sliced & quartered",
      "16 oz Tomato sauce",
      "3/4 c Water",
      "2 ts Chili powder",
      "2 ts Worcestershire sauce",
      "1 1/2 ts Salt",
      "3/4 c Rice; converted, raw"
    ],
    "instructions": [
      "We like a spicier (hotter) flavor and a moister casserole, so I replace the tomato sauce with 2 tbsp Hot Thick & Chunky Salsa, 1/4 cups sherry and 1 15 oz can tomato sauce",
      " /MISC"
    ],
    "type": "Dinner",
    "cuisine": "Spanish",
    "servings": "6 Servings",
    "imageUrl": "62693617-c33a-49ca-a225-9f8bd6013a54.jpeg"
  },
  {
    "id": "4de272b4-6179-4217-b835-4347113095d4",
    "name": "Oakville Grocery's Spanish Olive Mix",
    "description": "Oakville Grocery's Spanish Olive Mix is a flavorful and aromatic appetizer featuring a mix of unpitted Spanish olives marinated in olive oil, balsamic vinegar, garlic, herbs, and spices. The combination of different olives creates a visually appealing dish with a variety of textures and flavors. Perfect for serving as a starter or appetizer before a meal.",
    "ingredients": [
      "3 c Unpitted Spanish olives",
      "2 tb Olive oil",
      "2 tb Balsamic vinegar",
      "2 Garlic cloves; minced",
      "1 ts Minced fresh thyme",
      "1 ts Minced fresh oregano",
      "1/4 ts Minced fresh rosemary",
      "1/4 ts Hot red pepper flakes",
      "1/2 Orange; removed with a zester , Zest of"
    ],
    "instructions": [
      "Check specialty food markets for Spanish olives such as Arbequina, Manzanilla and Farga Aragon",
      " If you can't find them, substitute other unpitted olives, aiming for a variety of colors, sizes and textures",
      " INSTRUCTIONS: Combine all ingredients in a large bowl",
      " Let stand at cool-room temperature for at least 12 hours before serving",
      " Olives may remain at room temperature for up to 36 hours but should be refrigerated after that",
      " Yields 3 cups"
    ],
    "type": "Appetizer",
    "cuisine": "Spanish",
    "servings": "1 Servings",
    "imageUrl": "4de272b4-6179-4217-b835-4347113095d4.jpeg"
  },
  {
    "id": "388510cb-4fe1-4eee-bf09-26fd31335b76",
    "name": "Octopus Spanish Style",
    "description": "A flavorful Spanish-style octopus dish simmered in a rich tomato sauce with spices and served over fresh cooked rice. This dish offers a unique blend of flavors and textures, making it a delightful meal for seafood lovers.",
    "ingredients": [
      "2 lg (or four small) tentacles",
      "15 oz Tomato sauce",
      "1/2 sm Onion, chopped",
      "1 ts Chili powder",
      "Pepper and garlic to taste"
    ],
    "instructions": [
      "Beat tentacles to tenderize",
      " Boil for about 20 minutes in salted water",
      " Slice",
      " Heat frying pan and just enough fat to cover the bottom",
      " Fry onion",
      " Add tomato, chili powder, pepper, garlic powder, and let simmer one-half hour",
      " Then add sliced octopus and simmer for another hour",
      " Serve over fresh cooked rice",
      " Pauline Calugan \"Island Edibles,\" Sand Point, AK"
    ],
    "type": "Dinner",
    "cuisine": "Spanish",
    "servings": "1 Servings",
    "imageUrl": "388510cb-4fe1-4eee-bf09-26fd31335b76.jpeg"
  },
  {
    "id": "dc1c01de-ab78-42b9-b994-1f1f7d53bcbd",
    "name": "Sopa De Ajo - Spanish-Style Garlic Soup",
    "description": "Sopa De Ajo is a flavorful and hearty Spanish-style garlic soup that is perfect for a cozy dinner. This soup is rich in garlic and spices, accompanied by bread and optional eggs for added texture and protein. It's a comforting and satisfying meal that is sure to warm you up on a chilly evening.",
    "ingredients": [
      "1 Head of garlic; broken into cloves",
      "5 tb Olive oil",
      "4 sl Country bread",
      "1 tb Paprika",
      "1/2 ts Ground cumin",
      "1 qt Chicken broth or water",
      "4 Eggs; (optional)"
    ],
    "instructions": [
      "Lightly brown the unpeeled garlic in 5 tablespoons of olive oil over medium heat for about 10 minutes",
      " Remove the garlic from the pot with a slotted spoon and brown the country bread slices on each side in the garlic-scented oil",
      " Take the bread out and set aside",
      " Sprinkle the bottom of the hot pot with the paprika and cumin",
      " Return the garlic to the pot along with the broth or water",
      " Cover the pot and simmer until the garlic cloves soften, about 30 minutes",
      " Strain the soup through the finest disk of a food mill or puree it in a blender and strain through a medium-mesh strainer",
      " Preheat the oven to 350 F",
      " Bring the soup back to a simmer and ladle it into ovenproof bowls or soup crocks",
      " Place a browned bread slice on top of each one, then break an egg into each bowl on top of the bread if you're using the eggs",
      " Bake the soup until the egg white sets but the yolk is still runny; start checking after about six minutes",
      " Serves 4 Recipe is from Splendid Soups by James Peterson"
    ],
    "type": "Dinner",
    "cuisine": "Spanish",
    "servings": "1 Servings",
    "imageUrl": "dc1c01de-ab78-42b9-b994-1f1f7d53bcbd.jpeg"
  },
  {
    "id": "ecc04556-2324-40f0-b8e3-98067927fb18",
    "name": "Sopa De Cebollita or Spanish Onion Soup (Rodriguez)",
    "description": "Sopa De Cebollita or Spanish Onion Soup by Chef Douglas Rodriguez is a hearty and savory soup featuring caramelized onions, skirt steak, and a flavorful broth with sherry, Worcestershire sauce, soy sauce, and balsamic vinegar. This dish offers a rich depth of flavors, making it perfect for a warm and satisfying dinner.",
    "ingredients": [
      "3 tb Unsalted butter",
      "2 Red or white pearl onions; julienned",
      "1 c Dry sherry",
      "3 tb Worcestershire sauce",
      "3 tb Soy sauce",
      "3 tb Balsamic vinegar",
      "1 ga Beef stock",
      "1 lb Skirt steak",
      "2 tb Flour",
      "6 Cloves garlic; finely chopped",
      "1/2 ts Salt",
      "1/2 ts Freshly ground black pepper",
      "2 tb Olive oil",
      "3 lb Pearl onions; peeled"
    ],
    "instructions": [
      "In a large stockpot over high heat, melt the butter",
      " Add the julienned onions and caramelize while stirring, about six minutes",
      " Add the sherry, Worcestershire, soy sauce and vinegar",
      " Reduce and cook about 10 minutes",
      " Add the stock and bring to a boil, then decrease the heat to low, cover and simmer",
      " Combine the flour, garlic, salt and pepper in a large mixing bowl",
      " Cut the steak into thin strips and toss with the flour mixture to coat evenly",
      " Heat the oil in a saute pan over high heat",
      " Add the steak strips and sear while stirring for about five minutes",
      " Uncover the stockpot",
      " Add the steak strips and simmer for about 20 minutes",
      " Add the peeled onion and simmer another 20 minutes",
      " Ladle the soup into bowls",
      " Serves 4",
      " Notes: Chef Douglas Rodriguez specializes in one-pot meals native to the Caribbean and to Central and South America",
      " He's the Cuban-American chef of Manhattan's Patria restaurant"
    ],
    "type": "Dinner",
    "cuisine": "Spanish",
    "servings": "4 Servings",
    "imageUrl": "ecc04556-2324-40f0-b8e3-98067927fb18.jpeg"
  },
  {
    "id": "d88bfcb6-e600-4e04-8b9f-059ad65316dd",
    "name": "Longganisa (Filipino-Style Sausages)",
    "description": "Longganisa is a Filipino-style sausage made from a mixture of ground beef and pork, seasoned with a blend of salt, sugar, soy sauce, vinegar, wine, saltpeter, pepper, and garlic. The mixture is cured for 5-6 days, stuffed into casings, and stored in a cooler until ready for use. To cook, the sausages are boiled and then pan-fried until they turn a dark caramel color, releasing flavorful juices and oil. Longganisa is commonly enjoyed with sinangag (garlic fried rice) and lightly salted tomatoes.",
    "ingredients": [
      "Mixture of 30% ground beef",
      "And 70% ground pork",
      "For every 2.2 pounds (1 kilo",
      "Mixture add:",
      "2 1/2 tb Salt",
      "1 1/2 tb Sugar",
      "1 1/2 tb Soy sauce",
      "2 tb Vinegar",
      "2 tb Wine",
      "1/8 ts Saltpeter; (salitre)",
      "1 ts Ground pepper",
      "2 ts Chopped garlic",
      "Sausage casings, available at any butcher shop"
    ],
    "instructions": [
      "Mix all ingredients together and cure mixture for 5-6 days in the refrigerator and stuff into casings",
      " This kind of sausage should be stored in a cooler, ready for use",
      " To cook: Place a small amount of water in a skillet",
      " Place sausages and let boil in water for about 10 minutes",
      " With a fork, pierce casings",
      " The Longganisa will be ready when juices flow out and turn a dark caramel color",
      " The sausages should also turn the same color and some oil should leak out",
      " Suggestions: You can eat the Longganisa and tapa with pieces of lightly salted tomatoes",
      " This will make a perfect compliment to the sinangag"
    ],
    "type": "Breakfast",
    "cuisine": "Filipino",
    "servings": "1 Servings",
    "imageUrl": "d88bfcb6-e600-4e04-8b9f-059ad65316dd.jpeg"
  },
  {
    "id": "9af08526-c84c-431c-9ddf-40305c09404c",
    "name": "Filipino Cuisine Tips, 1 of 2",
    "description": "This Filipino cuisine recipe collection offers a blend of exotic and easy-to-prepare dishes. It includes traditional ingredients like bagoong (shrimp paste) and patis (fish sauce) that add unique flavors to the meals. Rice is a staple side dish, complemented by simple side dishes like tomato and onion salad. The recipes reflect the heart-healthy aspect of Filipino dining, where rice forms the bulk of the meal while meat dishes serve as flavor enhancers. Multiple main dishes may be served together, akin to a Chinese-style meal with a variety of courses.",
    "ingredients": [
      "E-mail dialogue between",
      "Manny Rothstein",
      "Dennis Santiago and"
    ],
    "instructions": [
      "MR> Got your recipes and most of them look great (though I think I may MR> on the Pork Livers in Pigs Blood, I'm trying to cut down, but I am MR> that it is there), a great blend of exotic and easy to prepare",
      " Th MR> for sharing them with me",
      " Most people pass on the pigs blood",
      " Try it sometime though",
      " If your palate is onto the more exotic forms of cuisine, I think you'll be pleasantly surprised",
      " before I post them onto the Cooking Echo, I would like to impose o MR> a little bit more for some clarification about ingredients and som MR> background on Filipino cuisine",
      " I also intend to post the entire MR> collection as a file on your board and the Salata board",
      " After I d MR> that, it should take on a life of its own and propagate itself MR> throughout cyber space",
      " Great",
      " I'll try to clarify as much as I can",
      " MR> What is bagoong, and how is it prepared? Bagoong is a salty mixture made from shrimp",
      " It's packaged in 1/2 pin jars and sold in the refrigerated foods section in oriental stores",
      " It also an easily available import from the Philippines item these days",
      " Unfortunately, I do not know of any substitutes",
      " MR> What is patis (fish sauce? Is it like Vietnamese fish sauce? Patis and Vietnamese fish sauce are one and the same",
      " It's a brine ma with fish ingredients",
      " If unavailable, salt can be used as a substitu for the brine component",
      " MR> Is rice or bagoong the traditional side dishes for all of the reci MR> or are there other side dishes that you recommend",
      " Some tidbits about the Filipino table: 1",
      " Rice is always served with the meal",
      " One of the healthy aspects o Filipino diet is that rice makes up the bulk of the meal while the mea dish is used as a flavor enhancement",
      " You can see how this combinatio naturally fulfills the heart and cholesterol meal plans",
      " 2",
      " One of my favorite side dishes to go along with a Filipino meal is actually the simplest of fare",
      " The ingredients are: Tomatoes 2-3 Medium, sliced or diced Onion 1/2 Medium, chopped Cilantro a little for flavor and color Patis 3-4 Tablespoons Vinegar 2-3 Tablespoons Mix the whole mess in a bowl and serve alongside rice and the main dis 3",
      " It's not unusual for a typical Filipino meal to have several main dishes served together at one sitting",
      " That's much the same as a Chin table where a variety of courses help to spread the palate around",
      " MR> In Pasiw Na Isda you recommend in dir",
      " #1 \"",
      "",
      "",
      "add all other MR> ingredients\", should it be \"",
      "",
      "",
      "add all other ingredients except bi MR> melon and eggplant\"",
      " You are correct",
      " (continued in part 2)"
    ],
    "type": "Dinner",
    "cuisine": "Filipino",
    "servings": "1 Servings",
    "imageUrl": "9af08526-c84c-431c-9ddf-40305c09404c.jpeg"
  },
  {
    "id": "416d6437-ca9a-4fa8-b4a1-d9d9370e9d7f",
    "name": "Filipino Cuisine Tips, 2 of 2",
    "description": "This Filipino cuisine recipe offers insights into traditional cooking techniques and ingredients used in Filipino dishes. The recipe includes tips on maintaining authenticity and provides information on ingredient substitutions for those without access to Filipino markets. The conversation between Manny Rothstein and Dennis Santiago sheds light on the nuances of Filipino cuisine, highlighting the importance of texture and flavor preferences within the Filipino community.",
    "ingredients": [
      "E-mail dialogue between",
      "Manny Rothstein",
      "Dennis Santiago and"
    ],
    "instructions": [
      "MR> In Traditional Adobo, can the sauce be reduced or thickened and st MR> be \"traditional\" (many cooks will adapt these recipes to their tas MR> but I want to be sure I am posting your authentic recipes as a sta MR> point)",
      " Actually, no",
      " Not and remain the \"traditional\" form anyway",
      " I've personally never seen Filipino cooks tinker with sauce consistency ver much",
      " There's more experimentation in the area of spice mixtures",
      " As matter of fact, changing which leafy green vegetable is used in a basi recipe is used to change the character of the dish",
      " This shouldn't be surprising when one considers that the Philippines is geographically i general region of the spice trade",
      " Sauces, meaning manipulations of f texture, seem to be more of a Western phenomenon",
      " Interestingly, like many multi-course European presentations, big Fili meals tend to stretch out in time as well giving lots of opportunity t converse",
      " The main difference is that one just keeps going back for mo when the urge hits then sit down next to someone and chat",
      " More akin t all day American barbecue",
      " MR> Are Achute seeds the same as Annato seeds? I'm not sure",
      " MR> What is mochiko (powdered rice) like and what does it do (is it a MR> thickener or flavor agent?)",
      " It's used as a thickening agent",
      " It's optional and was in the recipe that my mother gave me",
      " She never used it though so as far as my cook is concerned it might as well not be there",
      " Still, this is one dish t seems to have a duality of texture preference within the Filipino community",
      " [One of those, it depends on how mom made it things",
      "] I included the mochiko for completeness sake",
      " MR> Can you recommend any common American substitutes for some of the MR> authentic ingredients, for the sake of people living in parts of t MR> country without access to Filipino markets? Probably the best way to explain substitution is as follows: Ingredient Use Substitute Tamarind Sour Vitamin C \u003d Lemon Juice Patis Salt Salt Ampalaya Bitter beats me? Everything else is pretty common I think",
      " MR> I hope I am not being too \"nit picky\" with these questions",
      " If you MR> think I am, let me know and I will start posting as is immediately Not at all",
      " Hope this was what you wanted",
      " Regards, Dennis (Note: According to \"Stocking Up III\", pub",
      " by Rodale Press, mochiko r flour has a unique property as a sauce or casserole thickener",
      " It does separate when chilled or frozen",
      " MR)"
    ],
    "type": "Dinner",
    "cuisine": "Filipino",
    "servings": "1 Servings",
    "imageUrl": "416d6437-ca9a-4fa8-b4a1-d9d9370e9d7f.jpeg"
  },
  {
    "id": "174b8f51-93f6-4500-9566-29929f34eb2d",
    "name": "Filipino Rice",
    "description": "Filipino Rice is a flavorful and hearty dish made with a combination of rice, pork, bacon, eggs, soy sauce, and onions. It is a traditional Filipino meal that is perfect for a satisfying dinner.",
    "ingredients": [
      "2 3/4 ga WATER",
      "2 c BACON FAT",
      "4 lb PORK BUTTS FZ",
      "20 EGGS SHELL",
      "1/4 ts GARLIC DEHY GRA",
      "2 1/2 lb ONIONS DRY",
      "9 lb RICE 10LB",
      "1 1/2 c SOY SAUCE",
      "8 ts SALT TABLE 5LB"
    ],
    "instructions": [
      "PAN: 12 BY 20 BY 4\" STEAM TABLE PAN TEMPERATURE: 350F",
      " OVEN 350F",
      " GRIDDLE 1",
      " SAUTEE 2 LB 8 OZ (1 3/4 QT) CHOPPED DRY ONIONS (2 LB 12 OZ A",
      "P",
      ") IN 1 LB (2 CUPS) BACON FAT UNTIL LIGHT YELLOW",
      " ADD 9 LB (5 1/4 QT) RICE; STIR UNTIL WELL COATED",
      " ADD 2 3/4 GAL WATER, 1/4 TSP DEHYDRATED GARLIC, AND 1 2/3 OZ (2 2/3 TBSP) SALT TO RICE MIXTURE",
      " BRING TO A BOIL IN STEAM JACKETED KETTLE OR STOCK POT; COVER; SIMMER 20-25 MINUTES",
      " 2",
      " POUR BEATEN EGGS ON LIGHTLY GREASED GRIDDLE",
      " COOK UNTIL WELL DONE",
      " DO NOT TURN",
      " CUT INTO STRIPS; ADD AN EQUAL AMOUNT TO RICE MIXTURE IN EACH PAN",
      " 3",
      " ADD PORK TO RICE IN EACH PAN",
      " MIX LIGTHLY BUT THOROUGHLY",
      " 4",
      " BAKE 45 MINUTES",
      " 5",
      " REMOVE FROM OVEN; BLEND IN 1/2 CUP SOY SAUCE PER PAN",
      " NOTE: 1",
      " IN STEP 1, 11 LB 10 OZ MEDIUM GRAIN RICE MAY BE USED",
      " PREPARE ACCORDING TO INSTRUCTIONS ON CONTAINER",
      " 2",
      " IN STEP 2, IF CONVECTION OVEN IS USED, BAKE AT 325F",
      " 30 MINUTES ON HIGH FAN, CLOSED VENT; IN STEP 7, 30 MINUTES ON HIGH FAN, CLOSED VENT",
      " 3",
      " IN STEP 3, 2 LB 12 OZ DRY ONIONS A",
      "P",
      " WILL YIELD 2 LB 8 OZ FINELY CHOPPED ONIONS",
      " 1 LB 13 OZ FRESH SWEET PEPPERS A",
      "P",
      " WILL YIELD 1 LB 8 OZ FINELY CHOPPED PEPPERS",
      " 2 LB 1 OA FRESH CELERY A",
      "P",
      " WILL YIELD 1 LB 8 OZ FINELY CHOPPED CELERY",
      " 4",
      " IN STEP 3, 5 OZ (1 2/3 CUPS) DEHYDRATED ONIONS AND 4 OZ ( 3 CUPS) DEHYDRATED GREEN PEPPERS (SEE RECIPE NO",
      " A-11) OR 1 LB 8 OZ (4 1/2 CUPS) FROZEN DICED GREEN PEPPERS MAY BE USED",
      " THAW PEPPERS",
      " 5",
      " IN STEP 6, 10 OZ (2 1/2 CUPS) CANNED DEHYDRATED EGG MIX COMBINED WITH 3 CUPS WARM WATER MAY BE USED FOR WHOLE EGGS",
      " SEE RECIPE NO",
      " A-8",
      " 6",
      " IN STEP 6, 7 LB PORK BUTT, THAWED, MAY BE USED",
      " COOK, COVERED IN STEAM JACKETED KETTLE OR STOCK POT, 3 HOURS OR UNTIL 170F",
      " REMOVE; COOL; DICE IN 1/2 BY 1/2 PIECES",
      " 7",
      " IN STEP 6, 4 LB CANNED HAM, DICED IN 1/2 BY 1/2 INCH PIECES MAY BE USED",
      " 8",
      " TWO NO",
      " 10 SCOOPS MAY BE USED",
      " SEE RECIPE NO",
      " A-4",
      " SERVING SIZE: 3/4 CUP"
    ],
    "type": "Dinner",
    "cuisine": "Filipino",
    "servings": "100 Servings",
    "imageUrl": "174b8f51-93f6-4500-9566-29929f34eb2d.jpeg"
  },
  {
    "id": "81090cbe-a4c2-41b3-97da-95dbbe107694",
    "name": "Filipino \"Adobo\"-Style Chicken",
    "description": "Filipino \"Adobo\"-Style Chicken is a traditional Filipino dish made with chicken, vinegar, soy sauce, and garlic. The chicken is simmered in a flavorful sauce until tender and then browned to perfection. It is served with rice and is a popular savory dish in Filipino cuisine.",
    "ingredients": [
      "8 Whole chicken legs; (about 4 pounds), cut into drumstick and thigh sections",
      "1 1/2 c Distilled white vinegar",
      "3 Garlic cloves; crushed",
      "2 Bay leaves",
      "1/2 tb Whole black peppercorns; crushed lightly",
      "3/4 c Soy sauce",
      "3 tb Vegetable oil",
      "Cooked rice as an accompaniment"
    ],
    "instructions": [
      "In a large kettle combine the chicken, the vinegar, the garlic, the bay leaves, the peppercorns, and 1 cup water, bring the mixture to a boil, and simmer it, covered, for 20 minutes",
      " Add the soy sauce and simmer the mixture, covered, for 20 minutes",
      " Transfer the chicken with tongs to a plate and boil the liquid for 10 minutes, or until it is reduced to about 1 cup",
      " Let the sauce cool, remove the bay leaves, and skim the fat from the surface",
      " In a large skillet heat the oil over high heat until it is hot but not smoking and in it saute the chicken, patted dry, in batches, turning it, for 5 minutes, or until it is browned well",
      " Transfer the chicken to a rimmed platter, pour the sauce, heated, over it, and serve the chicken with the rice",
      " Serves 4 to 8"
    ],
    "type": "Dinner",
    "cuisine": "Filipino",
    "servings": "1 servings",
    "imageUrl": "81090cbe-a4c2-41b3-97da-95dbbe107694.jpeg"
  },
  {
    "id": "3c108ae3-f7e3-4a55-a8ff-0288461cd944",
    "name": "Ensaimadas - Filipino Recipe",
    "description": "Ensaimadas are a delicious Filipino pastry made with a rich dough filled with golden raisins and parmesan cheese. They are a labor-intensive but worth-it treat that can be enjoyed for breakfast or as a snack. This recipe yields a large batch that can be frozen for later enjoyment.",
    "ingredients": [
      "2 1/2 Sticks margarine",
      "1 c Sugar",
      "9 Egg yolks",
      "1 Whole egg",
      "2 pk Dry yeast; dissolved in",
      "1/2 c Water",
      "1 c Milk",
      "1 ts Salt",
      "6 c Bread flour",
      "Golden raisins",
      "Melted butter",
      "Parmesan cheese"
    ],
    "instructions": [
      "Have margarine and eggs at room temperature",
      " Dissolve the yeast in water",
      " Cream margarine and eggs until fluffy",
      " Add the dissolved yeast, milk and salt",
      " Add flour",
      " Knead until dough no longer sticks to your hands",
      " Add more flour if necessary",
      " Let rise 2-3 hours in a warm place until double in bulk",
      " Punch down",
      " Divide dough into 4 equal part and form each part into a long roll",
      " Cut off pieces the size of an egg",
      " Roll each piece into an thin oblong and brush with melted butter",
      " Sprinkle with a little parmesan cheese and a few golden raisins",
      " Roll into a coil and place in greased muffin tins",
      " Let rise, covered until 3 times in bulk",
      " Bake at 350 degrees",
      " Remove from tins and brush top with melted butter and roll in a mixture of 1 cup sugar and 2 T",
      " parmesan cheese",
      " NOTES : These are somewhat labor intensive, but worth every bite",
      " Makes lots and lots",
      " Freeze for later enjoyment!!"
    ],
    "type": "Breakfast",
    "cuisine": "Filipino",
    "servings": "1 Servings",
    "imageUrl": "3c108ae3-f7e3-4a55-a8ff-0288461cd944.jpeg"
  },
  {
    "id": "d235f6fd-a6fd-4b48-8023-e1d29a90749d",
    "name": "Maxanne's Japanese Okra",
    "description": "Maxanne's Japanese Okra is a delightful appetizer featuring boiled okra slices mixed with shaved bonito fish, soy sauce, and red pepper flakes. This refreshing dish is best enjoyed alongside Japanese rice, offering a burst of flavors with each bite. It is a light and flavorful starter that is perfect for any Japanese-inspired meal or as a standalone snack.",
    "ingredients": [
      "3/4 lb Okra",
      "1 pk Katsuobushi; (shaved bonito fish)",
      "1 pn Toogarashi; (red pepper flakes)",
      "Shoyu (soy sauce); to taste"
    ],
    "instructions": [
      "Wash then boil the okra in a saucepan of boiling water until almost tender but still firm",
      " Drain and put in refrigerator to cool",
      " When ready to eat, slice okra into 1/4-inch rings, put in small mixing bowl and then add bonita flakes",
      " Stir and add shoyu to moisten and to taste and add a touch of toogarashi, depending on how spicy you like it",
      " Best eaten with Japanese rice",
      " This recipe yields 4 to 6 appetizer servings",
      " Per serving: 32 Calories (kcal); trace Total Fat; (2% calories from fat); 2g Protein; 6g Carbohydrate; 0mg Cholesterol; 7mg Sodium Food Exchanges: 0 Grain(Starch); 0 Lean Meat; 1 1/2 Vegetable; 0 Fruit; 0 Fat; 0 Other Carbohydrates"
    ],
    "type": "Appetizer",
    "cuisine": "Japanese",
    "servings": "4 servings",
    "imageUrl": "d235f6fd-a6fd-4b48-8023-e1d29a90749d.jpeg"
  },
  {
    "id": "817d6024-51ae-4661-9eae-aae8b12d607a",
    "name": "Halibut with Japanese Flavors",
    "description": "Halibut with Japanese flavors is a delicious and healthy dish featuring tender halibut fillets coated in a savory miso paste, topped with seaweed and scallions, and baked to perfection. This recipe offers a taste of Japan with its umami-rich miso and nori seaweed, creating a flavorful and satisfying meal.",
    "ingredients": [
      "Cross TMPJ72B",
      "2 tb White miso paste",
      "1 tb Sugar",
      "1 tb Rice wine or dry sherry",
      "1 ts Reduced-sodium soy sauce",
      "1 lb Halibut fillet, skinned and",
      "Into 4 portions",
      "2 Sheets nori seaweed, cut",
      "Julienne strips",
      "2 Scallions, trimmed, thinly sliced"
    ],
    "instructions": [
      "Preheat oven to 400 degrees",
      " Prepare 4 parchment or aluminum foil papillotes (as described in previous \"All Wrapped Up\" recipes)",
      " In a small bowl, stir together miso paste, sugar, rice wine or sherry and soy sauce until smooth",
      " Place a piece of halibut in the center half of each opened paper heart",
      " Brush the miso mixture over the halibut and top with seawood and scallions",
      " Seal the packages and place them on a baking sheet",
      " Bake for 10 to 12 minutes, or until the packages are puffed",
      " (You may open one package to check that the fish is opaque",
      ") Transfer to plates; let each diner open his or her own package",
      " Serves 4",
      " 195 calories per serving: 4 grams fat, 440 mg sodium and 47 mg cholesterol",
      " COMMENTS: Sheets of nori seaweed are most familiar as suchi wrappers",
      " You can find miso and seaweed in Japanese markets and health food stores",
      " By CWBJ78A NANCY BERRY Time:"
    ],
    "type": "Dinner",
    "cuisine": "Japanese",
    "servings": "4 Servings",
    "imageUrl": "817d6024-51ae-4661-9eae-aae8b12d607a.jpeg"
  },
  {
    "id": "39d7053c-aeae-45bd-8d7a-8864ba8f2824",
    "name": "Chowan Mushi - Japanese Steamed Egg Custard",
    "description": "Chowan Mushi is a traditional Japanese dish that consists of a delicate and creamy steamed egg custard mixed with shrimp and peas. It is a light and flavorful dish that is perfect for a satisfying dinner.",
    "ingredients": [
      "8 Eggs; lightly beaten",
      "1 ts Salt",
      "2 tb Dry sherry",
      "1/2 c Fresh peas; cooked",
      "1/4 lb Shelled shrimp; finely chopped"
    ],
    "instructions": [
      "While continuing to beat the eggs, add the salt, sherry, peas, and shrimp",
      " Divide among 4 greased custard cups",
      " Set the custard cups on a rack in a deep saute pan or dutch oven",
      " Cover with a piece of wax paper",
      " Pour boiling water down the sides of the pan to come one quarter of the way up the cups",
      " Cover the pan and simmer so that the custard steams for about 20 minutes, or just until set",
      " Do not boil",
      " Serving Ideas : good with stir-fried vegetables NOTES : If fresh peas are not available use thawed frozen"
    ],
    "type": "Dinner",
    "cuisine": "Japanese",
    "servings": "1 Servings",
    "imageUrl": "39d7053c-aeae-45bd-8d7a-8864ba8f2824.jpeg"
  },
  {
    "id": "45f4feea-af50-4bc9-b6f9-82ba6a7cbdd6",
    "name": "Martha Stewart's Japanese Salad Dressing",
    "description": "A flavorful and savory Japanese salad dressing with a mix of miso, sugar, mirin wine, soy sauce, and sesame oil. Served over a bed of iceberg lettuce and thinly sliced carrots, this dressing adds a delicious Asian twist to your salad.",
    "ingredients": [
      "3/4 c Red miso",
      "3 tb Sugar",
      "3 tb Mirin wine",
      "2 tb Hot water",
      "2 ts Light soy sauce",
      "1/4 ts Sesame oil",
      "1 tb Toasted sesame seeds",
      "1/2 Head iceberg lettuce; torn",
      "1 md Carrot; thinly sliced"
    ],
    "instructions": [
      "MAKES 1 CUP In a small bowl, combine miso and sugar",
      " Add mirin, water, soy sauce, sesame oil, and sesame seeds",
      " Stir until well blended",
      " Serve over lettuce and carrot slices",
      " Toss to combine"
    ],
    "type": "Salad",
    "cuisine": "Japanese",
    "servings": "8 Servings",
    "imageUrl": "45f4feea-af50-4bc9-b6f9-82ba6a7cbdd6.jpeg"
  },
  {
    "id": "8c1a1a96-fc91-4b7b-b60c-ef462c3bde5a",
    "name": "Roasted Japanese Eggplant with Green Herb Sau",
    "description": "This recipe features roasted Japanese eggplants marinated in a flavorful green herb sauce made from fresh cilantro, Italian parsley, ground cumin seeds, lemon zest, and lemon juice. The eggplants are first roasted until soft and then peeled to maintain their shape. The sauce is then blended and poured over the eggplants to marinate for at least an hour, allowing the flavors to infuse. This dish offers a delicious and refreshing dinner option with a unique blend of herbs and citrus flavors.",
    "ingredients": [
      "6 Japanese eggplants, 6 to 8 inches long",
      "1 c Fresh cilantro leaves",
      "1 c Fresh Italian parsley leaves",
      "1 ts Ground cumin seeds; roasted",
      "Zest of 2 lemons",
      "1/2 c Lemon juice",
      "Black pepper",
      "Salt"
    ],
    "instructions": [
      "Over a grill or gas flame, roast the eggplant until the skin blackens and the flesh is soft",
      " Allow to col and peel carefully with a small sharp knife to remove all the skin, being careful that the eggplants keep their shape",
      " Puree the remaining ingredients in a blender or food processor",
      " Pour the sauce over the eggplants and allow them to marinate in the sauce for at least an hour",
      " From DEEANNE's recipe files"
    ],
    "type": "Dinner",
    "cuisine": "Japanese",
    "servings": "6 Servings",
    "imageUrl": "8c1a1a96-fc91-4b7b-b60c-ef462c3bde5a.jpeg"
  },
  {
    "id": "33df0ef3-a1d6-4611-bcd1-6cbd675b2091",
    "name": "Japanese Duck",
    "description": "This Japanese Duck recipe features succulent duck breasts marinated in a flavorful blend of spices and served with a delicious nut and chilli sauce. The dish is accompanied by a colorful and vibrant mix of mango slices, long beans, baby sweetcorn, and mung beans, creating a well-balanced and visually appealing dinner option.",
    "ingredients": [
      "2 Duck breasts",
      "1 ts Coriander; ground",
      "1 ts Cumin; ground",
      "1 ts Cloves; ground",
      "1 ts Turmeric; ground",
      "1 Shallot finely chopped",
      "2 tb Vegetable oil",
      "2 oz Pecan nuts",
      "3 oz Brown sugar",
      "1 Red chilli finely diced",
      "2 tb Lemon juice",
      "2 tb Mixed pickling spice",
      "2 tb White wine vinegar",
      "2 tb Water",
      "Mango slices",
      "1 Long beans",
      "Baby sweetcorn",
      "Mung beans"
    ],
    "instructions": [
      "Make several incisions across the back of the duck",
      " Combine the coriander, cumin, cloves, turmaric, shallot and vegetable oil",
      " Rub over the duck and wrap lightly in plastic for 24 hours",
      " Once marinated, heat a little vegetable oil, in a hot pan and seal the meat, browning the fat",
      " Place into a pre-heated oven at 200C for around 9 minutes",
      " Prepare the sauce",
      " Combine the nuts, brown sugar, and chilli in a food processor",
      " Whirl to a medium texture",
      " Add the lemon juice and process until smooth",
      " Once the ducks are cooked, remove from the oven and the pan and leave to rest",
      " Place the pan back on to heat and add the pickling spice, water, white wine vinegar and bring to the boil",
      " Add the nut and chilli mix and boil, strain the sauce, carve the duck and present with a nest of long bean filled with mango, sweetcorn and mung beans"
    ],
    "type": "Dinner",
    "cuisine": "Japanese",
    "servings": "1 servings",
    "imageUrl": "33df0ef3-a1d6-4611-bcd1-6cbd675b2091.jpeg"
  },
  {
    "id": "a20dbc07-512c-48a5-944d-5646f5ec594a",
    "name": "Japanese Mesclun Salad",
    "description": "This Japanese Mesclun Salad is a light and refreshing dish perfect for a healthy lunch option. The combination of vinegar, olive oil, and seasonings creates a flavorful dressing that complements the fresh mesclun salad greens. It's a quick and easy recipe that is both nutritious and satisfying.",
    "ingredients": [
      "1 1/2 tb Vinegar; sugarcane, champagne,",
      "Or white-wine",
      "1 pn Brown sugar",
      "Coarse salt",
      "Freshly-ground black pepper",
      "2 tb Extra-virgin olive oil",
      "6 oz Mesclun salad greens"
    ],
    "instructions": [
      "In a large bowl, whisk together vinegar, brown sugar, salt, and pepper",
      " Whisk in olive oil, and adjust seasoning if necessary",
      " Add greens, and toss to coat thoroughly with dressing; your hands are the best tools for this job",
      " Serves 4",
      " Per serving: 60 Calories (kcal); 7g Total Fat; (99% calories from fat); 0g Protein; trace Carbohydrate; 0mg Cholesterol; trace Sodium Food Exchanges: 0 Grain(Starch); 0 Lean Meat; 0 Vegetable; 0 Fruit; 1 1/2 Fat; 0 Other Carbohydrates"
    ],
    "type": "Lunch",
    "cuisine": "Japanese",
    "servings": "4 servings",
    "imageUrl": "a20dbc07-512c-48a5-944d-5646f5ec594a.jpeg"
  },
  {
    "id": "ce11f731-dff8-4c9d-98db-657a04c2db67",
    "name": "Japanese Pear Salad",
    "description": "This Japanese Pear Salad is a refreshing and light appetizer that combines the sweetness of fresh pears with tangy vinegar and a variety of vegetables. It's a perfect starter to awaken your taste buds before a meal.",
    "ingredients": [
      "2 tb Rice vinegar; red wine vinegar or",
      "Balsamic vinegar",
      "2 tb Packed brown sugar",
      "2 Fresh USA Anjou or Bosc Pears; cored and sliced",
      "1/3 c Thinly sliced mushrooms",
      "1/4 c Thinly sliced green pepper and radishes",
      "4 Green Onion Brushes"
    ],
    "instructions": [
      "Combine vinegar and sugar; gently toss pears in mixture",
      " Allow to stand 30 minutes to 1 hour to blend flavors; stir occasionally",
      " Drain pears and arrange with vegetables on individual trays or plates",
      " Green Onion Brushes: Cut 3-inch piece off root ends of 4 green onions",
      " Cut three 1-inch lengthwise slashes through root end; rotate onion half-turn and make three more 1-inch lengthwise slashes",
      " Place in iced water",
      " Drain before using",
      " Makes 4 brushes",
      " Always be sure to use ripe pears",
      " Per serving: 27 Calories (kcal); 0g Total Fat; (0% calories from fat); 0g Protein; 7g Carbohydrate; 0mg Cholesterol; 3mg Sodium Food Exchanges: 0 Grain(Starch); 0 Lean Meat; 0 Vegetable; 0 Fruit; 0 Fat; 1/2 Other Carbohydrates"
    ],
    "type": "Appetizer",
    "cuisine": "Japanese",
    "servings": "4 servings",
    "imageUrl": "ce11f731-dff8-4c9d-98db-657a04c2db67.jpeg"
  },
  {
    "id": "54cae0cc-89d9-4f0b-b9ea-3d7d39214183",
    "name": "Japanese Prawn And Noodle Salad",
    "description": "A refreshing and flavorful Japanese salad dish featuring a delightful fusion of noodles, prawns, and a variety of vegetables dressed with rice vinegar, soy sauce, and ginger. Perfect for a light and satisfying lunch or as part of an oriental meal.",
    "ingredients": [
      "150 g Japanese noodles or Chinese noodles; cook according to pack instructions, rinse with cold water and drain",
      "2 tb Arame; (optional)",
      "4 tb Rice vinegar",
      "2 tb Soy sauce",
      "2 tb Sunflower oil",
      "2 Cloves garlic; crushed",
      "125 g Fine beans; cut in half lengthways (4oz)",
      "1 Red pepper; deseeded and cut into thin strips",
      "50 g Fresh root ginger; grated (2oz)",
      "25 g Sesame seeds; toasted (1oz)",
      "400 g Prawns; defrosted"
    ],
    "instructions": [
      "Place the cooked drained noodles in a salad dish and chill",
      " Put the arame in a small dish and pour over 2 tablespoons of boiling water, the rice vinegar and soy sauce",
      " Leave for 10 minutes",
      " Heat the sunflower oil in a wok and add the crushed garlic,stir fry for 1-2minutes and add the beans and red pepper",
      " Stir-fry for 4-5 minutes and allow to cool slightly",
      " Combine the vegetables with the noodles and stir in the arame (if arame is not used add the rice vinegar and soy sauce directly to noodles)",
      " Take the grated ginger and holding in one hand squeeze the juice over the salad and discard the pulp",
      " Stir the prawns into the noodles and combine well",
      " Chill for 30 minutes before serving",
      " Notes Delicious served as a light lunch or as part of an oriental meal",
      "Arame is an attractive seaweed used extensively in Japanese cooking",
      " NOTES : An oriental fusion of noodles and prawns dressed with rice vinegar and ginger"
    ],
    "type": "Lunch",
    "cuisine": "Japanese",
    "servings": "4 servings",
    "imageUrl": "54cae0cc-89d9-4f0b-b9ea-3d7d39214183.jpeg"
  },
  {
    "id": "86e65b88-2071-4c3c-9763-1160f280d1b0",
    "name": "Japanese Spring Rolls",
    "description": "These Japanese Spring Rolls are a delightful appetizer that combines the flavors of Japanese cuisine with a crispy and savory pastry shell filled with a mix of scallops, rock shrimp, mushrooms, and Japanese salad leaves. The dressing adds a tangy and savory touch, while the garnish of caviar and gold leaf elevates the presentation. Perfect for a special gathering or as a starter to a Japanese-inspired meal.",
    "ingredients": [
      "Garlic",
      "Black pepper",
      "Lemon juice",
      "Japanese soy sauce",
      "Grape seed oil",
      "Japanese salad leaves",
      "Mushrooms",
      "French pastry",
      "Scallops",
      "Rock shrimp"
    ],
    "instructions": [
      "First make the dressing",
      " Mix together the garlic, black pepper, lemon juice, Japanese soy sauce, blend together with grape seed oil and whisk with a blender",
      " Use very thin French pastry and cut into triangles",
      " Chop scallops and rock shrimp and add pepper",
      " Place Japanese salad leaves on to the pastry placing the shrimp on top and sliced mushrooms",
      " Fold tightly and deep fry for 2-3 minutes",
      " Make sure the oil is at least 190 degrees",
      " Place the dressing in a cocktail glass and place the two hariaki into the glass dipping into the dressing",
      " To garnish place caviar on to the spring rolls, decorate with gold leaf"
    ],
    "type": "Appetizer",
    "cuisine": "Japanese",
    "servings": "1 servings",
    "imageUrl": "86e65b88-2071-4c3c-9763-1160f280d1b0.jpeg"
  },
  {
    "id": "01517712-34ff-4520-aeb5-ef78b66cbc5b",
    "name": "Cha Gio (Vietnamese Spring Rolls)",
    "description": "Cha Gio, also known as Vietnamese Spring Rolls, are a popular appetizer in Vietnamese cuisine. These crispy and flavorful rolls are filled with a mixture of ground lean pork, crab meat, shrimp, and various seasonings, wrapped in rice paper, and deep-fried until golden brown. They are typically served with fresh herbs like lettuce, cilantro, and mint, along with a dipping sauce called nuoc cham. Enjoyed as a light and delicious starter, Vietnamese Spring Rolls are a delightful way to begin a meal.",
    "ingredients": [
      "2 oz Cellophane noodles",
      "1 lb Ground lean pork",
      "1 lg Onion",
      "2 tb Tree Ears dried mushroon (nam meo)",
      "3 Cloves garlic; finely chopped",
      "8 oz Crab meat",
      "4 oz Shrimp; shelled and chopped",
      "1/2 ts Pepper",
      "20 Sheets dried rice paper (banh trang)",
      "4 Eggs; beaten",
      "2 c Peanut oil"
    ],
    "instructions": [
      "Soak Tree Ear in warm water for 30 minutes, drain and finely chop",
      " Combine the filling ingredients in a bowl and set aside",
      " Cut a round rice paper sheet into quarters",
      " Place the cut rice paper on a flat surface",
      " With a pastry brush, paint beaten egg over the entire surface of the rice paper piece",
      " Before filling, wait for the egg mixture to take effect, softening the wrappers; this take about 2 minutes",
      " When you become adept at this, you can work on several wrappers at a time",
      " When the wrapper looks soft and transparent, place about one teaspoon of filling near the curved side, in the shape of a rectangle",
      " Fold the side over to enclose the filling and continue to roll",
      " After filling all the wrappers, pour the oil into a large frying pan, put the spring rolls into the cold oil, turn the heat to moderate, and fry for 20 to 30 minutes until a lovely golden brown",
      " (This is a special method of keeping spring rolls crisp",
      ") Serving Ideas : Serve with lettuce, cilantro, mint and nuoc cham NOTES : The Vietnamese spring rolls are much smaller and more crisp than the Chinese version",
      " Unlike the Chinese spring rolls, they can be rolled in the morning, then covered and refrigerated for several hours before cooking",
      " After cooking they will keep nice and crisp in 150-degree oven for up to 3 hours",
      " BTW you can substitute shrimp and crabmeat with more ground pork or chicken if you don't like seafood",
      " MASTERCOOK RECIPES LIST SERVER"
    ],
    "type": "Appetizer",
    "cuisine": "Vietnamese",
    "servings": "20 Servings",
    "imageUrl": "01517712-34ff-4520-aeb5-ef78b66cbc5b.jpeg"
  },
  {
    "id": "c5f10f0c-c6ea-4020-9822-335f401c5913",
    "name": "Vietnamese Barbecued Duck Breast",
    "description": "This Vietnamese Barbecued Duck Breast recipe features tender duck breasts marinated in a flavorful mixture of oil, vinegar, garlic, ginger, and dried chile peppers. The marinated duck breasts are then grilled to perfection, resulting in a delicious and aromatic dish that pairs well with rice. Perfect for a special dinner occasion or a culinary adventure at home.",
    "ingredients": [
      "4 Duck breasts; deboned and skinned",
      "2 tb Oil",
      "4 tb Vinegar",
      "1 Clove garlic; minced",
      "1 sl (1/2-inch) ginger root; crumbled",
      "1/2 ts Dried chile peppers or more"
    ],
    "instructions": [
      "Cut the breasts away from the bird and marinade at least two days in the other ingredients",
      " The peppers can be increased up to 2 tsp according to taste",
      " Drain breasts and grill over charcoal/gas, brushing on extra marinade as required",
      " Serve with rice",
      " MEAL-MASTER RECIPES LISTSERVER"
    ],
    "type": "Dinner",
    "cuisine": "Vietnamese",
    "servings": "2 Servings",
    "imageUrl": "c5f10f0c-c6ea-4020-9822-335f401c5913.jpeg"
  },
  {
    "id": "9e40f86e-f201-4442-9a5e-7fcc954b78a7",
    "name": "Vietnamese Bbq Duck Breast",
    "description": "Vietnamese BBQ Duck Breast is a flavorful and aromatic dish that combines the richness of duck with the vibrant flavors of garlic, ginger, and chile peppers. The marinade infuses the duck with a tangy and spicy kick, creating a succulent and tender meat. This meal is perfect for a special dinner or a festive gathering, offering a taste of Vietnamese cuisine with a barbecue twist.",
    "ingredients": [
      "4 Duck breasts, deboned and skinned",
      "2 tb Oil",
      "4 tb Vinegar",
      "1 Clove garlic, minced",
      "1/2 Inch chunk ginger root, crumbled",
      "1/2 ts Dried chile peppers or more"
    ],
    "instructions": [
      "This recipe is equally good with wild duck, partridge or ptarmigan",
      " Cut the breasts away from the bird and marinade at least two days in the other ingredients",
      " The peppers can be increased up to 2 tsp according to taste",
      " Drain breasts and grill over charcoal/gas, brushing on extra marinade as required",
      " Serve with rice"
    ],
    "type": "Dinner",
    "cuisine": "Vietnamese",
    "servings": "2 Servings",
    "imageUrl": "9e40f86e-f201-4442-9a5e-7fcc954b78a7.jpeg"
  },
  {
    "id": "ee8347f8-f4fc-40e6-af5c-0a57c5fd26fd",
    "name": "Vietnamese Chicken Salad (Goi-Ga)",
    "description": "This Vietnamese Chicken Salad, also known as Goi-Ga, is a refreshing and flavorful dish that combines shredded cabbage, mint leaves, cooked chicken, and a zesty dressing. It's a light and healthy salad with a perfect balance of textures and flavors. The dressing with garlic, sugar, and vinegar or lime juice adds a tangy kick to the salad. Enjoy this salad as a light and satisfying meal for lunch or dinner.",
    "ingredients": [
      ""
    ],
    "instructions": [
      "1 lb Shredded head cabbage 1 Bunch mint leaves 2 lb Chicken breast, cook 1 Small onion, thinly sliced 1 Sm",
      " carrot 1 Dressing: 1 ts Sugar 1 tb Oil 2 Cloves garlic, mashe 1/4 c Rice vinegar or lime juice 1 Chopped red chili to taste Wash and de-stem mint leaves",
      " Cut carrot in matchsticks",
      " Shred the cooked chicken meat",
      " In a large bowl, combine chicken with vegetables and mint leaves",
      " Mix dressing ingredients together well",
      " Pour dressing over and let stand 10 minutes before serving",
      " From Doreen Otsuka"
    ],
    "type": "Lunch",
    "cuisine": "Vietnamese",
    "servings": "6 Servings",
    "imageUrl": "ee8347f8-f4fc-40e6-af5c-0a57c5fd26fd.jpeg"
  },
  {
    "id": "1e831a54-4269-46b5-8936-32403d482bd7",
    "name": "Vietnamese Chicken Salad with Hot Tahini Sauce",
    "description": "This Vietnamese Chicken Salad with Hot Tahini Sauce is a flavorful and spicy dish that combines tender chicken strips with crunchy vegetables like bok choy, carrots, and green onions. The hot tahini sauce adds a kick of heat and richness to the salad, making it a satisfying and vibrant lunch option. Serve this salad with the spicy dressing on the side for a customizable heat level.",
    "ingredients": [
      "Bonnie Bracey",
      "8 Green onions -- julienned",
      "GRWP92A",
      "1 sm Carrot -- julienned",
      "2 Chicken breasts -- whole",
      "5 c Bok choy -- shredded",
      "Skin removed",
      "2 tb Peanuts",
      "DRESSING-----",
      "1/4 c Tahini",
      "3 tb Red wine vinegar",
      "1 1/2 tb Chinese Hot Oil",
      "2 ts Sugar",
      "3 tb Soy sauce",
      "1 Garlic clove -- minced",
      "1/4 c Peanut oil"
    ],
    "instructions": [
      "Cook the chicken",
      " Cool and cut into thin strips",
      " Cut onions and carrot into thin julienned strips",
      " Mix chicken, onions, carrots and bok choy",
      " Sprinkle peanuts on top",
      " For the dressing, beat tea into tahini in a small bowl then mix in all the remaining dressing ingredients",
      " Serve salad with the dressing on the side",
      " Dressing is very spicy",
      " ^^^^^^^^^^ This is a wonderful spicy dressing and it is best served on the side so that diners can adjust the heat level to their own preference",
      " : "
    ],
    "type": "Lunch",
    "cuisine": "Vietnamese",
    "servings": "6 Servings",
    "imageUrl": "1e831a54-4269-46b5-8936-32403d482bd7.jpeg"
  },
  {
    "id": "643e0069-53c4-4c91-b477-3e8897f2dd31",
    "name": "Vietnamese Chicken Salad with Tahini Sauce",
    "description": "Vietnamese Chicken Salad with Tahini Sauce is a flavorful and spicy dish that combines tender chicken strips with crunchy vegetables like green onions, carrot, and bok choy. The dressing, made with tahini, Chinese hot oil, soy sauce, and other ingredients, adds a spicy kick to the salad. Served with peanuts on top, this salad is a satisfying and delicious option for a light lunch or dinner.",
    "ingredients": [
      ""
    ],
    "instructions": [
      "2 Whole chicken breasts -skin removed 6 To ten green onions 1 Small carrot 4 To six c shredded Bok Choy 2 To three tbsps of peanuts DRESSING: 1/4 c Tahini 1 To two T Chinese Hot Oil 3 tb Soy sauce 1/4 c Of Peanut Oil 3 tb Of red wine vinegar 2 ts Of sugar 1 Garlic clove, minced This is a wonderful spicy dressing and it is served o the side so that diners can adjust the heat level to their own preference",
      " Cook the chicken",
      " Cool and cut into thin strips",
      " Cut onions and carrot into thin strips",
      " Mix chicken, onions, carrots and bok choy",
      " Sprinkle peanuts on top",
      " For the dressing, beat tea into tahini in a small bowl then mix in all the remaining dressing ingredients",
      " Serve salad with the dressing on the side",
      " Dressing is very spicy",
      " Makes 6 servings"
    ],
    "type": "Lunch or Dinner",
    "cuisine": "Vietnamese",
    "servings": "6 Servings",
    "imageUrl": "643e0069-53c4-4c91-b477-3e8897f2dd31.jpeg"
  },
  {
    "id": "08598075-d3b0-4aed-a831-e806ece8afbe",
    "name": "Vietnamese Chili Sauce (Dip)",
    "description": "A flavorful and spicy Vietnamese chili sauce that serves as a delicious dip for chicken or other dishes. This sauce has a perfect balance of heat, sourness, and umami from the fish sauce.",
    "ingredients": [
      "2 Dried red chilies",
      "2 Cloves garlic",
      "1/2 ts Sugar",
      "2 tb Fish sauce",
      "1 tb Vinegar",
      "1 tb Lemon juice"
    ],
    "instructions": [
      "Mince chilies and garlic finely and place in a mortar",
      " Mash with the heel of a cleaver or pestle",
      " Add sugar and stir until it dissolves",
      " Add fish sauce, vinegar and lemon juice, stirring between each addition",
      " This makes enough for 2 to 4 people",
      " I almost always double the recipe just to make sure there's enough",
      " I've kept it for long periods of time but unless you freeze it, it's past it's prime after a few days",
      " This is a basic chili sauce used for a dip for chicken or whatever",
      " Variations of this are found in Cambodia, Thailand and other Southeast Asian countries",
      " You can fiddle with it endlessly",
      " This is a good starting point",
      " The proportions shown here produce what I consider a mildly warm dip",
      " I generally use two to six times as many chilies, depending on their strength and how hot I want it",
      " Variations: use green serrano chilies instead of dried red ones, lime juice instead of the lemon juice or palm sugar instead of granulated",
      " If you make it in a food processor, don't over process",
      " It should have small chunks of each ingredient rather than being a homogeneous liquid",
      " The taste is sour and hot, very puckery",
      " It's great with poached or steamed chicken, duck or game hens",
      " Much better with basically bland dishes rather than something like curry which has it's own blend of spices",
      " Good with Chinese white-cut chicken or Steamed Ginger Chicken with Black Bean sauce",
      " It's truly addictive and I often serve it with meals that are not Oriental in origin",
      " Should be good with a firm- fleshed white fish or boiled shrimp or crab",
      " Fish sauce is a liquid made with anchovies and salt",
      " It's not really fishy tasting",
      " Look for it in the oriental section of supermarkets or at markets catering to Asian clientele",
      " Tiparos is a good brand made in the Philippines",
      " I prefer Thai or Vietnamese fish sauce, but they'll probably be harder to find",
      " Chinese fish sauce is NOT a substitute"
    ],
    "type": "Snack",
    "cuisine": "Vietnamese",
    "servings": "1 Batch",
    "imageUrl": "08598075-d3b0-4aed-a831-e806ece8afbe.jpeg"
  },
  {
    "id": "0f14675a-533d-4816-991e-1cbfb0d5f457",
    "name": "Vietnamese Coffee",
    "description": "Vietnamese Coffee is a traditional and popular drink in Vietnam. It is a sweet and strong coffee beverage that is perfect for a quick pick-me-up or a relaxing break during the day. The combination of dark-roast coffee and sweetened condensed milk creates a unique and delightful flavor that is enjoyed by coffee enthusiasts worldwide.",
    "ingredients": [
      "Stephen Ceideburg",
      "2 tb Sweetened Condensed Milk",
      "6 oz Strong Black Coffee"
    ],
    "instructions": [
      "In restaurants and cafe, dark-roast coffee is brewed in an individual drip pot that sits on top of a glass, slowly dripping into sweet milk",
      " it takes a good 10 to 15 minutes for the water to finish dripping through, and the coffee is sipped at an equally leisurely pace",
      " Both the coffee and the pots are available in Southeast Asian markets, but any type of coffee and any brew- method that produces a strong, rich-tasting cup will do",
      " Place the milk in the bottom of an 8 ounce glass",
      " Carefully pour in coffee, trying not to disturb the layer of milk",
      " Stir milk up from bottom and sip coffee",
      " There will probably be some milk left in the bottom of the glass when you are finished",
      " Makes 1 serving",
      " Variation: This coffee may also be served iced",
      " Add ice cubes on top of the sweet milk and proceed as above"
    ],
    "type": "Snack",
    "cuisine": "Vietnamese",
    "servings": "1 Servings",
    "imageUrl": "0f14675a-533d-4816-991e-1cbfb0d5f457.jpeg"
  },
  {
    "id": "c38d7ea5-4bc0-4ef8-9044-03130e2b3bfc",
    "name": "Vietnamese Corn Chowder with Crab (Chao Bap Voi Cua)",
    "description": "A delicious and hearty Vietnamese corn chowder with crab, known as Chao Bap Voi Cua, that combines the sweetness of corn with the savory flavors of crab in a creamy and flavorful broth. This soup is perfect for a comforting and satisfying lunch.",
    "ingredients": [
      "4 c Chicken stock",
      "2 c Creamed corn",
      "1 c Corn kernels",
      "1 c Crab; flaked",
      "1 tb Corn starch",
      "2 Eggs",
      "1/4 c Green onion; thinly sliced"
    ],
    "instructions": [
      "1",
      " Break eggs into a bowl and whisk with a fork",
      " 2",
      " Bring stock to a boil, add creamed corn, corn kernels and crab, return to boil",
      " Mix corn starch with a bit of cold water and add gradually to soup to thicken",
      " Dribble eggs into soup in thin stream while stirring constantly to produce egg threads",
      " 3",
      " Serve garnished with green onion"
    ],
    "type": "Lunch",
    "cuisine": "Vietnamese",
    "servings": "8 Servings",
    "imageUrl": "c38d7ea5-4bc0-4ef8-9044-03130e2b3bfc.jpeg"
  },
  {
    "id": "acddf28e-8dd2-40e7-939d-0afebe9eb64c",
    "name": "Vietnamese Crab Spring Rolls",
    "description": "Vietnamese Crab Spring Rolls are a delightful appetizer featuring a flavorful filling of ground pork, crab meat, vegetables, and noodles wrapped in rice paper and deep-fried until crispy and golden brown. These spring rolls are served with fresh herbs and lettuce, providing a refreshing and satisfying start to a meal.",
    "ingredients": [
      "2 oz Dried bean thread noodles (MUNG bean)",
      "3 tb Sm. dried tree-ear mushrooms",
      "1 lb Ground pork butt",
      "4 Garlic cloves finely minced or pureed",
      "1 tb Fish sauce",
      "1/2 ts Fresh finely ground pepper",
      "1 c Flaked crab meat",
      "1 c Grated carrot",
      "1 c Bean sprouts; tails removed",
      "4 Shallots; minced OR Onion",
      "2 c Warm water",
      "1/4 c Sugar",
      "16 12\" rice paper wrappers (dried)",
      "Peanut oil for deep-frying",
      "Lettuce leaves",
      "Fresh mint",
      "Fresh coriander leaves"
    ],
    "instructions": [
      "IN SEPARATE MEDIUM BOWLS, soak the mung bean noodles and tree-ear mushrooms with water until soft and pliable",
      " Drain the noodles and cut into shorter lengths; set aside",
      " Remove the hard centers from the mushrooms, coarsely chop and set aside",
      " In a medium bowl, combine the pork, garlic, fish sauce and ground pepper",
      " Mix in crab meat, tree-ear mushrooms, carrots, bean sprouts, shallots and bean thread noodles; set aside",
      " Combine the warm water and sugar in a bowl",
      " Lay 1 rice paper wrapper on a damp towel",
      " (Keep unused wrappers in their package",
      ") Generously brush it with the sugar water; allow it to soften to a very pliable wrapper, about 30 seconds or sometime longer (depending upon the brand)",
      " With your hands shape 3 tablespoons filling into a tight compact 1-inch-wide-by-4-to-5-inch-long cylinder",
      " Place cylinder along the lower edge of wrapper",
      " Roll the bottom up and over the roll tightly",
      " Fold both outside edges inward to enclose the ends",
      " Continue rolling up into a cylinder; set aside covered with plastic wrap",
      " Repeat until all the rolls are done",
      " To cook and brown evenly, the roll must be firm and evenly packed",
      " If the wrapper has a tear, bandage it with a softened rice-paper remnant",
      " In a preheated wok or saucepan, add oil to a depth of 2 inches and heat to 325F",
      " Add a few rolls at a time, but do not crowd",
      " Fry for 10 seconds",
      " Immediately increase to high heat or 375F",
      " Fry, turning occasionally until golden brown, about 6 to 8 minutes",
      " Remove and drain on paper towel",
      " Cut crosswise into 1+1/2-inch pieces",
      " Arrange rolls on a plate lined with lettuce",
      " On another plate, arrange leaves of lettuce, fresh coriander and mint leaves",
      " To eat, wrap spring-roll garnish with sprig of coriander and mint leaves in a lettuce leaf and dip into nuoc cham sauce (See RECIPE)"
    ],
    "type": "Appetizer",
    "cuisine": "Vietnamese",
    "servings": "16 Servings",
    "imageUrl": "acddf28e-8dd2-40e7-939d-0afebe9eb64c.jpeg"
  },
  {
    "id": "0c5f1d89-48dc-4f3b-8dd2-f4503c130196",
    "name": "Halkoum (Turkish Delight)",
    "description": "A traditional Turkish sweet treat known for its chewy and fragrant texture, flavored with orange blossom water or rose water, and garnished with chopped nuts. It is a delightful confection that is enjoyed as a dessert or snack.",
    "ingredients": [
      "1 lb Glucose",
      "5 1/2 lb Granulated sugar",
      "3/4 lb Cornstarch",
      "1 Lemon; juice of",
      "1 ts Pulverized mastic",
      "3 dr Food coloring; if desired, more or less",
      "3 tb Orange blossom water or rose water (up to)",
      "4 oz Almonds or pistachios; chopped",
      "Cornstarch to dust the tray",
      "Powdered sugar"
    ],
    "instructions": [
      "Bring to a boil again, and cook, uncovered, over a constant low flame for 3 hours, stirring as often as possible with a wooden spoon",
      " If the flame is too high, the bottom of the mixture will tend to carmelize",
      " The mixture must be cooked until it reaches the right consistency",
      " THis takes about 3 hours, and on this depends the success of the recipe",
      " To test the consistency, squeeze a small blob of the mixture between two fingers",
      " Only when it clings to both fingers as they are drawn apart, making gummed threads, is it ready",
      " It may then have acquired a warm golden color",
      " Add the lemon juice and the flavorings",
      " THe mastic should be ground with a little granulated sugar to be successfully pulverized",
      " Add coloring if you wish",
      " Stir vigorously and cook a few minutes longer",
      " Add the chopped nuts and mix well",
      " Pour the hot mixture out about 1 inch deep into trays that have been dusted with cornstarch to prevent sticking",
      " Flatten it with a knife and leave it to set for at least 24 hours",
      " THen cut into squares with a sharp knife, and roll in sifted powdered sugar",
      " The Halkoum will keep for a long time packed in a box",
      " From \"A Book of Middle Eastern Food\" by Claudia Roden /CANDY"
    ],
    "type": "Dessert",
    "cuisine": "Turkish",
    "servings": "64 Servings",
    "imageUrl": "0c5f1d89-48dc-4f3b-8dd2-f4503c130196.jpeg"
  },
  {
    "id": "135577a6-96ca-4f12-98be-145c495a5277",
    "name": "Sebze Bastisi (Vegetable Stew - Turkish)",
    "description": "Sebze Bastisi is a delicious and hearty vegetable stew made with eggplant, zucchini, green peppers, and string beans, cooked in a flavorful broth and garnished with parsley. This traditional Turkish dish is a perfect main course for lunch or dinner, offering a nutritious and satisfying meal.",
    "ingredients": [
      "1 Med. eggplant (about 1 lb)",
      "4 tb Butter or olive oil",
      "2 Onions; sliced",
      "2 Green peppers *",
      "2 Zucchini; sliced 1/4\" thick",
      "1 c String beans; in 1 1/2\" pcs",
      "2 Garlic cloves; crushed",
      "2 tb Chopped parsley",
      "1/2 ts Sugar",
      "Salt",
      "Freshly ground pepper",
      "1 c Beef broth",
      "2 tb Chopped parsley for garnish"
    ],
    "instructions": [
      "*Note: Green peppers should be seeded and cut into strips",
      " Cut eggplant into 1/4\" slices, sprinkle with salt and set aside for 30 min",
      " Wash off salt, drain and pat dry with paper towels",
      " Heat 2 T",
      " butter in a skillet",
      " Add the eggplant slices and fry until browned on both sides",
      " Transfer to a baking dish",
      " Fry the onions and peppers in the remaining butter for 3 min",
      " Add the zucchini and beans and fry for 2 more min, stirring frequently",
      " Place the veggies on top of the eggplant",
      " Add garlic, parsley, sugar, pepper salt, and beef broth",
      " Cover and place in a 350 oven for 1 hour",
      " Garnish with parsley and serve hot"
    ],
    "type": "Main Course",
    "cuisine": "Turkish",
    "servings": "4 Servings",
    "imageUrl": "135577a6-96ca-4f12-98be-145c495a5277.jpeg"
  },
  {
    "id": "e0a9bd65-76db-4793-9c5b-b2784a046899",
    "name": "Red Lentil Soup (Turkish)",
    "description": "This Turkish Red Lentil Soup is a hearty and comforting dish made with red lentils, meat stock, onions, and a creamy egg yolk mixture. It is a flavorful soup with a velvety texture, perfect for a satisfying dinner. Serve it with crispy bread cubes for a delicious meal.",
    "ingredients": [
      "1 1/2 c Red lentils",
      "8 c Meat stock",
      "2 md Size onions",
      "2 tb Butter",
      "1/2 tb Flour",
      "1 c Milk",
      "3 Egg yolks",
      "1 tb Salt",
      "1/2 ts Black pepper",
      "6 Slices of bread",
      "2 tb Oil"
    ],
    "instructions": [
      "1- Wash the lentils",
      " Put them in meat stock and 1 cup of water",
      " Cook for 35-40 minutes until they are tender",
      " Pass them through a sieve",
      " 2- Melt the butter in anothe saucepan",
      " Add chopped onions and fry them lightly for 7-8 minutes",
      " Add flour",
      " Brown for 1 minute more",
      " Add them to the meat stock with the lentil puree",
      " Add slat and pepper and let simmer",
      " 3- Beat the egg yolks with cold milk",
      " Add to the boiling soup, mix well",
      " Turn the heat off as soon as it starts boiling",
      " Serve with bread cubes fried in oil"
    ],
    "type": "Dinner",
    "cuisine": "Turkish",
    "servings": "1 Servings",
    "imageUrl": "e0a9bd65-76db-4793-9c5b-b2784a046899.jpeg"
  },
  {
    "id": "47817540-1906-4d94-89fe-721559681a8f",
    "name": "Red Lentil Soup with Rice (Turkish)",
    "description": "This Turkish Red Lentil Soup with Rice is a hearty and comforting dish that is perfect for a cold day. The soup is packed with protein from the red lentils and rice, making it a satisfying and nutritious meal. The addition of onions, potatoes, and paprika adds depth and flavor to the soup, creating a delicious and warming bowl of goodness. Serve this soup with crusty bread for a complete and filling meal.",
    "ingredients": [
      "1 c Red lentils",
      "2 md Size onions",
      "1 md Size potato",
      "2 tb Rice",
      "1 l Meat stock or water",
      "2 tb Butter",
      "Salt, paprika"
    ],
    "instructions": [
      "1- Wash lentils and the rice",
      " Add the peeled and chopped onions and tomatoes , peeled potato cut into very small cubes and the meat stock",
      " Cover and cook on low heat for 45 minutes",
      " Pass them through a sieve",
      " 2- Melt the butter in another saucepan",
      " Add paprika and pour over the soup"
    ],
    "type": "Lunch or Dinner",
    "cuisine": "Turkish",
    "servings": "1 Servings",
    "imageUrl": "47817540-1906-4d94-89fe-721559681a8f.jpeg"
  },
  {
    "id": "1c6a1342-795e-471e-8f05-9aade7cd5fa2",
    "name": "Lokum (Turkish Delight)",
    "description": "Lokum, also known as Turkish Delight, is a sweet and chewy confection that is flavored with rose water and colored with a hint of pink. It is typically enjoyed as a delightful dessert or sweet treat.",
    "ingredients": [
      "4 c Granulated sugar",
      "4 1/2 c Water",
      "1 ts Lemon juice",
      "1 c Cornflour (cornstarch)",
      "1 ts Cream of tartar",
      "1 tb Rose water (may be doubled)",
      "Red food coloring",
      "1/2 c Chopped; toasted almonds",
      "3/4 c Confectioners' sugar",
      "1/4 c Cornflour (cornstarch)"
    ],
    "instructions": [
      "Bring to the boil and boil to soft ball stage 115 C (240 F) on a candy thermometer",
      " Remove from heat",
      " In another thick-based pan blend cornflour, cream of tartar and 1 cup cold water until smooth",
      " Boil remaining 2 cups water and stir into cornflour mixture, then place over low heat",
      " Stir constantly until mixture thickens and bubbles",
      " Use a balloon whisk if lumps form",
      " Pour hot syrup gradually into cornflour mixture, stirring constantly",
      " Bring to the boil and gently for 1-1/4 hours",
      " Stir occasionally with a wooden spoon and cook until mixture is a pale golden colour",
      " Stirring is essential",
      " Stir in rose water to taste and a few drops of red food colouring to tinge it pale pink",
      " Blend in nuts if used, and remove from heat",
      " Pour into an oiled 23 cm (9 inch) square cake tin and leave for 12 hours to set",
      " Combine confectioners' sugar and the 1/4 cup cornflour in a flat dish",
      " Cut Turkish Delight into squares with an oiled knife and toss in sugar mixture",
      " Store in a sealed container with remaining sugar mixture sprinkled between layers",
      " VARIATIONS: Creme de Menthe Lokum: Replace rose water and red food colouring with 2 tablespoons Creme de Menthe liqueur and a little green food colouring",
      " Omit nuts",
      " Orange Lokum: Use 1-2 tablespoons orange flower water instead of rose water; use orange food colouring",
      " Vanilla Lokum: Use 2 teaspoons vanilla essence instead of rose water and colouring, stir in 1/2 cup toasted chopped almonds or chopped walnuts",
      " Do not blanch almonds",
      " MEAL-MASTER RECIPES LIST SERVER"
    ],
    "type": "Dessert",
    "cuisine": "Turkish",
    "servings": "16 Servings",
    "imageUrl": "1c6a1342-795e-471e-8f05-9aade7cd5fa2.jpeg"
  },
  {
    "id": "ad6eb41d-a31c-4a92-bc6e-f5dfe66ec976",
    "name": "Stuffed Zucchini, Turkish Style",
    "description": "Stuffed Zucchini, Turkish Style is a flavorful and hearty dish where zucchini halves are filled with a delicious mixture of cheeses, herbs, and spices. This meal is perfect for dinner, offering a satisfying and nutritious option with a Turkish twist.",
    "ingredients": [
      "4 md Zucchini, halved lengthwise",
      "3 tb Butter",
      "3/4 c Finely minced onion",
      "3 cl Crushed garlic",
      "3 Beaten eggs",
      "1/2 c Crumbled feta cheese",
      "3/4 c Grated Swiss cheese",
      "2 tb Freshly chopped parsley",
      "1 tb Fresh, chopped dill (or 3/4",
      "Tsp. dried dill weed)",
      "1 1/2 tb Flour",
      "Salt and pepper to taste",
      "Paprika for the top"
    ],
    "instructions": [
      "Scoop out the insides of the zucchini to leave a 1/2\" rim",
      " Chop the innards into little bits and cook in butter with onions, garlic, salt and pepper until onions are soft",
      " Combine with flour, cheeses, herbs and beaten eggs",
      " Correct salt and pepper",
      " Fill the zucchini cavities and dust the tops with paprika",
      " Bake at 375 for 30 min",
      " or until the filling soldifies",
      " Serve with a fresh tomato salad"
    ],
    "type": "Dinner",
    "cuisine": "Turkish",
    "servings": "4 Servings",
    "imageUrl": "ad6eb41d-a31c-4a92-bc6e-f5dfe66ec976.jpeg"
  },
  {
    "id": "9f8d0735-6374-4383-8da8-d9dab27c879a",
    "name": "Simit (Turkish Croissant with Sesame Seeds)",
    "description": "Simit is a traditional Turkish snack that resembles a croissant with sesame seeds. It is a delicious pastry that is perfect for a light snack or a tea-time treat.",
    "ingredients": [
      "8 oz Flour",
      "1/2 ts Salt",
      "2 oz Margarine",
      "1 tb Olive oil",
      "1 tb Milk, plus extra",
      "1 tb Water",
      "1 Egg",
      "Sesame seeds"
    ],
    "instructions": [
      "Put the flour and salt in a large bowl and make a hole in the middle",
      " Into this hole pour the melted marg, olive oil, milk, water and beaten egg",
      " Stirring from the outside into the middle gradually mix all the liquids into the flour until you have a dough",
      " It will feel a bit oily, but is quite manageable",
      " With floured hands shape the dough into rings about the diameter of a saucer and arrange them on a baking sheet",
      " Brush them over with milk and sprinkle the sesame seeds on them",
      " Bake them in a 400 degree oven for approx",
      " 30 min",
      " or until they are nicely browned"
    ],
    "type": "Snack",
    "cuisine": "Turkish",
    "servings": "1 Servings",
    "imageUrl": "9f8d0735-6374-4383-8da8-d9dab27c879a.jpeg"
  },
  {
    "id": "1dfd5a5c-17ed-4ac0-896a-bb2def881a42",
    "name": "Cold Turkish Green Tomato Soup",
    "description": "A refreshing and vibrant Cold Turkish Green Tomato Soup perfect for a light and cool lunch option. This soup is packed with the flavors of green tomatoes, yogurt, bell pepper, and dill, topped with a sprinkle of feta cheese for a delightful finish.",
    "ingredients": [
      "3 lb Green tomatoes; seeded, chopped",
      "2 c Chicken broth",
      "1/4 c Plain yogurt",
      "1 sm Red bell pepper; cut into matchsticks",
      "1/4 c Packed fresh dill sprigs minus tough; washed well, stems",
      "Spun dry; and chopped",
      "Crumbled feta; for garnish"
    ],
    "instructions": [
      "In a large saucepan simmer tomatoes in broth 6 minutes",
      " In a blender puree tomato mixture with yogurt in small batches until smooth and season with salt and pepper",
      " Cool soup completely",
      " Chill soup, covered, until cold, about 2 hours",
      " Season soup with salt and pepper and top with bell pepper and dill",
      " Garnish soup with feta",
      " This recipe yields approximately 7 cups",
      " Per serving: 68 Calories (kcal); 1g Total Fat; (13% calories from fat); 4g Protein; 12g Carbohydrate; 1mg Cholesterol; 248mg Sodium Food Exchanges: 0 Grain(Starch); 0 Lean Meat; 2 Vegetable; 0 Fruit; 0 Fat; 0 Other Carbohydrates"
    ],
    "type": "Lunch",
    "cuisine": "Turkish",
    "servings": "7 servings",
    "imageUrl": "1dfd5a5c-17ed-4ac0-896a-bb2def881a42.jpeg"
  },
  {
    "id": "b70692df-30e9-4e9d-a0b7-39280d355232",
    "name": "Menemen (Turkish Scrambled Eggs)",
    "description": "Menemen is a traditional Turkish breakfast dish consisting of scrambled eggs cooked with tomatoes, peppers, and onions. The combination of flavors from the fresh vegetables and spices creates a delicious and hearty meal that is perfect for starting the day. Serve the Menemen on warm Turkish bread for an authentic experience.",
    "ingredients": [
      "1 Onion",
      "4 Tomatoes",
      "4 Green hot peppers",
      "5 tb Butter",
      "8 Eggs",
      "Salt",
      "Pepper",
      "1 ts Mild paprika powder"
    ],
    "instructions": [
      "Chop the onion finely",
      " Cut a cross in the top of the tomatoes and put them in hot water",
      " Remove the skins",
      " Cut the tomatoes into small pieces",
      " Wash the peppers and cut them into very small rings",
      " Heat the butter in a big skillet",
      " Sautee the onion until soft, then add peppers and tomatoes and fry for another 2 to 3 minutes",
      " Beat the eggs with salt and pepper and paprika powder",
      " Pour mixture over vegetables",
      " Keep stirring with a fork until set",
      " (Serve on nice fresh homemade or -of course- Turkish bread) Be careful with the peppers",
      " Peppers used here are the Turkish kind, a cross between parika's and hot peppers",
      " Remove the seeds to make them less hot"
    ],
    "type": "Breakfast",
    "cuisine": "Turkish",
    "servings": "4 Servings",
    "imageUrl": "b70692df-30e9-4e9d-a0b7-39280d355232.jpeg"
  },
  {
    "id": "738c6be6-d2fa-4f7c-813b-dc6471972372",
    "name": "Grilled Fish in Turkish Marinade of Yogurt, Coriander,",
    "description": "Grilled Fish in Turkish Marinade of Yogurt and Coriander is a flavorful and easy-to-make dish that combines the tenderness of yogurt with the exotic spices of cardamom and coriander. This dish is perfect for a busy day when you crave a burst of flavor but have limited time to cook. The marinade not only enhances the moisture and taste of the fish but also provides a delightful balance of tartness and sweetness. Serve the grilled fish with a garnish of chopped dill and a lemon wedge for a refreshing and satisfying dinner.",
    "ingredients": [
      "1 c Nonfat or low-fat yogurt",
      "1 tb Ground coriander",
      "1/2 tb Ground cardamom",
      "1 ts Freshly ground black pepper",
      "1 ts Salt",
      "3 tb Fresh lemon juice",
      "6 5- to 6-ounce fillets of a firm whitefish, such as cod, halibut, flounder, sea bass, or swordfish",
      "2 tb Chopped dill (optional) for garnish"
    ],
    "instructions": [
      "(",
      "",
      "",
      " grilled fish in a simple yogurt marinade that makes an enormous difference in moisture and flavor, with the easily obtained but slightly exotic spices cardamom and coriander, common in Turkey",
      "CORBY) As the Turks, Greeks, and Indians know, yogurt makes a great marinade for fish or chicken",
      " It tenderizes as it seasons, and provides a tart balance for the sweet spices",
      " This is an ideal dish for a busy day when you have a great desire for flavor but little time to cook",
      " Combine all of the ingredients and marinate the fish fillets for 3 to 6 hours",
      " Preheat the broiler or make a charcoal fire",
      " Wipe off excess marinade, brush the fish lightly with oil, and sprinkle with salt and pepper",
      " Broil or grill for about 4 minutes per side",
      " Garnish with chopped dill, if desired, and serve with a lemon wedge",
      " You may also cook the fish on a lightly oiled baking sheet in a 400 degree oven for about 12 minutes, or until done"
    ],
    "type": "Dinner",
    "cuisine": "Turkish",
    "servings": "6 Servings",
    "imageUrl": "738c6be6-d2fa-4f7c-813b-dc6471972372.jpeg"
  },
  {
    "id": "ccdc350b-cc79-422a-9598-74f05c419388",
    "name": "Nyonya (Malaysian) Fried Rice - 2nd Princess Beeling Ong",
    "description": "Nyonya Fried Rice is a flavorful and aromatic dish that combines cooked rice with eggs, dried shrimp, mixed vegetables, and mushrooms, seasoned with a blend of spices and served on a bed of shredded lettuce. It offers a harmonious balance of textures and flavors, making it a popular choice for a satisfying lunch.",
    "ingredients": [
      "5 tb Salad oil",
      "3 Eggs; beaten",
      "1 sm Onion; thinly sliced",
      "1/2 c Chopped dried shrimp",
      "4 c Cooked rice",
      "1 c Frozen mixed vegetables; thawed",
      "1 cn (4 oz) sliced mushrooms; drained",
      "Salt to taste",
      "Hot pepper-soy sauce to taste",
      "Chili powder to taste",
      "Shredded lettuce"
    ],
    "instructions": [
      "Notes: From Hawaiian Electric Kitchen",
      " In a large skillet, heat 2 tablespoons of the oil",
      " Add eggs and fry in an even layer until firm",
      " Remove and cut into strips",
      " Add onion to skillet and cook until golden brown; remove and set aside",
      " Heat remaining 3 tablespoons oil and fry shrimp for one minute",
      " Add rice, vegetables, mushrooms, half of the egg strips, the onion, and seasonings; stir fry for 3 minutes",
      " Add a little water if rice is too dry",
      " Serve on a bed of shredded lettuce and top with remaining egg strips",
      " Makes 8 servings"
    ],
    "type": "Lunch",
    "cuisine": "Malaysian",
    "servings": "1 Servings",
    "imageUrl": "ccdc350b-cc79-422a-9598-74f05c419388.jpeg"
  },
  {
    "id": "54593dd9-5604-45a5-960b-89b40a0483fe",
    "name": "Malaysian Chicken Pizza",
    "description": "A fusion of Malaysian and Italian cuisines, this Malaysian Chicken Pizza is a spicy and flavorful dish that combines the traditional pizza concept with Asian-inspired flavors. The sweet and spicy chicken topping, along with the blend of cheeses and scallions, creates a unique and satisfying meal that is sure to delight your taste buds. Perfect for a dinner gathering or a special treat for yourself.",
    "ingredients": [
      "1/4 c Packed brown sugar",
      "3/4 c Rice wine vinegar; or cider vinegar",
      "1/4 c Soy sauce; low sodium",
      "3 tb Water",
      "2 tb Chunky peanut butter",
      "1 tb Ginger root; peeled and minced",
      "1/2 ts Crushed red pepper; up to 3/4 tsp.",
      "4 Cloves garlic; minced",
      "Vegetable cooking spray",
      "1/2 lb Chicken breast; no skin, no bone, R-T-C, * cut into bite-size",
      "2 oz Swiss cheese; lowfat, **shredded (1/2 cup)",
      "1 oz Mozzarella cheese; part skim milk, **1/4 cup shredded",
      "8 oz Pizza dough; refrigerated",
      "1/4 c Chopped scallions"
    ],
    "instructions": [
      "1)",
      " Combine first eight ingredients in a bowl; stir well with a wisk and set aside",
      " 2)",
      " Coat a large, nonstick skillet with cooking spray; place over medium-high heat until hot",
      " Add chicken, and saute two minutes",
      " Remove from pan, and set aside",
      " 3)",
      " Pour vinegar mixture into skillet; bring to a boil over medium-high heat",
      " Cook 5 minutes or until slightly thickened",
      " Return chicken to pan; cook 1 minute or until chicken is done",
      " (Mixture will be the consistency of thick syrup",
      ") 4)",
      " Roll out pizza crust to desired thickness",
      " I prefer it as thin as possible",
      " Sprinkle cheeses over crust, leaving a 1/2 inch border ",
      " Top with chicken mixture",
      " 5)",
      " Bake at 500 * F for 12 minutes on bottom rack",
      " (Use a pizza stone, if available",
      ") 6)",
      " Sprinkle with scallions, and let stand five minutes",
      " 7)",
      " Cut into 8 equal slices and enjoy! NOTES : *or use 6 oz cooked, leftover chicken or turkey breast **Original recipe used regular swiss and mozzarella cheeses (if I remember correctly)",
      " I find that Jarlsburg Lite and the Sargento Light Cheeses work very well in this recipe",
      " As modified in above recipe per MasterCook analysis: 180 calories, 4",
      "5g fat(22",
      "1%CFF), 0",
      "6g fiber Weight Watcher Points = 4 points per slice This is a very flavorful (spicy) recipe! Satisfying for those suffering weight watcher boredom!"
    ],
    "type": "Dinner",
    "cuisine": "Malaysian",
    "servings": "8 servings",
    "imageUrl": "54593dd9-5604-45a5-960b-89b40a0483fe.jpeg"
  },
  {
    "id": "0cba855a-e80f-49b7-af21-d1003770499e",
    "name": "Malaysian Dream",
    "description": "Malaysian Dream is a tropical cocktail inspired by the Malaysian version of piña colada. It combines the flavors of pineapple juice, coconut milk, vodka, and grenadine syrup to create a refreshing and exotic drink. The cocktail is perfect for a tropical getaway or a relaxing evening at home.",
    "ingredients": [
      "100 ml Pineapple juice",
      "50 ml Coconut milk",
      "50 ml Vodka",
      "A dash of grenadine syrup"
    ],
    "instructions": [
      "STIR all the ingredients over ice and pour in a champagne tulip",
      " Decorate with a cocktail umbrella and with a cherry and pineapple slice fixed over a cocktail stick",
      " NOTES : The Malaysian version of pinacolada"
    ],
    "type": "Cocktail",
    "cuisine": "Malaysian",
    "servings": "1 servings",
    "imageUrl": "0cba855a-e80f-49b7-af21-d1003770499e.jpeg"
  },
  {
    "id": "ab441205-37e1-4982-962b-99cce144ab6b",
    "name": "Malaysian Prawn And Spinach Curry",
    "description": "A flavorful Malaysian curry dish featuring prawns and spinach cooked in a creamy and aromatic sauce. Serve this delicious curry with seasoned rice for a satisfying and exotic dinner experience.",
    "ingredients": [
      "2 ts Oil",
      "1 Onion; chopped",
      "2 tb Schwartz Mild Malaysian Curry Blend",
      "1 tb Plain flour",
      "1 tb Tomato puree",
      "1 150 gram car natural yogurt; (5 1/2 oz)",
      "300 ml Vegetable stock; (1/2 pint)",
      "1 pn Salt",
      "25 g Creamed coconut; (1 oz)",
      "225 g Frozen leaf spinach; defrosted and drained (8 oz)",
      "350 g Cooked; peeled prawns, defrosted if frozen (12 oz)",
      "175 g Rice; (6 oz)",
      "2 ts Schwartz Indian Rice Seasoning"
    ],
    "instructions": [
      "Heat the oil in a large frying pan and fry the onion until softened",
      " Add the Malaysian Curry Blend and cook for 1 minute",
      " Stir in the flour and tomato puree",
      " Add the yogurt a little at a time, stirring well after each addition",
      " Blend in the stock, salt and coconut",
      " Bring to the boil stirring",
      " Add the spinach and prawns and heat through",
      " Serve with rice cooked with the Indian Rice Seasoning"
    ],
    "type": "Dinner",
    "cuisine": "Malaysian",
    "servings": "4 servings",
    "imageUrl": "ab441205-37e1-4982-962b-99cce144ab6b.jpeg"
  },
  {
    "id": "f15e7423-9a4f-4d9e-938a-d2c7dea33125",
    "name": "Malaysian Stir-Fry with Fragrant Thai Rice",
    "description": "This Malaysian Stir-Fry with Fragrant Thai Rice is a delicious and fragrant dish that combines a mix of fresh vegetables, coconut milk, and aromatic spices. The stir-fried vegetables are cooked to perfection, creating a colorful and flavorful dish that is both satisfying and nutritious. Served with steamed fragrant Thai rice, this meal is perfect for a hearty dinner that will transport you to the vibrant flavors of Malaysia.",
    "ingredients": [
      "50 g Beansprouts",
      "100 g Mange tout",
      "1 tb Ginger; chopped",
      "1 Clove garlic; crushed",
      "50 g Butter",
      "2 tb Sesame oil",
      "2 Carrots; sliced",
      "2 Red chilli; seeded and sliced",
      "1 cn Coconut milk",
      "4 Spring onions",
      "75 g Shiitaki mushrooms; (optional)",
      "12 sm Broccoli florets",
      "2 Sticks lemon grass",
      "Coriander",
      "200 g Steamed fragrant Thai rice"
    ],
    "instructions": [
      "Heat a wok with the butter and sesame oil",
      " Add the garlic and ginger and cook for 20 seconds to release its fragrance",
      " Add the lemon grass and the vegetables and stir fry them for 3-4 minutes until crisp and just cooked",
      " Add the coconut milk and bring to the boil",
      " Add the coriander and chilli, adjust the seasoning and serve with the steamed Thai rice"
    ],
    "type": "Dinner",
    "cuisine": "Malaysian",
    "servings": "1 servings",
    "imageUrl": "f15e7423-9a4f-4d9e-938a-d2c7dea33125.jpeg"
  },
  {
    "id": "7460a02e-3488-4365-a549-cf62b88a608c",
    "name": "Besengek Telor (Telor Is the Malaysian Word for Egg).",
    "description": "Besengek Telor is a flavorful Malaysian dish made with boiled eggs cooked in a rich and creamy coconut milk sauce infused with a blend of traditional spices. The combination of red onions, coriander, cumin, turmeric, Spanish pepper, and coconut milk creates a delicious and aromatic sauce that coats the tender egg pieces. This dish is perfect for a hearty and satisfying dinner, showcasing the unique flavors of Malaysian cuisine.",
    "ingredients": [
      "8 Eggs",
      "2 Red onions",
      "Oil",
      "2 tb Ketoembar; (coriander)",
      "1 tb Djinten; (cummin)",
      "1 ts Koenjit; (kurkuma)",
      "1 Lombok; (spanish pepper)",
      "1 Piece of asem; ( or a drop of vinegar)",
      "Salt",
      "Creamy santen; (coconutmilk)"
    ],
    "instructions": [
      "Boil the eggs, till they are almost hard boiled Fry the ketoembar and djinten till they are dry Chop the onions and pepper very small, mix them with the left spices, the salt + asem, fry everything in oil",
      " Pell the eggs, cut them in pieces, add them with the santen to the spices and boil everything, till it is creamy"
    ],
    "type": "Dinner",
    "cuisine": "Malaysian",
    "servings": "1 Servings",
    "imageUrl": "7460a02e-3488-4365-a549-cf62b88a608c.jpeg"
  },
  {
    "id": "3c846a54-2196-4d1a-9502-4f81d1268869",
    "name": "Malaysian Curry Paste",
    "description": "This Malaysian Curry Paste recipe is a versatile and flavorful base for many Malaysian dishes. It combines a blend of aromatic spices, herbs, and seasonings to create a rich and fragrant paste. Use it to enhance the flavors of curries, soups, and stir-fries, adding a delicious Malaysian twist to your dishes.",
    "ingredients": [
      "2 tb Coriander seeds",
      "1 tb Cumin seeds",
      "1 tb Fennel seeds",
      "5 Dried red chilies such as piquins seeds and stems removed",
      "2 tb Dried shredded coconut",
      "1 ts Shrimp or prawn paste",
      "1 1\" piece fresh galangal (or ginger) peeled and chopped",
      "5 Candlenuts (or macadamia nuts or cashews), chopped",
      "1 2\" piece ginger peeled and chopped",
      "3 3\" stalks lemongrass incl the bulbs, chopped",
      "1 ts Turmeric",
      "3 Garlic cloves peeled and chopped",
      "1/2 sm Onion; chopped",
      "1 ts Salt",
      "1/4 c To 1/2 cup water for blending"
    ],
    "instructions": [
      "In a mortar or spice mill, grind the coriander, cumin, and fennel seeds into a powder",
      " Place the powder and all the remaining ingredients in a food processor or blender and puree to a fine paste",
      " Store in the smallest possible screw-top glass jar and refrigerate",
      " To prevent oxidation, cover the paste with a thin layer of vegetable oil; it will keep for a couple of months",
      " A World of Curries by Dave DeWitt and Arthur Pais ISBN 0-316-18224-9 pg 148"
    ],
    "type": "Condiment",
    "cuisine": "Malaysian",
    "servings": "1 Cup",
    "imageUrl": "3c846a54-2196-4d1a-9502-4f81d1268869.jpeg"
  },
  {
    "id": "923faa91-e48b-489a-a0ab-d946a97a2bb9",
    "name": "Malaysian Fish with Pears",
    "description": "This Malaysian Fish with Pears recipe combines the delicate flavors of white-fleshed fish with the sweetness of Bartlett pears, infused with a blend of Asian-inspired ingredients like soy sauce, sesame oil, and chile-garlic paste. The dish is steamed to perfection, creating a tender and flavorful main course that is perfect for a dinner setting. Garnished with cilantro leaves and lime wedges, this dish offers a delightful fusion of Malaysian and Western culinary influences.",
    "ingredients": [
      "1 lb Pan-Sized Trout; or other white-fleshed fish",
      "2 Bartlett Pears; peeled, seeded and quartered",
      "2 tb Dry White Wine",
      "2 tb Light Soy Sauce",
      "1/2 ts Sesame Oil",
      "1 ts Chile-Garlic Paste",
      "1 tb Rice Vinegar",
      "1/2 ts Granulated Sugar",
      "3 Green Onions; smashed and slivered",
      "3 Quarter-Size pieces Ginger; cut into matchstick pieces",
      "4 Cloves Garlic; peeled and minced",
      "1 tb Lemon Grass; minced",
      "1/2 c Cilantro Leaves; chopped",
      "1/2 Lime; in wedges",
      "6 c Water"
    ],
    "instructions": [
      "Place the fish and pears in a glass pie plate",
      " Combine remaining ingredients except cilantro, lime and water and stir to mix thoroughly",
      " Pour the mixture over the fish",
      " In a wok, or deep pot, bring water to a boil",
      " Put the pie plate of fish on a steamer tray, cover and steam the fish over the simmering water until it's flaky, about 20 minutes",
      " Serve the fish and pears on a bed of rice napped with the sauce in the bottom of the pie plate",
      " Garnish with cilantro leaves and lime wedges",
      " The choices among fish varieties in Malaysia boggles the mind",
      " In the U",
      "S",
      " you can successfully repeat this dish using pan-sized trout, grouper, or other tender fleshed fish"
    ],
    "type": "Dinner",
    "cuisine": "Malaysian",
    "servings": "2 Servings",
    "imageUrl": "923faa91-e48b-489a-a0ab-d946a97a2bb9.jpeg"
  },
  {
    "id": "63d0a372-8cb9-483a-8b0f-e8dd3a68ceba",
    "name": "Malaysian Hot Noodles with Tofu",
    "description": "A flavorful and spicy Malaysian dish featuring hot noodles with tofu, ginger, and a mix of Asian spices. This dish is a perfect blend of textures and flavors, making it a satisfying meal option for dinner or lunch.",
    "ingredients": [
      "13 oz Tofu, dried; sliced",
      "9 oz Chinese dried wheat noodles",
      "13 oz Firm tofu; cubed 1/2\"",
      "3 tb Chinese semsaem oil",
      "3 tb Fresh ginger; minced",
      "1/2 ts Yellow asafoetida powder*",
      "1 bn Choy sum**, leaves and stalk; chopped in 1\" sections",
      "3 tb Soy sauce",
      "2 tb Plain sambal oelek***",
      "3 tb Fresh lemon juice",
      "2 c Mung bean shoots"
    ],
    "instructions": [
      "Soak dried tofu slices in hot water for 15 mintues",
      " When softened, cut into 1\" squares, drain, and pat dry",
      " Cook the wheat noodles in boiling water until al dente, a little firm",
      " Drain, rinse under cold water, and drain again",
      " Heat oil in wok over high heat, and deep-fry the tofu cubes until goldenbrown",
      " Remove from pan and drain",
      " Next deep-fry the squares of dried tofu until golden brown andslightly blistered; remove and drain",
      " Heat sesame oil in another wok on full heat; saute the minced ginger for 1 minute",
      " Add the asafoeitda and choy sum and stir fry until soft",
      " Add the soy sauce, sambal oelek, lemon juice, tofu noodles",
      " Stir fry for another 2 minutes or until the noodles are hot",
      " Serve immediately",
      " *asafoetida powder: available at Indian grocers **choy sum: also known as rape ***sambal oelek: a hot condiment made from ground fresh red, hot chilies, popular in Malay and Indonesian cuisine",
      " Available at Asian grocery stores",
      " To make your own, pound together 2 red hot chilies and 1/2 tsp salt, making 2 tsp"
    ],
    "type": "Dinner",
    "cuisine": "Malaysian",
    "servings": "2 Servings",
    "imageUrl": "63d0a372-8cb9-483a-8b0f-e8dd3a68ceba.jpeg"
  },
  {
    "id": "b3e38e03-d50d-4abf-82da-6882bd289eba",
    "name": "Malaysian Peanut Sauce",
    "description": "This Malaysian Peanut Sauce is a flavorful and rich sauce that combines the nuttiness of peanut butter with the aromatic blend of garlic, onion, chiles, and shrimp paste. It has a hint of sweetness from palm or brown sugar and a tangy kick from lime juice and soy sauce. This versatile sauce can be served as a condiment or used to enhance the flavor of various dishes.",
    "ingredients": [
      "1/3 c Oil",
      "1 ts Dried garlic flakes",
      "1 tb Dried onion flakes",
      "4 Dried red chiles",
      "1 ts Shrimp paste (optional)",
      "1 tb Lime juice",
      "1 tb Dark soy sauce",
      "1 c Crunchy peanut butter",
      "1 1/2 tb Palm or brown sugar",
      "Coconut milk or water to thin to desired consistency"
    ],
    "instructions": [
      "Heat oil to moderate in a small wok or pan",
      " Place garlic and onion flakes in a fine wire strainer and lower into the oil",
      " Cook until golden",
      " Drain on paper towels",
      " Fry whole chiles until puffed and crisp, about 40 seconds",
      " Remove",
      " Drain on paper towels",
      " Let cool",
      " Discard chile seeds",
      " Fry shrimp paste in oil remaining in pan, crushing with the back of a spoon",
      " Add lime juice and soy sauce",
      " Remove from heat",
      " Add peanut butter and sugar",
      " Stir to blend well",
      " Cool",
      " Crumble garlic flakes, onion flakes, and chiles into small pieces and add to mixture",
      " Combine well",
      " Serve at room temperature",
      " Advance preparation: Prepare 1 week in advance",
      " Store in a tightly covered glass container in refrigerator",
      " If sauce is too thick, add coconut milk or water to the desired consistency"
    ],
    "type": "Sauce",
    "cuisine": "Malaysian",
    "servings": "1 Cups",
    "imageUrl": "b3e38e03-d50d-4abf-82da-6882bd289eba.jpeg"
  },
  {
    "id": "21fc1e51-c230-4827-b721-92452534d9bd",
    "name": "Empanadas (Brazilian Meat Pies)",
    "description": "Brazilian Empanadas, also known as Brazilian Meat Pies, are a popular appetizer in Brazil. These savory pastries are filled with a delicious mixture of chicken, olives, and peas, seasoned with garlic, tomato paste, and cayenne pepper. The dough is soft and delicate, encasing the flavorful filling. These empanadas are perfect for serving at parties, gatherings, or as a tasty snack.",
    "ingredients": [
      "4 c Flour",
      "1 tb Butter",
      "1 c Shortening",
      "2 Whole eggs",
      "1 Egg yolk",
      "2 ts Salt",
      "1 1/2 c Cold water",
      "For the filling:",
      "1 tb Oil",
      "1 sm Onion, finely chopped (about 1/4 cup)",
      "1 Clove garlic, minced",
      "3 Chicken legs",
      "1 Bay leaf",
      "2 tb Tomato paste",
      "Salt & pepper",
      "Water, as needed",
      "3 tb Flour",
      "1/4 c Cooked peas",
      "8 Pitted green olives, chopped",
      "Cayenne pepper",
      "1 Egg beaten with a pinch of salt for glaze"
    ],
    "instructions": [
      "Servings: Makes 50 1/2-inch empanadas Notes: Empanadas are Brazil's national appetizer, tiny pies filled with chicken olives, and peas",
      " Belita's are famous all over Brazil",
      " Empanadas are traditionally made in special molds that are almost as deep as they are wide",
      " If they are unavailable, any small tartlet molds will do",
      " \"The secret to making good dough,\" says Belita, \"is to massage it, not knead it",
      "\" It may look as if she's making mud pies, but the results are truly superb",
      " For the dough: To prepare the dough: Place the flour in a large mixing bowl and make a well in the center",
      " Place the butter, shortening, eggs, salt, and 1 cup water in the well",
      " Using one hand to mix, squeeze these ingredients through your fingers to make a paste",
      " Gradually work in the flour, squeezing the dough between your fingers to mix it",
      " Add water as necessary; the dough should be quite soft",
      " Let the dough rest for 30 minutes while you prepare the filling",
      " Heat the oil in a large saucepan",
      " Saute the onion and garlic over medium heat for 2 to 3 minutes or until soft but not brown",
      " Add the chicken, bay leaf, tomato paste, salt, and pepper, plus water just to cover",
      " Bring to a boil, reduce heat, and simmer for 20 minutes, or until the chicken is cooked",
      " Skim off the fat that rises to the surface",
      " Remove the chicken, then strain and reserve the broth",
      " When the chicken is cool enough to handle, discard the skin and remove the meat from the bone",
      " Finely shred the meat with your fingers or in a food processor",
      " Stir in the flour, peas, and olives",
      " Stir in 3 to 4 Tbsp broth; the filling should be moist but not runny",
      " Add enough cayenne to give the chicken a little bite",
      " Pinch off cherry-sized pieces of dough and use them to line the tartlet molds",
      " Belita pushes the dough in with her thumb",
      " The dough should just reach over the top of the mold",
      " Place a spoonful of filling in each crust",
      " Roll out the remaining dough and cut out tops for the empanadas",
      " Try to capture an air bubble when you place the top over the filling; according to Belita, this is what makes the pies light",
      " Seal the tartlets by pinching together the top and bottom crust",
      " Note: The empanadas can be prepared ahead to this stage and frozen",
      " Preheat the oven to 350-F",
      " Brush the tops with egg glaze",
      " Bake for 30 minutes or until golden brown",
      " Unmold and serve"
    ],
    "type": "Appetizer",
    "cuisine": "Brazilian",
    "servings": "50 Servings",
    "imageUrl": "21fc1e51-c230-4827-b721-92452534d9bd.jpeg"
  },
  {
    "id": "3c7f9b6e-658e-4d3f-881b-d2b8b647ac89",
    "name": "Ceia De Natal (Brazilian Christmas Turkey) Pt 2",
    "description": "Ceia De Natal, also known as Brazilian Christmas Turkey, is a traditional and festive dish served during Christmas celebrations in Brazil. This flavorful and succulent turkey is marinated with a rich blend of ingredients and roasted to perfection, resulting in tender meat with a crispy golden skin. The dish is often accompanied by peaches, prunes, and a savory dressing, making it a delightful centerpiece for a Christmas dinner gathering.",
    "ingredients": [
      "See part 1"
    ],
    "instructions": [
      "While it's roasting, make sure to baste the turkey at regular intervals with the remaining marinade, about every half-hour",
      " Remove the foil for the final 20 minutes of roasting to crisp the skin and turn it a rich golden brown",
      " To present, serve slices of white meat surrounded by peaches and prunes on a large platter, and the pieces of dark meat on a separate platter accompanied by the dressing"
    ],
    "type": "Dinner",
    "cuisine": "Brazilian",
    "servings": "8 Servings",
    "imageUrl": "3c7f9b6e-658e-4d3f-881b-d2b8b647ac89.jpeg"
  },
  {
    "id": "4446f24a-8628-4c2d-9047-c74719481142",
    "name": "Mariscada - Brazilian Fish Stew",
    "description": "Mariscada is a traditional Brazilian fish stew that is rich in flavor and packed with a variety of seafood including clams, mussels, codfish, shrimp, and crabmeat. The stew is seasoned with onions, tomatoes, garlic, cilantro, saffron, and a blend of spices for a delicious and hearty meal. Perfect for a special dinner occasion or a cozy night in, this Mariscada recipe brings the taste of Brazilian coastal cuisine to your table.",
    "ingredients": [
      "12 Clams",
      "1 lb Mussels",
      "2 tb Pure olive oil",
      "1 Large onion, diced",
      "2 Large ripe tomatoes, peeled,",
      "Seeded, coarsely chopped",
      "2 Cloves garlic, minced",
      "1 Sprig fresh cilantro, minced",
      "Salt& black pepper to taste",
      "Cayenne pepper to taste",
      "Pinch of saffron threads",
      "4 lb Fresh codfish fillets, cut into serving-size pieces",
      "1 lb Jb shrimp, peeled, deveined",
      "1/2 lb Fresh crabmeat, picked over for cartilage"
    ],
    "instructions": [
      "Clean the clams by scrubbing them thoroughly with a wire brush, removing any beard or barnacles",
      " Then place them in a large pot with 1 gallon of water or enough to cover, and 1/3 cup salt",
      " Allow the clams to remain for 20 minutes during which time they will expel the sand inside",
      " Continue this process, changing the water at least two more times",
      " The mussels are cleaned in a similar manner, but you must leave them in the water for at least 2 hours",
      " Throw away any clams or mussels that float or are not tightly closed",
      " Heat the olive oil in the bottom of a large, heavy saucepan over medium heat",
      " Add the onion, tomatoes, garlic, coriander, salt, peppers, and saffron and cook, stirring, until the onions have softened, but are not brown",
      " Add the fish and shellfish to the onion mixture",
      " Cover with water and bring to a boil",
      " Reduce the heat to low and simmer for 10 minutes, or until the shellfish open",
      " Discard any clams or mussels that do not open",
      " Serve hot"
    ],
    "type": "Dinner",
    "cuisine": "Brazilian",
    "servings": "10 Servings",
    "imageUrl": "4446f24a-8628-4c2d-9047-c74719481142.jpeg"
  },
  {
    "id": "6f094125-bf64-4cef-9dfe-958574e74a2b",
    "name": "Salmon with Brazilian Rub",
    "description": "A flavorful Brazilian-inspired dish featuring salmon fillets marinated in a zesty mixture of citrus juices, brown sugar, chili powder, and garlic. The salmon is then baked to perfection, creating a delicious and satisfying meal. Serve with wild and brown rice and steamed broccoli for a complete dining experience.",
    "ingredients": [
      "4 Salmon fillet",
      "1/2 lg Lemon; juice",
      "1/2 lg Orange; juice",
      "Salt and pepper",
      "1 Whole orange; zest",
      "2 tb Brown sugar; light brownulated",
      "4 tb Chili powder",
      "1 lg Garlic clove; minced",
      "2 tb Butter; melted"
    ],
    "instructions": [
      "In a shallow dish large enough to hold the salmon, combine the juices, salt and pepper",
      " Add the salmon, turning to coat with the marinade",
      " Let marinate at room temperature for 20 minutes, turning the fillets once",
      " Preheat the oven to 425F",
      " Line a shallow baking pan with aluminum foil and grease with a little of the melted butter",
      " In a small dish, combine the orange zest, brown sugar, chili powder and minced garlic",
      " Rub the marinated salmon with the brown sugar mixture",
      " Place in the pan and frizzle with the remaining melted butter",
      " Bake for 8 to 12 minutes",
      " The big challenge here is not overcooking the fillets - 8 minutes will do for think fillets (less than 1 inch) and no more than 12 minutes for the thicker fillets",
      " Serving Ideas : Serve with wild and brown rice and steamed broccoli NOTES : You do the rubbing!"
    ],
    "type": "Dinner",
    "cuisine": "Brazilian",
    "servings": "4 Servings",
    "imageUrl": "6f094125-bf64-4cef-9dfe-958574e74a2b.jpeg"
  },
  {
    "id": "d06f78b4-80b2-4a82-9cc7-1c2dfcf55bb6",
    "name": "Quick Greens, Brazilian Style",
    "description": "Quick Greens, Brazilian Style is a vibrant and flavorful dish that features tender collard greens cooked with olive oil, garlic, and seasonings. This recipe is a traditional Brazilian side dish that can also be enjoyed as a light and nutritious lunch option.",
    "ingredients": [
      "2 lb Fresh collard greens (tender, young leaves work best)",
      "3 tb Extra-virgin olive oil",
      "5 Cloves garlic, minced or to taste",
      "1/4 c Warm water",
      "Salt and freshly ground black pepper to taste"
    ],
    "instructions": [
      "Wash the collard greens thoroughly to remove any dirt or grit",
      " Drain well",
      " Pick over the greens, discarding any that are old and cutting out any discolored spots and the fleshy ribs",
      " Place leaves in a pile, roll them into a thick cylinder and cut them into thin strips crosswise",
      " Fluff the cut greens into a bowl",
      " Heat the olive oil in a heavy skillet, add the garlic, and cook until it is slightly browned",
      " Add the greens and cook, tossing them frequently to make sure they are coated with the olive oil and garlic",
      " Add the water, season, cover and cook for 5 minutes",
      " Remove and serve warm"
    ],
    "type": "Lunch",
    "cuisine": "Brazilian",
    "servings": "1 Servings",
    "imageUrl": "d06f78b4-80b2-4a82-9cc7-1c2dfcf55bb6.jpeg"
  },
  {
    "id": "c545d507-48a9-431f-829d-fb4f19404712",
    "name": "Brazilian Beer Chicken",
    "description": "This Brazilian Beer Chicken recipe features succulent grilled chicken marinated in beer, oil, mustard, and flavorful spices. The two-day marination process ensures the chicken is tender and infused with the rich flavors of Brazilian beer. It is a perfect main dish to enjoy with sides like Crazy Rice or Brazilian Black Beans with Bacon.",
    "ingredients": [
      "2 c Beer",
      "1/2 c Vegetable oil",
      "1/2 c Dijon mustard",
      "1 tb Sweet paprika",
      "1 ts Fresh ground pepper",
      "1 md Onion; thinly sliced",
      "12 Cloves garlic; thinly sliced",
      "2 Bay leaves",
      "1 Chicken; (3-4lbs.), quartered",
      "Kosher or sea salt"
    ],
    "instructions": [
      "Method: Direct grilling (two tiered) Advance Prep: 6 hrs",
      " - 2 days for marinating chicken",
      " \"The United States isn't the only place where beer and barbecue are inextricably interwoven",
      " In Rio de Janeiro, I came across this savory grilled chicken, which owes its exceptional succulence to a two-day bath in beer",
      " Try, if possible, to find a Brazilian beer if you can: Antarctica (a pilsner-style brew) will produce a mild-flavored chicken; Xingu Black Beer (a dark bitter stout) will produce a bird with a rich, malty flavor",
      " Serve with Crazy Rice or Brazilian Black Beans with Bacon (see index)",
      "\" 1) Combine the beer, oil, mustard, paprika, and pepper in a large, nonreactive bowl and whisk thoroughly to blend",
      " Stir in the onion, bay leaves, and garlic",
      " 2) Rinse the chicken pieces under cold running water, then drain and blot dry with paper towels",
      " Add to the marinade in the bowl and turn to coat",
      " Cover, and let marinate, in the redfrigerator, for 6 hours or up to 2 days (the longer the better), turning the pieces occasionally",
      " 4) When ready to cook, remove the chicken pieces from the marinade, reserving the marinade, and blot dry",
      " Season the pieces generously with salt",
      " Oil the grill grate and arrage the chicken, skin side down, on the grate over the hotter section of the grill until nicely browned (3-5 minutes)",
      " Move pieces to warmer side for another 5-7 minutes",
      " Watch carefully to avoid flareups",
      " Turn the pieces and move them back to the hotter area for 3-5 minutes, and then back to the cooler side until done",
      " Total cooking time will be 16-24 minutes",
      " During the first 10 mintes only, brush several times with the marinade",
      " < frankly, I'd bring that marinade to a boil for 5 minutes first, but since he says the \"first 10 minutes only\", that probably will be enuf time to safely use it - but why take chances> 5) Transfer chicken to serving plates and serve immediately",
      " Serves 4",
      " \"The Barbecue Bible\" Author: Steven Raichlen Publisher: Workman Publishing Editor: Suzanne Rafer Contact: Jackie Mills - (212) 614-7504 Price: US $27",
      "95"
    ],
    "type": "Main Dish",
    "cuisine": "Brazilian",
    "servings": "1 servings",
    "imageUrl": "c545d507-48a9-431f-829d-fb4f19404712.jpeg"
  },
  {
    "id": "475f673b-b372-4e7b-a559-44f1a6b96a36",
    "name": "Brazilian Black Beans",
    "description": "Brazilian Black Beans is a hearty and flavorful dish made with soaked black beans, a variety of vegetables, and a blend of spices. The beans are simmered until tender along with onions, garlic, carrot, bell pepper, and tomatoes. The addition of orange juice and cilantro adds a unique twist to this traditional Brazilian dish. Seasoned with salt, pepper, and cayenne pepper, this dish is a comforting and nutritious dinner option. Serve the Brazilian Black Beans with dollops of sour cream or wrap it in a tortilla with salsa and lettuce for a satisfying meal.",
    "ingredients": [
      "1 lb Black beans; soaked at least 4 hours preferably overnight",
      "3 c Chopped onion",
      "3 Cloves garlic; crushed or more if you like",
      "2 tb Cumin",
      "1 Carrot; diced",
      "1 Green bell pepper; diced",
      "1 c Diced tomatoes; optional, up to 2",
      "1 c Orange juice",
      "1/2 c Cilantro leaves; optional",
      "Salt and pepper and cayenne pepper to taste"
    ],
    "instructions": [
      "Place beans in large pot with water to cover and bring to a boil, cover and simmer about an hour (add more water if it seems to be getting low)",
      " Add all the veggies",
      " Cover and simmer another half hour or until beans and veggies are tender",
      " Add orange juice and cilantro and simmer a bit more",
      " Add salt and peppers to taste",
      " Serve with dollops of ff sour cream or roll up in a tortilla with salsa and lettuce ",
      " ",
      " "
    ],
    "type": "Dinner",
    "cuisine": "Brazilian",
    "servings": "1 servings",
    "imageUrl": "475f673b-b372-4e7b-a559-44f1a6b96a36.jpeg"
  },
  {
    "id": "bd88ec43-c967-4aa8-b106-b29c4be6ebbe",
    "name": "Brazilian Fish Stew",
    "description": "A flavorful and hearty stew made with boneless whitefish fillets, shrimp, tomatoes, onions, cilantro, garlic, jalapeno, and bell peppers, seasoned with lime juice and spices. This Brazilian Fish Stew is a vibrant and delicious dish that is perfect for a satisfying dinner meal.",
    "ingredients": [
      "2 1/2 lb Boneless fillets of any firm whitefish",
      "1/2 lb Small shrimp; peeled, deveined,",
      "And tails removed",
      "3 c Canned tomatoes; coarsely chopped",
      "2 c Chopped onions",
      "1/4 c Chopped fresh cilantro",
      "1 tb Minced garlic",
      "1 Jalapeno pepper; stemmed, seeded,",
      "And chopped",
      "1/4 c Fresh lime juice",
      "3 tb Vegetable oil",
      "Salt; to taste",
      "Freshly-ground black pepper; to taste",
      "1 Red bell pepper; stemmed, seeded,",
      "And diced",
      "1 Green bell pepper; stemmed, seeded,",
      "And diced",
      "1/2 c Fish stock or water"
    ],
    "instructions": [
      "Cut the fillets into bite-size pieces",
      " Cut the shrimp in half lengthwise",
      " Place in a shallow, nonreactive bowl and set aside",
      " Combine the tomatoes, onion, cilantro, garlic, chile, lime juice, oil, salt and pepper in a food processor fitted with the metal blade",
      " Process until smooth",
      " Pour over fish and allow to marinate for 1 hour",
      " Place marinated fish in a heavy saucepan over medium heat",
      " Add the bell peppers and fish stock",
      " Bring to a boil",
      " Lower heat and simmer for about 10 minutes or until fish is cooked through",
      " Serve immediately with rice, if desired",
      " This recipe yields 6 servings"
    ],
    "type": "Dinner",
    "cuisine": "Brazilian",
    "servings": "6 servings",
    "imageUrl": "bd88ec43-c967-4aa8-b106-b29c4be6ebbe.jpeg"
  },
  {
    "id": "bdcaaedb-593b-438a-aa2a-686b97d17c80",
    "name": "Canja ( Brazilian Style Chicken Soup)",
    "description": "Canja is a traditional Brazilian chicken soup that is hearty, comforting, and perfect for warming up on a cold evening. This flavorful soup is made with a combination of chicken, vegetables, rice, and herbs, creating a wholesome and satisfying meal. The rich broth, tender chicken, and aromatic herbs make Canja a delicious and nourishing option for dinner.",
    "ingredients": [
      "1 Stewing chicken",
      "8 c Water",
      "2 Onions",
      "1 Clove garlic",
      "2 Carrots; finely diced",
      "1 c Long grain rice",
      "1 Tomato; peeled , seeded and diced",
      "1 tb Parsley leaves",
      "1 tb Chopped cilantro or chopped mint",
      "Freshly ground pepper",
      "Salt",
      "Chicken gizzard"
    ],
    "instructions": [
      "This is a very simple but tasty soup, which is sure to keep you ,in the Northern Hemisphere, warm this winter",
      " 1",
      " Cut chicken into 4 pieces 2",
      " Wash chicken well with salt and lemon 3",
      " Rinse, and season with salt and pepper 4",
      " Place chicken,gizzard, onions, carrots and water in a stockpot and simmer 2 hours 5",
      " Add the garlic ( peeled whole)tomato, salt, pepper and cook another 30 minutes or until chicken is very tender",
      " 6",
      " Remove bones and skin,and shred chicken ",
      " 7",
      " Return shredded chicken to pot, add the rice and cook until rice is very soft, almost creamy",
      " Stir in parsley and cilantro",
      "Check seasonings 8",
      "Boil a few minutes and serve very hot"
    ],
    "type": "Dinner",
    "cuisine": "Brazilian",
    "servings": "1 Servings",
    "imageUrl": "bdcaaedb-593b-438a-aa2a-686b97d17c80.jpeg"
  },
  {
    "id": "ac0d98f9-4020-4244-8369-b16f7eacf22f",
    "name": "Enchiladas American Style",
    "description": "Enchiladas American Style is a flavorful and hearty dish made with fried tortillas layered with chili, cheese, vegetables, and enchilada sauce. It is a satisfying and comforting dinner option that combines savory flavors and textures, perfect for a family meal or gathering.",
    "ingredients": [
      "Oil",
      "1 pk (8-oz) frozen tortillas",
      "1 cn (15-oz) chili no beans; warmed",
      "1 cn (10oz) enchilida sauce; warmed",
      "Chopped onion",
      "Chopped bell pepper",
      "Grated cheese",
      "Chopped lettuce",
      "Chopped tomatoes"
    ],
    "instructions": [
      "Fry tortillas in hot oil for 3 seconds",
      " Drain",
      " In casserole, top each tortilla with chili and cheese",
      " Repeat in layers several times",
      " Final topping: lettuce, tomato, pepper and onion",
      " Cover with enchilada sauce",
      " MRS DENNIS STORY (EDWYNNE) MARVELL, AR"
    ],
    "type": "Dinner",
    "cuisine": "American",
    "servings": "4 Servings",
    "imageUrl": "ac0d98f9-4020-4244-8369-b16f7eacf22f.jpeg"
  },
  {
    "id": "3c52f9e9-c419-4d48-b793-7a975111f9fc",
    "name": "Great American Steakhouse Balsamic Dijon Dipping Sauce-0 Poi",
    "description": "This Great American Steakhouse Balsamic Dijon Dipping Sauce is a flavorful and tangy sauce that pairs perfectly with steak or other grilled meats. It combines the sweetness of honey mustard with the tanginess of balsamic vinegar, creating a delicious dipping sauce that enhances the flavors of your dish.",
    "ingredients": [
      "1/4 c Balsamic vinegar",
      "1 ts Spoonable Equal sweetener",
      "1 ts Water",
      "2 tb Honey mustard",
      "1 ds Salt",
      "1 ds Black pepper"
    ],
    "instructions": [
      "1",
      " Combine all ingredients in small bowl and mix well",
      " Chill",
      " Serving Size (1/4 recipe) Per MC Nutritional Analysis: Per Serving: 9",
      "5 Calories, 0",
      "6g Fat, 0g Fiber Weight Watcher Points: 0"
    ],
    "type": "Sauce",
    "cuisine": "American",
    "servings": "4 servings",
    "imageUrl": "3c52f9e9-c419-4d48-b793-7a975111f9fc.jpeg"
  },
  {
    "id": "9b2f1995-8261-40a1-acab-7c21a3a83c57",
    "name": "Great American Steakhouse Cheese Dipping Sauce - 3 Points",
    "description": "A delicious and creamy cheese dipping sauce that is perfect for appetizers or snacks.",
    "ingredients": [
      "2 tb Brummel and Brown Spread",
      "2 tb All-purpose flour",
      "1 ts Salt",
      "1 c Skim milk",
      "16 tb Reduced fat cheddar cheese",
      "1 ts Mustard; any type",
      "1 ds Seasoned salt",
      "1 ds Black pepper"
    ],
    "instructions": [
      "1",
      " In a sauce pan, melt Brummel and Brown",
      " 2",
      " Add flour and salt",
      " Stirring continually, heat until bubbly",
      " 3",
      " Slowly add milk",
      " Continue stirring over medium heat until mixture has thickened",
      " 4",
      " Add cheese and mustard",
      " Stir until cheese is melted",
      " 5",
      " Serve warm",
      " Serving Size (1/4 recipe) Per MC Nutritional Analysis: Per Serving: 110",
      "4 Calories, 4",
      "7g Fat, 0",
      "2g Fiber Weight Watcher Points: 3"
    ],
    "type": "Snack",
    "cuisine": "American",
    "servings": "4 servings",
    "imageUrl": "9b2f1995-8261-40a1-acab-7c21a3a83c57.jpeg"
  },
  {
    "id": "24869267-6821-4b22-ac69-f1059400a459",
    "name": "Great American Steakhouse Creamy Dill Dipping Sauce -1 Point",
    "description": "A creamy and flavorful dill dipping sauce perfect for pairing with steaks or appetizers.",
    "ingredients": [
      "1/2 c Fat-free sour cream",
      "1/4 c Miracle Whip Free",
      "2 tb Dill weed",
      "1 ts Lemon juice",
      "1 ds Salt",
      "1 ds Pepper"
    ],
    "instructions": [
      "1",
      " Combine all ingredients in a small mixing bowl",
      " Mix well",
      " 2",
      " Chill for 1 to 2 hours",
      " Serving Size (1/4 recipe) Per MC Nutritional Analysis: Per Serving: 38",
      "4 Calories, 0",
      "1g Fat, 0g Fiber Weight Watcher Points: 1"
    ],
    "type": "Appetizer",
    "cuisine": "American",
    "servings": "4 servings",
    "imageUrl": "24869267-6821-4b22-ac69-f1059400a459.jpeg"
  },
  {
    "id": "de986a8f-65a0-4f1e-8c6f-6dc3c8c6790f",
    "name": "Great American Steakhouse Dry Onion Mix - 2 Points",
    "description": "This recipe for Great American Steakhouse Dry Onion Mix is a flavorful and crispy appetizer featuring a blooming onion coated with a mix of savory seasonings and baked to golden perfection. Perfect for sharing and enjoying with friends and family as a tasty starter before the main course.",
    "ingredients": [
      "1 1/4 c Wheat flour",
      "1 1/4 ts Seasoned salt",
      "1 1/4 ts Onion powder",
      "3/4 ts Dry mustard",
      "1 ts Paprika",
      "1 1/4 ts Garlic powder",
      "1 1/4 ts Black pepper",
      "1 tb Cajun seasoning",
      "1 lg Sweet onions; cut to form bloom",
      "1/2 c Better'n'Eggs",
      "1/2 c Skim milk"
    ],
    "instructions": [
      "1",
      " Sift or mix the above ingredients together in a medium mixing bowl",
      " 2",
      " Cut onion to form bloom with machine",
      " 3",
      " Place onion in bowl of ice water and soak for 1 hour",
      " Remove and shake of excess water",
      " 4",
      " Lightly sprinkle onion top with mix",
      " Turn onion on side and sprinkle sides and between each petal",
      " Turn onion root side up and shake gently to remove excess mix",
      " 5",
      " In large bowl mix Better'n'Eggs and milk",
      " Lightly beat to form a wet batter",
      " 6",
      " With root side down, place onion into batter",
      " Spread petals to ensure batter covers each petal",
      " 7",
      " Bake on a cookie sheet for 30 minutes at 375 degrees F or until golden brown",
      " Serving Size (1/4 recipe) Per MC Nutritional Analysis: Per Serving: 177",
      "4 Cal, 1",
      "2g Fat, 6g Fiber Weight Watcher Points: 2"
    ],
    "type": "Appetizer",
    "cuisine": "American",
    "servings": "4 servings",
    "imageUrl": "de986a8f-65a0-4f1e-8c6f-6dc3c8c6790f.jpeg"
  },
  {
    "id": "a5989bab-d6c0-479c-9bfa-c2283fa49e08",
    "name": "Great American Steakhouse Ranch Dipping Sauce - 1 Point",
    "description": "This Great American Steakhouse Ranch Dipping Sauce is a creamy and flavorful dip perfect for pairing with veggies, chips, or as a dressing for salads. It's a light and tasty snack option that is easy to make and great for gatherings or a quick bite.",
    "ingredients": [
      "3/4 c Fat-free plain yogurt",
      "1/3 c Miracle Whip Free",
      "1 pk Dry ranch dressing"
    ],
    "instructions": [
      "1",
      " Combine all ingredients",
      " Mix well",
      " 2",
      " Refrigerate overnight or at minimum several hours",
      " Serving Size (1/4 recipe) Per MC Nutritional Analysis: Per Serving: 63",
      "8 Calories, 0",
      "1g Fat, 0g Fiber Weight Watcher Points: 1"
    ],
    "type": "Snack",
    "cuisine": "American",
    "servings": "4 servings",
    "imageUrl": "a5989bab-d6c0-479c-9bfa-c2283fa49e08.jpeg"
  },
  {
    "id": "5f0614a5-830d-41da-b0d6-e3d5462cb59f",
    "name": "Great American Steakhouse Russian Dipping Sauce - 1 Point",
    "description": "A tangy and flavorful dipping sauce perfect for pairing with steak or other grilled meats. This Russian Dipping Sauce is a classic American steakhouse condiment that adds a zesty kick to your meal.",
    "ingredients": [
      "1 c Miracle Whip Free",
      "3 tb Ketchup",
      "1 ts Onion powder",
      "1 sm Green pepper; finely minced",
      "1 ds Seasoned salt"
    ],
    "instructions": [
      "1",
      " Combine all ingredients in a small mixing bowl",
      " Mix well",
      " 2",
      " Chill",
      " Serving Size (1/4 recipe) Per MC Nutritional Analysis: Per Serving: 78",
      "6 Calories, 0",
      "1g Fat, 0",
      "5g Fiber Weight Watcher Points: 1"
    ],
    "type": "Condiment",
    "cuisine": "American",
    "servings": "4 servings",
    "imageUrl": "5f0614a5-830d-41da-b0d6-e3d5462cb59f.jpeg"
  },
  {
    "id": "78581aba-f37a-4c50-a692-179100b2046d",
    "name": "Great American Steakhouse Sweet And Sour Dipping Sauce-3 Poi",
    "description": "Great American Steakhouse Sweet And Sour Dipping Sauce is a tangy and flavorful sauce that pairs perfectly with grilled meats, especially steak. It has a balance of sweet and sour flavors, making it a versatile condiment for various dishes. Serve this sauce warm alongside your favorite grilled meats for a delicious flavor enhancement.",
    "ingredients": [
      "1 ts Cornstarch",
      "1/3 c Vinegar",
      "2 tb Oil",
      "2/3 c Pineapple juice",
      "2 tb Ketchup",
      "3 tb Brown sugar",
      "1 ds Salt"
    ],
    "instructions": [
      "1",
      " In a saucepan, whisk together vinegar and cornstarch",
      " 2",
      " Add remaining ingredients and mix using a wire whisk",
      " 3",
      " Heat until hot",
      " Serve warm",
      " Serving Size (1/4 recipe) Per MC Nutritional Analysis: Per Serving: 135",
      "5 Calories, 6",
      "9g Fat, 0",
      "2g Fiber Weight Watcher Points: 3"
    ],
    "type": "Sauce",
    "cuisine": "American",
    "servings": "4 servings",
    "imageUrl": "78581aba-f37a-4c50-a692-179100b2046d.jpeg"
  },
  {
    "id": "e184c1a8-c45d-427c-8e67-fe7bd6d0d7a7",
    "name": "Great American Steakhouse Yogurt Herb Dipping Sauce -1 Point",
    "description": "A light and tangy yogurt herb dipping sauce perfect for pairing with a variety of snacks or appetizers. This sauce is refreshing and flavorful, making it a great addition to any gathering or as a quick snack option.",
    "ingredients": [
      "1/2 c Fat-free plain yogurt",
      "1/2 c Fat-free sour cream",
      "1 ts Parsley; chopped",
      "1 ts Cilantro; chopped, optional",
      "1 ts Green onion; chopped",
      "1/2 ts Celery salt"
    ],
    "instructions": [
      "1",
      " Combine all ingredients in a small bowl",
      " Mix well",
      " 2",
      " Refrigerate 1-2 hours to allow flavors to blend",
      " Serving Size (1/4 recipe) Per MC Nutritional Analysis: Per Serving: 36",
      "7 Calories, 0",
      "1g Fat, 0",
      "1g Fiber Weight Watcher Points: 1"
    ],
    "type": "Snack",
    "cuisine": "American",
    "servings": "4 servings",
    "imageUrl": "e184c1a8-c45d-427c-8e67-fe7bd6d0d7a7.jpeg"
  },
  {
    "id": "dcd8387a-d6ef-4154-b2dd-d97d774b73a1",
    "name": "All - American Club Wraps",
    "description": "All-American Club Wraps are delicious and satisfying wraps filled with crispy bacon, garden vegetables, turkey breast, lettuce, and tomatoes. Perfect for a quick and flavorful lunch option.",
    "ingredients": [
      "8 sl Bacon",
      "4 (8 or 9 inch) garden vegetable flour tortillas",
      "1/2 c Purchased bacon dip",
      "8 Lettuce leaves",
      "1/2 lb Thinly sliced deli cooked turkey breast",
      "1 lg Tomato, seeded, chopped"
    ],
    "instructions": [
      "Cook bacon until crisp",
      " Drain on paper towel; crumble and set aside",
      " Spread each tortilla evenly with dip to within 1/2 inch of edges"
    ],
    "type": "Lunch",
    "cuisine": "American",
    "servings": "4 Wraps",
    "imageUrl": "dcd8387a-d6ef-4154-b2dd-d97d774b73a1.jpeg"
  }
]